<?php
/**
*
* This file is part of the Ukrainian Language Pack
* for the phpBB Forum Software.
*
* @copyright (c) 2026 Magnum <https://magnumblog.space>
* @license GNU General Public License, version 2 (GPL-2.0)
*
* Ukrainian translation by Magnum (magnumblog.space)
*
*/

/**
* DO NOT CHANGE
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine

$lang = array_merge($lang, array(
	'ACP_ATTACHMENT_SETTINGS_EXPLAIN'	=> 'Тут ви можете налаштувати основні параметри вкладень і пов’язані спеціальні категорії.',
	'ACP_EXTENSION_GROUPS_EXPLAIN'		=> 'Тут ви можете додавати, видаляти, змінювати чи вимикати групи розширень. Додаткові параметри включають призначення їм спеціальної категорії, зміну механізму завантаження та визначення значка завантаження, який буде показано перед вкладенням, що належить до групи.',
	'ACP_MANAGE_EXTENSIONS_EXPLAIN'		=> 'Тут ви можете керувати дозволеними розширеннями файлів. Щоб активувати ваші розширення, будь ласка, зверніться до панелі керування групами розширень. Ми настійно рекомендуємо не дозволяти скриптові розширення (такі як <code>php</code>, <code>php3</code>, <code>php4</code>, <code>phtml</code>, <code>pl</code>, <code>cgi</code>, <code>py</code>, <code>rb</code>, <code>asp</code>, <code>aspx</code> тощо…).',
	'ACP_ORPHAN_ATTACHMENTS_EXPLAIN'	=> 'Тут ви можете переглядати «осиротілі» файли. Це трапляється здебільшого, коли користувачі додають файли, але не надсилають повідомлення. Ви можете видалити файли або прикріпити їх до наявних повідомлень. Прикріплення до повідомлень вимагає дійсного ID повідомлення, вам потрібно визначити цей ID самостійно. Це призначить вже завантажене вкладення до вказаного вами повідомлення.',
	'ADD_EXTENSION'						=> 'Додати розширення',
	'ADD_EXTENSION_GROUP'				=> 'Додати групу розширень',
	'ADMIN_UPLOAD_ERROR'				=> 'Помилки під час спроби прикріпити файл: «%s».',
	'ALLOWED_FORUMS'					=> 'Дозволені форуми',
	'ALLOWED_FORUMS_EXPLAIN'			=> 'Можливість публікувати призначені розширення в обраних (або всіх, якщо обрано) форумах.',
	'ALLOWED_IN_PM_POST'				=> 'Дозволено',
	'ALLOW_ATTACHMENTS'					=> 'Дозволити вкладення',
	'ALLOW_ALL_FORUMS'					=> 'Дозволити всі форуми',
	'ALLOW_IN_PM'						=> 'Дозволено в особистих повідомленнях',
	'ALLOW_PM_ATTACHMENTS'				=> 'Дозволити вкладення в особистих повідомленнях',
	'ALLOW_SELECTED_FORUMS'				=> 'Лише форуми, обрані нижче',
	'ASSIGNED_EXTENSIONS'				=> 'Призначені розширення',
	'ASSIGNED_GROUP'					=> 'Призначена група розширень',
	'ATTACH_EXTENSIONS_URL'				=> 'Розширення',
	'ATTACH_EXT_GROUPS_URL'				=> 'Групи розширень',
	'ATTACH_ID'							=> 'ID',
	'ATTACH_MAX_FILESIZE'				=> 'Максимальний розмір файлу',
	'ATTACH_MAX_FILESIZE_EXPLAIN'		=> 'Максимальний розмір кожного файлу. Якщо це значення 0, розмір файлу для завантаження обмежений лише вашою конфігурацією PHP.',
	'ATTACH_MAX_PM_FILESIZE'			=> 'Максимальний розмір файлу для повідомлень',
	'ATTACH_MAX_PM_FILESIZE_EXPLAIN'	=> 'Максимальний розмір кожного файлу, доданого до особистого повідомлення, з 0 — без обмежень.',
	'ATTACH_ORPHAN_URL'					=> 'Осиротілі вкладення',
	'ATTACH_POST_ID'					=> 'ID повідомлення',
	'ATTACH_POST_TYPE'					=> 'Тип повідомлення',
	'ATTACH_QUOTA'						=> 'Загальна квота вкладень',
	'ATTACH_QUOTA_EXPLAIN'				=> 'Максимальний обсяг дискового простору для вкладень для всього форуму, з 0 — без обмежень.',
	'ATTACH_TO_POST'					=> 'Прикріпити файл до повідомлення',

	'CAT_IMAGES'				=> 'Зображення',
	'CHECK_CONTENT'				=> 'Перевіряти файли вкладень',
	'CHECK_CONTENT_EXPLAIN'		=> 'Деякі браузери можна обманути, змусивши їх припустити неправильний mime-тип для завантажених файлів. Цей параметр гарантує відхилення таких файлів, які ймовірно можуть це спричинити.',
	'CREATE_GROUP'				=> 'Створити нову групу',
	'CREATE_THUMBNAIL'			=> 'Створити мініатюру',
	'CREATE_THUMBNAIL_EXPLAIN'	=> 'Створювати мініатюру за всіх можливих ситуацій.',

	'DEFINE_ALLOWED_IPS'			=> 'Визначити дозволені IP/імена хостів',
	'DEFINE_DISALLOWED_IPS'			=> 'Визначити заборонені IP/імена хостів',
	'DOWNLOAD_ADD_IPS_EXPLAIN'		=> 'Щоб вказати кілька різних IP-адрес або імен хостів, вводьте кожне з нового рядка. Щоб вказати діапазон IP-адрес, розділіть початок і кінець дефісом (-), щоб вказати символ підстановки, використовуйте «*».',
	'DOWNLOAD_REMOVE_IPS_EXPLAIN'	=> 'Ви можете видалити (або скасувати виключення) кількох IP-адрес одночасно, використовуючи відповідну комбінацію миші та клавіатури для вашого комп’ютера й браузера. Виключені IP-адреси мають синій фон.',
	'DISPLAY_INLINED'				=> 'Показувати зображення в тексті',
	'DISPLAY_INLINED_EXPLAIN'		=> 'Якщо встановлено «Ні», вкладення-зображення будуть показані як посилання.',
	'DISPLAY_ORDER'					=> 'Порядок показу вкладень',
	'DISPLAY_ORDER_EXPLAIN'			=> 'Показувати вкладення, впорядковані за часом.',

	'EDIT_EXTENSION_GROUP'			=> 'Редагувати групу розширень',
	'EXCLUDE_ENTERED_IP'			=> 'Увімкніть це, щоб виключити введений IP/ім’я хоста.',
	'EXCLUDE_FROM_ALLOWED_IP'		=> 'Виключити IP з дозволених IP/імен хостів',
	'EXCLUDE_FROM_DISALLOWED_IP'	=> 'Виключити IP із заборонених IP/імен хостів',
	'EXTENSIONS_UPDATED'			=> 'Розширення успішно оновлено.',
	'EXTENSION_EXIST'				=> 'Розширення %s вже існує.',
	'EXTENSION_GROUP'				=> 'Група розширень',
	'EXTENSION_GROUPS'				=> 'Групи розширень',
	'EXTENSION_GROUP_DELETED'		=> 'Групу розширень успішно видалено.',
	'EXTENSION_GROUP_EXIST'			=> 'Група розширень %s вже існує.',

	'EXT_GROUP_ARCHIVES'			=> 'Архіви',
	'EXT_GROUP_DOCUMENTS'			=> 'Документи',
	'EXT_GROUP_DOWNLOADABLE_FILES'	=> 'Файли для завантаження',
	'EXT_GROUP_IMAGES'				=> 'Зображення',
	'EXT_GROUP_PLAIN_TEXT'			=> 'Звичайний текст',

	'FILES_GONE'			=> 'Деякі з обраних вами для видалення вкладень не існують. Можливо, їх вже видалено. Наявні вкладення було видалено.',
	'FILES_STATS_WRONG'		=> 'Ваша статистика файлів, ймовірно, неточна і потребує повторної синхронізації. Фактичні значення: кількість вкладень = %1$d, загальний розмір вкладень = %2$s.<br />Натисніть %3$sтут%4$s, щоб синхронізувати їх.',

	'GO_TO_EXTENSIONS'		=> 'Перейти до екрана керування розширеннями',
	'GROUP_NAME'			=> 'Назва групи',

	'IMAGE_LINK_SIZE'			=> 'Розміри посилання зображення',
	'IMAGE_LINK_SIZE_EXPLAIN'	=> 'Показувати вкладення-зображення як текстове посилання в тексті, якщо зображення більше за це значення. Щоб вимкнути цю поведінку, встановіть значення 0 пкс на 0 пкс.',
	'IMAGE_QUALITY'				=> 'Якість завантажених вкладень-зображень (лише JPEG)',
	'IMAGE_QUALITY_EXPLAIN'		=> 'Вкажіть значення від 50% (менший розмір файлу) до 90% (вища якість). Якість вища за 90% збільшує розмір файлу і вимкнена. Налаштування застосовується лише якщо максимальні розміри зображення встановлено на значення, відмінне від 0 пкс на 0 пкс.',
	'IMAGE_STRIP_METADATA'		=> 'Видаляти метадані зображення (лише JPEG)',
	'IMAGE_STRIP_METADATA_EXPLAIN'	=> 'Видаляє метадані Exif, напр. ім’я автора, GPS-координати та дані камери. Налаштування застосовується лише якщо максимальні розміри зображення встановлено на значення, відмінне від 0 пкс на 0 пкс.',

	'MAX_ATTACHMENTS'				=> 'Максимальна кількість вкладень на повідомлення',
	'MAX_ATTACHMENTS_PM'			=> 'Максимальна кількість вкладень на особисте повідомлення',
	'MAX_EXTGROUP_FILESIZE'			=> 'Максимальний розмір файлу',
	'MAX_IMAGE_SIZE'				=> 'Максимальні розміри зображення',
	'MAX_IMAGE_SIZE_EXPLAIN'		=> 'Максимальні розміри вкладень-зображень. phpBB може спробувати автоматично змінити розмір зображень перед завантаженням до цих максимальних розмірів. Встановіть обидва значення на 0 пкс на 0 пкс, щоб вимкнути перевірку розмірів і автоматичну зміну розміру.',
	'MAX_THUMB_WIDTH'				=> 'Максимальна ширина/висота мініатюри в пікселях',
	'MAX_THUMB_WIDTH_EXPLAIN'		=> 'Згенерована мініатюра не перевищить встановлену тут ширину/висоту.',
	'MIN_THUMB_FILESIZE'			=> 'Мінімальний розмір файлу для мініатюри',
	'MIN_THUMB_FILESIZE_EXPLAIN'	=> 'Не створювати мініатюру для зображень, менших за це значення.',
	'MODE_INLINE'					=> 'У тексті',
	'MODE_PHYSICAL'					=> 'Фізично',

	'NOT_ALLOWED_IN_PM'			=> 'Дозволено лише в повідомленнях',
	'NOT_ALLOWED_IN_PM_POST'	=> 'Не дозволено',
	'NOT_ASSIGNED'				=> 'Не призначено',
	'NO_ATTACHMENTS'			=> 'Вкладень за цей період не знайдено.',
	'NO_EXT_GROUP'				=> 'Немає',
	'NO_EXT_GROUP_ALLOWED_PM'	=> 'Немає <a href="%s">дозволених груп розширень</a> для особистих повідомлень.',
	'NO_EXT_GROUP_ALLOWED_POST'	=> 'Немає <a href="%s">дозволених груп розширень</a> для повідомлень.',
	'NO_EXT_GROUP_NAME'			=> 'Назву групи не введено',
	'NO_EXT_GROUP_SPECIFIED'	=> 'Групу розширень не вказано.',
	'NO_FILE_CAT'				=> 'Немає',
	'NO_IMAGE'					=> 'Немає зображення',
	'NO_UPLOAD_DIR'				=> 'Вказана вами тека для завантаження не існує.',
	'NO_WRITE_UPLOAD'			=> 'До вказаної вами теки для завантаження неможливо записати. Будь ласка, змініть права доступу, щоб дозволити веб-серверу записувати до неї.',

	'ONLY_ALLOWED_IN_PM'	=> 'Дозволено лише в особистих повідомленнях',
	'ORDER_ALLOW_DENY'		=> 'Дозволити',
	'ORDER_DENY_ALLOW'		=> 'Заборонити',

	'REMOVE_ALLOWED_IPS'			=> 'Видалити або скасувати виключення <em>дозволених</em> IP/імен хостів',
	'REMOVE_DISALLOWED_IPS'			=> 'Видалити або скасувати виключення <em>заборонених</em> IP/імен хостів',
	'RESYNC_FILES_STATS_CONFIRM'	=> 'Ви впевнені, що бажаєте синхронізувати статистику файлів?',

	'SECURE_ALLOW_DENY'				=> 'Список дозволу/заборони',
	'SECURE_ALLOW_DENY_EXPLAIN'		=> 'Змінити типову поведінку списку дозволу/заборони при увімкнених безпечних завантаженнях на <strong>білий список</strong> (Дозволити) чи <strong>чорний список</strong> (Заборонити).',
	'SECURE_DOWNLOADS'				=> 'Увімкнути безпечні завантаження',
	'SECURE_DOWNLOADS_EXPLAIN'		=> 'При увімкненому цьому параметрі завантаження обмежено визначеними вами IP/іменами хостів.',
	'SECURE_DOWNLOAD_NOTICE'		=> 'Безпечні завантаження не увімкнено. Налаштування нижче будуть застосовані після увімкнення безпечних завантажень.',
	'SECURE_DOWNLOAD_UPDATE_SUCCESS'=> 'Список IP успішно оновлено.',
	'SECURE_EMPTY_REFERRER'			=> 'Дозволити порожній реферер',
	'SECURE_EMPTY_REFERRER_EXPLAIN'	=> 'Безпечні завантаження базуються на реферерах. Чи бажаєте ви дозволити завантаження для тих, хто не вказує реферер?',
	'SETTINGS_CAT_IMAGES'			=> 'Налаштування категорії зображень',
	'SPECIAL_CATEGORY'				=> 'Спеціальна категорія',
	'SPECIAL_CATEGORY_EXPLAIN'		=> 'Спеціальні категорії відрізняються способом показу в повідомленнях.',
	'SUCCESSFULLY_UPLOADED'			=> 'Успішно завантажено.',
	'SUCCESS_EXTENSION_GROUP_ADD'	=> 'Групу розширень успішно додано.',
	'SUCCESS_EXTENSION_GROUP_EDIT'	=> 'Групу розширень успішно оновлено.',

	'UPLOADING_FILES'				=> 'Завантаження файлів',
	'UPLOADING_FILE_TO'				=> 'Завантаження файлу «%1$s» до повідомлення номер %2$d…',
	'UPLOAD_DENIED_FORUM'			=> 'У вас немає права завантажувати файли до форуму «%s».',
	'UPLOAD_DIR'					=> 'Тека завантаження',
	'UPLOAD_DIR_EXPLAIN'			=> 'Шлях зберігання вкладень. Зверніть увагу, якщо ви зміните цю теку, вже маючи завантажені вкладення, вам потрібно буде вручну скопіювати файли до нового розташування.',
	'UPLOAD_ICON'					=> 'Значок завантаження',
	'UPLOAD_NOT_DIR'				=> 'Вказане вами місце завантаження, здається, не є текою.',
	'UPLOAD_POST_NOT_EXIST'         => 'Файл «%1$s» неможливо завантажити до повідомлення номер %2$d, оскільки таке повідомлення не існує.',
));
