<?php
/**
*
* This file is part of the Ukrainian Language Pack
* for the phpBB Forum Software.
*
* @copyright (c) 2026 Magnum <https://magnumblog.space>
* @license GNU General Public License, version 2 (GPL-2.0)
*
* Ukrainian translation by Magnum (magnumblog.space)
*
*/

/**
* DO NOT CHANGE
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine

// Board Settings
$lang = array_merge($lang, array(
	'ACP_BOARD_SETTINGS_EXPLAIN'	=> 'Тут ви можете визначити базову роботу вашого форуму, дати йому відповідну назву й опис, а також, серед іншого, налаштувати значення за замовчуванням для часового поясу та мови.',
	'BOARD_INDEX_TEXT'				=> 'Текст головної сторінки форуму',
	'BOARD_INDEX_TEXT_EXPLAIN'		=> 'Цей текст показується як головна сторінка форуму в навігаційних хлібних крихтах. Якщо не вказано, за замовчуванням буде «Головна форуму».',
	'BOARD_STYLE'					=> 'Стиль форуму',
	'CUSTOM_DATEFORMAT'				=> 'Власний…',
	'DEFAULT_DATE_FORMAT'			=> 'Формат дати',
	'DEFAULT_DATE_FORMAT_EXPLAIN'	=> 'Синтаксис використовує той самий формат, що й <a href="https://www.php.net/manual/datetime.format.php">функції дати PHP</a>.',
	'DEFAULT_LANGUAGE'				=> 'Мова за замовчуванням',
	'DEFAULT_STYLE'					=> 'Стиль за замовчуванням',
	'DEFAULT_STYLE_EXPLAIN'			=> 'Стиль за замовчуванням для нових користувачів.',
	'DISABLE_BOARD'					=> 'Вимкнути форум',
	'DISABLE_BOARD_EXPLAIN'			=> 'Це зробить форум недоступним для користувачів, які не є ні адміністраторами, ні модераторами. За бажанням ви також можете ввести коротке (255 символів) повідомлення для показу.',
	'DISPLAY_LAST_SUBJECT'			=> 'Показувати тему останнього доданого повідомлення в списку форумів',
	'DISPLAY_LAST_SUBJECT_EXPLAIN'	=> 'Тема останнього доданого повідомлення буде показана в списку форумів з гіперпосиланням на повідомлення. Теми з форумів, захищених паролем, і форумів, до яких користувач не має доступу для читання, не показуються.',
	'DISPLAY_UNAPPROVED_POSTS'		=> 'Показувати автору несхвалені повідомлення',
	'DISPLAY_UNAPPROVED_POSTS_EXPLAIN'	=> 'Автор може переглядати несхвалені повідомлення. Не стосується повідомлень гостей.',
	'GUEST_STYLE'					=> 'Стиль для гостей',
	'GUEST_STYLE_EXPLAIN'			=> 'Стиль форуму для гостей.',
	'OVERRIDE_STYLE'				=> 'Перевизначити стиль користувача',
	'OVERRIDE_STYLE_EXPLAIN'		=> 'Замінює стиль користувача (і гостя) стилем, визначеним у «Стиль за замовчуванням».',
	'SITE_DESC'						=> 'Опис сайту',
	'SITE_HOME_TEXT'				=> 'Текст основного вебсайту',
	'SITE_HOME_TEXT_EXPLAIN'		=> 'Цей текст буде показано як посилання на головну сторінку вашого вебсайту в навігаційних хлібних крихтах форуму. Якщо не вказано, за замовчуванням буде «Головна».',
	'SITE_HOME_URL'					=> 'URL-адреса основного вебсайту',
	'SITE_HOME_URL_EXPLAIN'			=> 'Якщо вказано, посилання на цю URL-адресу буде додано на початок навігаційних хлібних крихт форуму, і логотип форуму посилатиметься на цю URL-адресу замість головної сторінки форуму. Потрібна абсолютна URL-адреса, напр. <samp>http://www.phpbb.com</samp>.',
	'SITE_NAME'						=> 'Назва сайту',
	'SYSTEM_TIMEZONE'				=> 'Часовий пояс для гостей',
	'SYSTEM_TIMEZONE_EXPLAIN'			=> 'Часовий пояс, який використовується для показу часу користувачам, які не увійшли (гості, боти). Користувачі, що увійшли, встановлюють свій часовий пояс під час реєстрації і можуть змінити його в панелі керування користувача.',
	'WARNINGS_EXPIRE'				=> 'Тривалість попередження',
	'WARNINGS_EXPIRE_EXPLAIN'		=> 'Кількість днів, яка мине, перш ніж попередження автоматично закінчиться в записі користувача. Встановіть це значення на 0, щоб зробити попередження постійними.',
));

// Board Features
$lang = array_merge($lang, array(
	'ACP_BOARD_FEATURES_EXPLAIN'	=> 'Тут ви можете вмикати/вимикати кілька функцій форуму.',

	'ALLOW_ATTACHMENTS'			=> 'Дозволити вкладення',
	'ALLOW_BIRTHDAYS'			=> 'Дозволити дні народження',
	'ALLOW_BIRTHDAYS_EXPLAIN'	=> 'Дозволити вказувати дні народження та показувати вік у профілях. Зверніть увагу, список днів народження на головній сторінці форуму контролюється окремим параметром завантаження.',
	'ALLOW_BOOKMARKS'			=> 'Дозволити додавання тем до закладок',
	'ALLOW_BOOKMARKS_EXPLAIN'	=> 'Користувач може зберігати особисті закладки.',
	'ALLOW_BBCODE'				=> 'Дозволити BBCode',
	'ALLOW_FORUM_NOTIFY'		=> 'Дозволити підписку на форуми',
	'ALLOW_NAME_CHANGE'			=> 'Дозволити зміну імені користувача',
	'ALLOW_NO_CENSORS'			=> 'Дозволити вимикання цензури слів',
	'ALLOW_NO_CENSORS_EXPLAIN'	=> 'Користувачі можуть вимикати автоматичну цензуру слів у повідомленнях та особистих повідомленнях.',
	'ALLOW_PM_ATTACHMENTS'		=> 'Дозволити вкладення в особистих повідомленнях',
	'ALLOW_PM_REPORT'			=> 'Дозволити користувачам скаржитися на особисті повідомлення',
	'ALLOW_PM_REPORT_EXPLAIN'	=> 'Якщо це налаштування увімкнено, користувачі можуть скаржитися модераторам форуму на отримане чи надіслане особисте повідомлення. Ці особисті повідомлення потім будуть видимі в панелі модератора.',
	'ALLOW_QUICK_REPLY'			=> 'Дозволити швидку відповідь',
	'ALLOW_QUICK_REPLY_EXPLAIN'	=> 'Цей перемикач дозволяє вимкнути швидку відповідь для всього форуму. При увімкненні для визначення того, чи показується швидка відповідь в окремих форумах, використовуватимуться специфічні для форуму налаштування.',
	'ALLOW_QUICK_REPLY_BUTTON'	=> 'Надіслати та увімкнути швидку відповідь у всіх форумах',
	'ALLOW_SIG'					=> 'Дозволити підписи',
	'ALLOW_SIG_BBCODE'			=> 'Дозволити BBCode у підписах користувачів',
	'ALLOW_SIG_FLASH'			=> 'Дозволити використання тегу BBCode <code>[FLASH]</code> у підписах користувачів',
	'ALLOW_SIG_IMG'				=> 'Дозволити використання тегу BBCode <code>[IMG]</code> у підписах користувачів',
	'ALLOW_SIG_LINKS'			=> 'Дозволити використання посилань у підписах користувачів',
	'ALLOW_SIG_LINKS_EXPLAIN'	=> 'Якщо заборонено, тег BBCode <code>[URL]</code> та автоматичні/магічні URL-адреси вимкнено.',
	'ALLOW_SIG_SMILIES'			=> 'Дозволити використання смайлів у підписах користувачів',
	'ALLOW_SMILIES'				=> 'Дозволити смайли',
	'ALLOW_TOPIC_NOTIFY'		=> 'Дозволити підписку на теми',
	'BOARD_PM'					=> 'Особисті повідомлення',
	'BOARD_PM_EXPLAIN'			=> 'Увімкнути особисті повідомлення для всіх користувачів.',
	'ALLOW_BOARD_NOTIFICATIONS' => 'Дозволити сповіщення форуму',
));

// Avatar Settings
$lang = array_merge($lang, array(
	'ACP_AVATAR_SETTINGS_EXPLAIN'	=> 'Тут ви можете визначити налаштування, пов’язані з аватарами.',
	'ALLOW_AVATARS'					=> 'Увімкнути аватари',
	'ALLOW_AVATARS_EXPLAIN'			=> 'Дозволити загальне використання аватарів;<br>Якщо ви вимкнете аватари загалом чи аватари певного режиму, вимкнені аватари більше не показуватимуться на форумі, але користувачі все ще зможуть завантажувати власні аватари в панелі керування користувача.',
	'ALLOW_GRAVATAR'				=> 'Увімкнути аватари Gravatar',
	'ALLOW_LOCAL'					=> 'Увімкнути аватари з галереї',
	'ALLOW_REMOTE'					=> 'Увімкнути віддалені аватари',
	'ALLOW_REMOTE_EXPLAIN'			=> 'Аватари, посилання на які надаються з іншого вебсайту.<br><em><strong class="error">Увага:</strong> Увімкнення цієї функції може дозволити користувачам перевіряти наявність файлів і служб, доступних лише в локальній мережі.</em>',
	'ALLOW_REMOTE_UPLOAD'			=> 'Увімкнути завантаження віддалених аватарів',
	'ALLOW_REMOTE_UPLOAD_EXPLAIN'	=> 'Дозволити завантаження аватарів з іншого вебсайту.<br><em><strong class="error">Увага:</strong> Увімкнення цієї функції може дозволити користувачам перевіряти наявність файлів і служб, доступних лише в локальній мережі.</em>',
	'ALLOW_UPLOAD'					=> 'Увімкнути завантаження аватарів',
	'AVATAR_GALLERY_PATH'			=> 'Шлях галереї аватарів',
	'AVATAR_GALLERY_PATH_EXPLAIN'	=> 'Шлях у межах кореневої теки phpBB для попередньо завантажених зображень, напр. <samp>images/avatars/gallery</samp>.<br>Подвійні крапки на кшталт <samp>../</samp> будуть видалені зі шляху з міркувань безпеки.',
	'AVATAR_STORAGE_PATH'			=> 'Шлях зберігання аватарів',
	'AVATAR_STORAGE_PATH_EXPLAIN'	=> 'Шлях у межах кореневої теки phpBB, напр. <samp>images/avatars/upload</samp>.<br>Завантаження аватарів <strong>буде недоступним</strong>, якщо цей шлях недоступний для запису.<br>Подвійні крапки на кшталт <samp>../</samp> будуть видалені зі шляху з міркувань безпеки.',
	'MAX_AVATAR_SIZE'				=> 'Максимальні розміри аватара',
	'MAX_AVATAR_SIZE_EXPLAIN'		=> 'Ширина x Висота в пікселях.',
	'MAX_FILESIZE'					=> 'Максимальний розмір файлу аватара',
	'MAX_FILESIZE_EXPLAIN'			=> 'Для завантажених файлів аватарів. Якщо це значення 0, розмір завантаженого файлу обмежений лише вашою конфігурацією PHP.',
	'MIN_AVATAR_SIZE'				=> 'Мінімальні розміри аватара',
	'MIN_AVATAR_SIZE_EXPLAIN'		=> 'Ширина x Висота в пікселях.',
));

// Message Settings
$lang = array_merge($lang, array(
	'ACP_MESSAGE_SETTINGS_EXPLAIN'		=> 'Тут ви можете встановити всі налаштування за замовчуванням для особистих повідомлень.',

	'ALLOW_BBCODE_PM'			=> 'Дозволити BBCode в особистих повідомленнях',
	'ALLOW_FLASH_PM'			=> 'Дозволити використання тегу BBCode <code>[FLASH]</code>',
	'ALLOW_FLASH_PM_EXPLAIN'	=> 'Зверніть увагу, можливість використовувати flash в особистих повідомленнях, якщо увімкнено тут, також залежить від прав.',
	'ALLOW_FORWARD_PM'			=> 'Дозволити пересилання особистих повідомлень',
	'ALLOW_IMG_PM'				=> 'Дозволити використання тегу BBCode <code>[IMG]</code>',
	'ALLOW_MASS_PM'				=> 'Дозволити надсилання особистих повідомлень кільком користувачам і групам',
	'ALLOW_MASS_PM_EXPLAIN'		=> 'Надсилання групам можна налаштувати для кожної групи окремо на сторінці налаштувань групи.',
	'ALLOW_PRINT_PM'			=> 'Дозволити перегляд для друку в особистих повідомленнях',
	'ALLOW_QUOTE_PM'			=> 'Дозволити цитати в особистих повідомленнях',
	'ALLOW_SIG_PM'				=> 'Дозволити підпис в особистих повідомленнях',
	'ALLOW_SMILIES_PM'			=> 'Дозволити смайли в особистих повідомленнях',
	'BOXES_LIMIT'				=> 'Максимальна кількість особистих повідомлень на теку',
	'BOXES_LIMIT_EXPLAIN'		=> 'Користувачі можуть отримувати не більше такої кількості повідомлень у кожній зі своїх тек особистих повідомлень. Встановіть це значення на 0, щоб дозволити необмежену кількість повідомлень.',
	'BOXES_MAX'					=> 'Максимальна кількість тек особистих повідомлень',
	'BOXES_MAX_EXPLAIN'			=> 'За замовчуванням користувачі можуть створювати таку кількість особистих тек для особистих повідомлень.',
	'ENABLE_PM_ICONS'			=> 'Увімкнути використання значків тем в особистих повідомленнях',
	'FULL_FOLDER_ACTION'		=> 'Дія за замовчуванням для повної теки',
	'FULL_FOLDER_ACTION_EXPLAIN'=> 'Дія за замовчуванням, яку слід виконати, якщо тека користувача заповнена, за умови, що дія для теки користувача, якщо взагалі встановлена, не застосовна. Єдиний виняток — тека «Надіслані повідомлення», де дією за замовчуванням завжди є видалення старих повідомлень.',
	'HOLD_NEW_MESSAGES'			=> 'Затримувати нові повідомлення',
	'PM_EDIT_TIME'				=> 'Обмежити час редагування',
	'PM_EDIT_TIME_EXPLAIN'		=> 'Обмежує доступний час для редагування особистого повідомлення, яке ще не доставлено. Встановлення значення на 0 вимикає цю поведінку.',
	'PM_MAX_RECIPIENTS'			=> 'Максимальна кількість дозволених отримувачів',
	'PM_MAX_RECIPIENTS_EXPLAIN'	=> 'Максимальна кількість дозволених отримувачів в особистому повідомленні. Якщо введено 0, дозволена необмежена кількість. Це налаштування можна змінити для кожної групи окремо на сторінці налаштувань групи.',
));

// Post Settings
$lang = array_merge($lang, array(
	'ACP_POST_SETTINGS_EXPLAIN'			=> 'Тут ви можете встановити всі налаштування за замовчуванням для публікацій.',
	'ALLOW_POST_LINKS'					=> 'Дозволити посилання в повідомленнях/особистих повідомленнях',
	'ALLOW_POST_LINKS_EXPLAIN'			=> 'Якщо заборонено, тег BBCode <code>[URL]</code> та автоматичні/магічні URL-адреси вимкнено.',
	'ALLOWED_SCHEMES_LINKS'				=> 'Дозволені схеми в посиланнях',
	'ALLOWED_SCHEMES_LINKS_EXPLAIN'		=> 'Користувачі можуть публікувати лише URL-адреси без схеми або одну зі списку дозволених схем, розділених комою.',
	'ALLOW_POST_FLASH'					=> 'Дозволити використання тегу BBCode <code>[FLASH]</code> у повідомленнях',
	'ALLOW_POST_FLASH_EXPLAIN'			=> 'Якщо заборонено, тег BBCode <code>[FLASH]</code> вимкнено в повідомленнях. Інакше система прав контролює, які користувачі можуть використовувати тег BBCode <code>[FLASH]</code>.',

	'BUMP_INTERVAL'					=> 'Інтервал підняття',
	'BUMP_INTERVAL_EXPLAIN'			=> 'Кількість хвилин, годин чи днів між останнім повідомленням у темі та можливістю підняти цю тему. Встановлення значення на 0 повністю вимикає підняття.',
	'CHAR_LIMIT'					=> 'Максимальна кількість символів на повідомлення',
	'CHAR_LIMIT_EXPLAIN'			=> 'Кількість символів, дозволених у повідомленні/особистому повідомленні. Встановіть 0 для необмеженої кількості символів.',
	'DELETE_TIME'					=> 'Обмежити час видалення',
	'DELETE_TIME_EXPLAIN'			=> 'Обмежує доступний час для видалення нового повідомлення. Встановлення значення на 0 вимикає цю поведінку.',
	'DISPLAY_LAST_EDITED'			=> 'Показувати інформацію про час останнього редагування',
	'DISPLAY_LAST_EDITED_EXPLAIN'	=> 'Оберіть, чи показувати в повідомленнях інформацію про останнього редактора.',
	'EDIT_TIME'						=> 'Обмежити час редагування',
	'EDIT_TIME_EXPLAIN'				=> 'Обмежує доступний час для редагування нового повідомлення. Встановлення значення на 0 вимикає цю поведінку.',
	'FLOOD_INTERVAL'				=> 'Інтервал обмеження частоти',
	'FLOOD_INTERVAL_EXPLAIN'		=> 'Кількість секунд, яку користувач має чекати між публікацією нових повідомлень. Щоб дозволити користувачам ігнорувати це, змініть їхні права.',
	'HOT_THRESHOLD'					=> 'Поріг популярної теми',
	'HOT_THRESHOLD_EXPLAIN'			=> 'Поріг кількості повідомлень на тему, необхідний для позначки популярної теми. Встановіть 0, щоб вимкнути популярні теми.',
	'MAX_POLL_OPTIONS'				=> 'Максимальна кількість варіантів опитування',
	'MAX_POST_FONT_SIZE'			=> 'Максимальний розмір шрифту на повідомлення',
	'MAX_POST_FONT_SIZE_EXPLAIN'	=> 'Максимальний дозволений розмір шрифту в повідомленні. Встановіть 0 для необмеженого розміру шрифту.',
	'MAX_POST_IMG_HEIGHT'			=> 'Максимальна висота flash на повідомлення',
	'MAX_POST_IMG_HEIGHT_EXPLAIN'	=> 'Максимальна висота flash-файлу в повідомленнях. Встановіть 0 для необмеженого розміру.',
	'MAX_POST_IMG_WIDTH'			=> 'Максимальна ширина flash на повідомлення',
	'MAX_POST_IMG_WIDTH_EXPLAIN'	=> 'Максимальна ширина flash-файлу в повідомленнях. Встановіть 0 для необмеженого розміру.',
	'MAX_POST_URLS'					=> 'Максимальна кількість посилань на повідомлення',
	'MAX_POST_URLS_EXPLAIN'			=> 'Максимальна кількість URL-адрес у повідомленні. Встановіть 0 для необмеженої кількості посилань.',
	'MIN_CHAR_LIMIT'				=> 'Мінімальна кількість символів на повідомлення',
	'MIN_CHAR_LIMIT_EXPLAIN'		=> 'Мінімальна кількість символів, яку користувачу потрібно ввести в повідомленні/особистому повідомленні. Мінімум для цього налаштування — 1.',
	'POSTING'						=> 'Публікація',
	'POSTS_PER_PAGE'				=> 'Повідомлень на сторінці',
	'QUOTE_DEPTH_LIMIT'				=> 'Максимальна глибина вкладення цитат',
	'QUOTE_DEPTH_LIMIT_EXPLAIN'		=> 'Максимальна глибина вкладення цитат у повідомленні. Встановіть 0 для необмеженої глибини.',
	'SMILIES_LIMIT'					=> 'Максимальна кількість смайлів на повідомлення',
	'SMILIES_LIMIT_EXPLAIN'			=> 'Максимальна кількість смайлів у повідомленні. Встановіть 0 для необмеженої кількості смайлів.',
	'SMILIES_PER_PAGE'				=> 'Смайлів на сторінці',
	'TOPICS_PER_PAGE'				=> 'Тем на сторінці',
));

// Signature Settings
$lang = array_merge($lang, array(
	'ACP_SIGNATURE_SETTINGS_EXPLAIN'	=> 'Тут ви можете встановити всі налаштування за замовчуванням для підписів.',

	'MAX_SIG_FONT_SIZE'				=> 'Максимальний розмір шрифту підпису',
	'MAX_SIG_FONT_SIZE_EXPLAIN'		=> 'Максимальний дозволений розмір шрифту в підписах користувачів. Встановіть 0 для необмеженого розміру.',
	'MAX_SIG_IMG_HEIGHT'			=> 'Максимальна висота зображення підпису',
	'MAX_SIG_IMG_HEIGHT_EXPLAIN'	=> 'Максимальна висота зображення/flash-файлу в підписах користувачів. Встановіть 0 для необмеженої висоти.',
	'MAX_SIG_IMG_WIDTH'				=> 'Максимальна ширина зображення підпису',
	'MAX_SIG_IMG_WIDTH_EXPLAIN'		=> 'Максимальна ширина зображення/flash-файлу в підписах користувачів. Встановіть 0 для необмеженої ширини.',
	'MAX_SIG_LENGTH'				=> 'Максимальна довжина підпису',
	'MAX_SIG_LENGTH_EXPLAIN'		=> 'Максимальна кількість символів у підписах користувачів.',
	'MAX_SIG_SMILIES'				=> 'Максимальна кількість смайлів на підпис',
	'MAX_SIG_SMILIES_EXPLAIN'		=> 'Максимальна кількість смайлів, дозволена в підписах користувачів. Встановіть 0 для необмеженої кількості смайлів.',
	'MAX_SIG_URLS'					=> 'Максимальна кількість посилань у підписі',
	'MAX_SIG_URLS_EXPLAIN'			=> 'Максимальна кількість посилань у підписах користувачів. Встановіть 0 для необмеженої кількості посилань.',
));

// Registration Settings
$lang = array_merge($lang, array(
	'ACP_REGISTER_SETTINGS_EXPLAIN'		=> 'Тут ви можете визначити налаштування, пов’язані з реєстрацією та профілем.',

	'ACC_ACTIVATION'				=> 'Активація облікового запису',
	'ACC_ACTIVATION_EXPLAIN'		=> 'Це визначає, чи мають користувачі негайний доступ до форуму, чи потрібне підтвердження. Ви також можете повністю вимкнути нові реєстрації. <em>«Загальнофорумні листи» мають бути увімкнені, щоб використовувати активацію користувачем або адміністратором.</em>',
	'ACC_ACTIVATION_WARNING'		=> 'Будь ласка, зверніть увагу, наразі обраний метод активації вимагає, щоб листи були увімкнені, інакше реєстрацію буде вимкнено. Ми рекомендуємо або обрати інший метод активації, або повторно увімкнути листи.',
	'NEW_MEMBER_POST_LIMIT'			=> 'Ліміт повідомлень для нового учасника',
	'NEW_MEMBER_POST_LIMIT_EXPLAIN'	=> 'Нові учасники перебувають у групі <em>Новозареєстровані користувачі</em>, доки не досягнуть цієї кількості повідомлень. Ви можете використовувати цю групу, щоб не дозволяти їм користуватися системою ОП або переглядати їхні повідомлення. <strong>Значення 0 вимикає цю функцію.</strong>',
	'NEW_MEMBER_GROUP_DEFAULT'		=> 'Встановити групу новозареєстрованих користувачів за замовчуванням',
	'NEW_MEMBER_GROUP_DEFAULT_EXPLAIN'	=> 'Якщо встановлено «так», і вказано ліміт повідомлень для нового учасника, новозареєстрованих користувачів буде не лише поміщено до групи <em>Новозареєстровані користувачі</em>, а й ця група стане для них основною. Це може стати в пригоді, якщо ви бажаєте призначити звання та/або аватар за замовчуванням для групи, які потім успадкує користувач.',

	'ACC_ADMIN'					=> 'Адміністратором',
	'ACC_DISABLE'				=> 'Вимкнути реєстрацію',
	'ACC_NONE'					=> 'Без активації (негайний доступ)',
	'ACC_USER'					=> 'Користувачем (перевірка email)',
//	'ACC_USER_ADMIN'			=> 'User + Admin',
	'ALLOW_EMAIL_REUSE'			=> 'Дозволити повторне використання email-адреси',
	'ALLOW_EMAIL_REUSE_EXPLAIN'	=> 'Різні користувачі можуть реєструватися з однаковою email-адресою.',
	'COPPA'						=> 'COPPA',
	'COPPA_FAX'					=> 'Номер факсу COPPA',
	'COPPA_MAIL'				=> 'Поштова адреса COPPA',
	'COPPA_MAIL_EXPLAIN'		=> 'Це поштова адреса, на яку батьки надсилатимуть форми реєстрації COPPA.',
	'ENABLE_COPPA'				=> 'Увімкнути COPPA',
	'ENABLE_COPPA_EXPLAIN'		=> 'Це вимагає від користувачів вказувати, чи їм 13 років або більше, для відповідності законодавству США щодо COPPA. Якщо це вимкнено, спеціальні групи COPPA більше не показуватимуться.',
	'MAX_CHARS'					=> 'Макс.',
	'MIN_CHARS'					=> 'Мін.',
	'NO_AUTH_PLUGIN'			=> 'Відповідний плагін автентифікації не знайдено.',
	'PASSWORD_LENGTH'			=> 'Довжина пароля',
	'PASSWORD_LENGTH_EXPLAIN'	=> 'Мінімальна кількість символів у паролях. Зверніть увагу, максимальна кількість не обмежена.',
	'REG_LIMIT'					=> 'Спроби реєстрації',
	'REG_LIMIT_EXPLAIN'			=> 'Кількість спроб, які користувачі можуть зробити для вирішення завдання проти спам-ботів, перш ніж їх буде заблоковано в цьому сеансі.',
	'USERNAME_ALPHA_ONLY'		=> 'Лише літери та цифри',
	'USERNAME_ALPHA_SPACERS'	=> 'Літери, цифри та роздільники',
	'USERNAME_ASCII'			=> 'ASCII (без міжнародного unicode)',
	'USERNAME_LETTER_NUM'		=> 'Будь-яка літера та цифра',
	'USERNAME_LETTER_NUM_SPACERS'	=> 'Будь-яка літера, цифра та роздільник',
	'USERNAME_CHARS'			=> 'Обмежити символи імені користувача',
	'USERNAME_CHARS_ANY'		=> 'Будь-який символ',
	'USERNAME_CHARS_EXPLAIN'	=> 'Обмежити тип символів, які можна використовувати в іменах користувачів, роздільники: пробіл, -, +, _, [ і ].',
	'USERNAME_LENGTH'			=> 'Довжина імені користувача',
	'USERNAME_LENGTH_EXPLAIN'	=> 'Мінімальна й максимальна кількість символів в іменах користувачів.',
));

// Feeds
$lang = array_merge($lang, array(
	'ACP_FEED_MANAGEMENT'				=> 'Загальні налаштування стрічок синдикації',
	'ACP_FEED_MANAGEMENT_EXPLAIN'		=> 'Цей модуль надає різноманітні стрічки ATOM, обробляючи будь-який BBCode у повідомленнях, щоб зробити їх читабельними у зовнішніх стрічках.',

	'ACP_FEED_GENERAL'					=> 'Загальні налаштування стрічок',
	'ACP_FEED_POST_BASED'				=> 'Налаштування стрічок на основі повідомлень',
	'ACP_FEED_TOPIC_BASED'				=> 'Налаштування стрічок на основі тем',
	'ACP_FEED_SETTINGS_OTHER'			=> 'Інші стрічки й налаштування',

	'ACP_FEED_ENABLE'					=> 'Увімкнути стрічки',
	'ACP_FEED_ENABLE_EXPLAIN'			=> 'Вмикає або вимикає стрічки ATOM для всього форуму.<br>Вимкнення цього вимикає всі стрічки, незалежно від того, як встановлено параметри нижче.',
	'ACP_FEED_LIMIT'					=> 'Кількість елементів',
	'ACP_FEED_LIMIT_EXPLAIN'			=> 'Максимальна кількість елементів стрічки для показу.',

	'ACP_FEED_OVERALL'					=> 'Увімкнути загальнофорумну стрічку',
	'ACP_FEED_OVERALL_EXPLAIN'			=> 'Нові повідомлення всього форуму.',
	'ACP_FEED_FORUM'					=> 'Увімкнути стрічки для кожного форуму',
	'ACP_FEED_FORUM_EXPLAIN'			=> 'Нові повідомлення окремого форуму й підфорумів.',
	'ACP_FEED_TOPIC'					=> 'Увімкнути стрічки для кожної теми',
	'ACP_FEED_TOPIC_EXPLAIN'			=> 'Нові повідомлення окремих тем.',

	'ACP_FEED_TOPICS_NEW'				=> 'Увімкнути стрічку нових тем',
	'ACP_FEED_TOPICS_NEW_EXPLAIN'		=> 'Вмикає стрічку «Нові теми», яка показує останні створені теми, включно з першим повідомленням.',
	'ACP_FEED_TOPICS_ACTIVE'			=> 'Увімкнути стрічку активних тем',
	'ACP_FEED_TOPICS_ACTIVE_EXPLAIN'	=> 'Вмикає стрічку «Активні теми», яка показує останні активні теми, включно з останнім повідомленням.',
	'ACP_FEED_NEWS'						=> 'Стрічка новин',
	'ACP_FEED_NEWS_EXPLAIN'				=> 'Отримувати перше повідомлення з цих форумів. Не обирайте жодного форуму, щоб вимкнути стрічку новин.<br>Оберіть кілька форумів, утримуючи <samp>CTRL</samp> і клацаючи.',

	'ACP_FEED_OVERALL_FORUMS'			=> 'Увімкнути стрічку форумів',
	'ACP_FEED_OVERALL_FORUMS_EXPLAIN'	=> 'Вмикає стрічку «Всі форуми», яка показує список форумів.',

	'ACP_FEED_HTTP_AUTH'				=> 'Дозволити HTTP-автентифікацію',
	'ACP_FEED_HTTP_AUTH_EXPLAIN'		=> 'Вмикає HTTP-автентифікацію, дозволяючи користувачам отримувати доступ до вмісту, прихованого від гостей, додаючи параметр <samp>auth=http</samp> до URL-адреси стрічки. Зверніть увагу, деякі конфігурації PHP можуть вимагати додаткових змін у файлі .htaccess; зверніться до цього файлу за вказівками. HTTP-автентифікація підтримується лише через зашифровані (https) з’єднання.',
	'ACP_FEED_ITEM_STATISTICS'			=> 'Статистика елементів',
	'ACP_FEED_ITEM_STATISTICS_EXPLAIN'	=> 'Показувати окрему статистику під елементами стрічки<br>(напр. автор, дата й час, відповіді, перегляди)',
	'ACP_FEED_EXCLUDE_ID'				=> 'Виключити ці форуми',
	'ACP_FEED_EXCLUDE_ID_EXPLAIN'		=> 'Вміст з них <strong>не буде включено до стрічок</strong>. Не обирайте жодного форуму, щоб отримувати дані з усіх форумів.<br>Обирайте/скасовуйте вибір кількох форумів, утримуючи <samp>CTRL</samp> і клацаючи.',
));

// Visual Confirmation Settings
$lang = array_merge($lang, array(
	'ACP_VC_SETTINGS_EXPLAIN'				=> 'Тут ви можете обирати й налаштовувати плагіни, призначені для блокування автоматичного надсилання форм спам-ботами. Ці плагіни зазвичай працюють, кидаючи користувачу виклик у вигляді <em>CAPTCHA</em> — тесту, розробленого так, щоб комп’ютерам було важко його вирішити.',
	'ACP_VC_EXT_GET_MORE'					=> 'Щоб отримати додаткові (і, можливо, кращі) антиспам-плагіни, відвідайте <a href="https://www.phpbb.com/go/anti-spam-ext"><strong>Базу даних розширень phpBB.com</strong></a>. Для отримання додаткової інформації про запобігання спаму на вашому форумі відвідайте <a href="https://www.phpbb.com/go/anti-spam"><strong>Базу знань phpBB.com</strong></a>.',
	'AVAILABLE_CAPTCHAS'					=> 'Доступні плагіни',
	'CAPTCHA_UNAVAILABLE'					=> 'Цей плагін неможливо обрати, оскільки його вимоги не виконано.',
	'CAPTCHA_GD'							=> 'Зображення GD',
	'CAPTCHA_GD_3D'							=> '3D-зображення GD',
	'CAPTCHA_GD_FOREGROUND_NOISE'			=> 'Шум переднього плану',
	'CAPTCHA_GD_EXPLAIN'					=> 'Використовує GD для створення більш складного зображення проти спам-ботів.',
	'CAPTCHA_GD_FOREGROUND_NOISE_EXPLAIN'	=> 'Використовувати шум переднього плану, щоб ускладнити читання зображення.',
	'CAPTCHA_GD_X_GRID'						=> 'Шум фону по осі x',
	'CAPTCHA_GD_X_GRID_EXPLAIN'				=> 'Використовуйте нижчі значення, щоб ускладнити читання зображення. 0 вимкне шум фону по осі x.',
	'CAPTCHA_GD_Y_GRID'						=> 'Шум фону по осі y',
	'CAPTCHA_GD_Y_GRID_EXPLAIN'				=> 'Використовуйте нижчі значення, щоб ускладнити читання зображення. 0 вимкне шум фону по осі y.',
	'CAPTCHA_GD_WAVE'						=> 'Хвильове спотворення',
	'CAPTCHA_GD_WAVE_EXPLAIN'				=> 'Це застосовує хвильове спотворення до зображення.',
	'CAPTCHA_GD_3D_NOISE'					=> 'Додати 3D-об’єкти шуму',
	'CAPTCHA_GD_3D_NOISE_EXPLAIN'			=> 'Це додає до зображення додаткові об’єкти поверх літер.',
	'CAPTCHA_GD_FONTS'						=> 'Використовувати різні шрифти',
	'CAPTCHA_GD_FONTS_EXPLAIN'				=> 'Це налаштування контролює, скільки різних форм літер використовується. Ви можете використовувати лише форми за замовчуванням або запровадити змінені літери. Також можливе додавання малих літер.',
	'CAPTCHA_FONT_DEFAULT'					=> 'За замовчуванням',
	'CAPTCHA_FONT_NEW'						=> 'Нові форми',
	'CAPTCHA_FONT_LOWER'					=> 'Також використовувати малі літери',
	'CAPTCHA_NO_GD'							=> 'Просте зображення',
	'CAPTCHA_PREVIEW_MSG'					=> 'Ваші зміни не збережено, це лише попередній перегляд.',
	'CAPTCHA_PREVIEW_EXPLAIN'				=> 'Як виглядатиме плагін з поточним вибором.',

	'CAPTCHA_SELECT'						=> 'Встановлені плагіни',
	'CAPTCHA_SELECT_EXPLAIN'				=> 'У випадному списку містяться плагіни, розпізнані форумом. Сірі записи наразі недоступні і можуть потребувати налаштування перед використанням.',
	'CAPTCHA_CONFIGURE'						=> 'Налаштувати плагіни',
	'CAPTCHA_CONFIGURE_EXPLAIN'				=> 'Змінити налаштування для обраного плагіна.',
	'CONFIGURE'								=> 'Налаштувати',
	'CAPTCHA_NO_OPTIONS'					=> 'Цей плагін не має параметрів конфігурації.',

	'VISUAL_CONFIRM_POST'					=> 'Увімкнути протидію спам-ботам для публікацій гостей',
	'VISUAL_CONFIRM_POST_EXPLAIN'			=> 'Вимагає від гостей пройти завдання проти спам-ботів, щоб допомогти запобігти автоматичним публікаціям.',
	'VISUAL_CONFIRM_REG'					=> 'Увімкнути протидію спам-ботам для реєстрацій',
	'VISUAL_CONFIRM_REG_EXPLAIN'			=> 'Вимагає від нових користувачів пройти завдання проти спам-ботів, щоб допомогти запобігти автоматичним реєстраціям.',
	'VISUAL_CONFIRM_REFRESH'				=> 'Дозволити користувачам оновлювати завдання проти спам-ботів',
	'VISUAL_CONFIRM_REFRESH_EXPLAIN'		=> 'Дозволяє користувачам запитувати нове завдання проти спам-ботів, якщо вони не можуть вирішити поточне завдання під час реєстрації. Деякі плагіни можуть не підтримувати цей параметр.',
));

// Cookie Settings
$lang = array_merge($lang, array(
	'ACP_COOKIE_SETTINGS_EXPLAIN'		=> 'Ці дані визначають інформацію, що використовується для надсилання файлів cookie браузерам ваших користувачів. У більшості випадків значень за замовчуванням для налаштувань cookie має бути достатньо. Якщо вам потрібно щось змінити, робіть це обережно, неправильні налаштування можуть завадити користувачам входити в систему. Якщо у вас виникають проблеми з тим, що користувачі залишаються увійшли на ваш форум, відвідайте <strong><a href="https://www.phpbb.com/support/go/cookie-settings">Базу знань phpBB.com — Виправлення неправильних налаштувань cookie</a></strong>.',

	'COOKIE_DOMAIN'				=> 'Домен cookie',
	'COOKIE_DOMAIN_EXPLAIN'		=> 'У більшості випадків домен cookie необов’язковий. Залиште порожнім, якщо не впевнені.<br><br> У випадку, коли ваш форум інтегровано з іншим програмним забезпеченням або у вас кілька доменів, для визначення домену cookie вам потрібно виконати наступне. Якщо у вас щось на кшталт <i>example.com</i> і <i>forums.example.com</i>, або, можливо, <i>forums.example.com</i> і <i>blog.example.com</i>. Видаляйте піддомени, доки не знайдете спільний домен, <i>example.com</i>. Тепер додайте крапку перед спільним доменом, і у вас вийде .example.com (зверніть увагу на крапку на початку).',
	'COOKIE_NAME'				=> 'Назва cookie',
	'COOKIE_NAME_EXPLAIN'		=> 'Це може бути будь-чим, зробіть це оригінальним. Щоразу, коли налаштування cookie змінюються, назву cookie слід змінювати.',
	'COOKIE_NOTICE'				=> 'Повідомлення про cookie',
	'COOKIE_NOTICE_EXPLAIN'		=> 'Якщо увімкнено, користувачам при відвідуванні вашого форуму буде показано повідомлення про cookie. Це може вимагатися законодавством залежно від вмісту вашого форуму та увімкнених розширень.',
	'COOKIE_PATH'				=> 'Шлях cookie',
	'COOKIE_PATH_EXPLAIN'		=> 'Зазвичай це буде такий самий шлях, як і шлях вашого скрипта, або просто скісна риска, щоб зробити cookie доступним у межах усього домену сайту.',
	'COOKIE_SECURE'				=> 'Безпечний cookie',
	'COOKIE_SECURE_EXPLAIN'		=> 'Якщо ваш сервер працює через SSL, встановіть це увімкненим, інакше залиште вимкненим. Увімкнення цього без роботи через SSL призведе до помилок сервера під час перенаправлень.',
	'ONLINE_LENGTH'				=> 'Тривалість перегляду онлайн',
	'ONLINE_LENGTH_EXPLAIN'		=> 'Кількість хвилин, після якої неактивні користувачі не з’являтимуться у списках «Хто онлайн». Що вище це значення, то більшої обробки потребує генерація списку.',
	'SESSION_LENGTH'			=> 'Тривалість сеансу',
	'SESSION_LENGTH_EXPLAIN'	=> 'Сеанси закінчуватимуться через цей час у секундах.',
));

// Contact Settings
$lang = array_merge($lang, array(
	'ACP_CONTACT_SETTINGS_EXPLAIN'		=> 'Тут ви можете вмикати й вимикати сторінку контактів, а також додавати текст, що показується на сторінці.',

	'CONTACT_US_ENABLE'				=> 'Увімкнути сторінку контактів',
	'CONTACT_US_ENABLE_EXPLAIN'		=> 'Ця сторінка дозволяє користувачам надсилати листи адміністраторам форуму. Зверніть увагу, параметр загальнофорумних листів також має бути увімкнено. Цей параметр можна знайти в Загальні &gt; Комунікація з клієнтами &gt; Налаштування email.',

	'CONTACT_US_INFO'				=> 'Контактна інформація',
	'CONTACT_US_INFO_EXPLAIN'		=> 'Повідомлення показується на сторінці контактів',
	'CONTACT_US_INFO_PREVIEW'		=> 'Інформація сторінки контактів — Перегляд',
	'CONTACT_US_INFO_UPDATED'		=> 'Інформацію сторінки контактів оновлено.',
));

// Load Settings
$lang = array_merge($lang, array(
	'ACP_LOAD_SETTINGS_EXPLAIN'	=> 'Тут ви можете вмикати й вимикати певні функції форуму, щоб зменшити необхідну обробку. На більшості серверів немає потреби вимикати будь-які функції. Однак у певних системах або середовищах спільного хостингу може бути корисно вимкнути можливості, які вам насправді не потрібні. Ви також можете вказати ліміти навантаження системи й активних сеансів, перевищення яких переведе форум в офлайн.',

	'ALLOW_CDN'						=> 'Дозволити використання сторонніх мереж доставки контенту',
	'ALLOW_CDN_EXPLAIN'				=> 'Якщо це налаштування увімкнено, деякі файли надаватимуться із зовнішніх сторонніх серверів замість вашого сервера. Це зменшує використання мережевого трафіку вашим сервером, але може становити проблему конфіденційності в деяких країнах. У типовому встановленні phpBB це включає завантаження «jQuery» та шрифту «Open Sans» з мережі доставки контенту Google. Це також стосується шрифту «Font Awesome», який phpBB та деякі розширення використовують для відображення значків.',
	'ALLOW_LIVE_SEARCHES'			=> 'Дозволити живий пошук',
	'ALLOW_LIVE_SEARCHES_EXPLAIN'	=> 'Якщо це налаштування увімкнено, користувачам пропонуватимуться підказки ключових слів під час введення тексту в певних полях форуму.',
	'CUSTOM_PROFILE_FIELDS'			=> 'Користувацькі поля профілю',
	'LIMIT_LOAD'					=> 'Обмежити навантаження системи',
	'LIMIT_LOAD_EXPLAIN'			=> 'Якщо середнє навантаження системи за 1 хвилину перевищує це значення, форум автоматично перейде в офлайн. Значення 1.0 дорівнює ~100% використання одного процесора. Це працює лише на серверах на основі UNIX і там, де ця інформація доступна. Значення тут скидається на 0, якщо phpBB не вдалося отримати ліміт навантаження.',
	'LIMIT_SESSIONS'				=> 'Обмежити сеанси',
	'LIMIT_SESSIONS_EXPLAIN'		=> 'Якщо кількість сеансів перевищує це значення протягом однієї хвилини, форум перейде в офлайн. Встановіть 0 для необмеженої кількості сеансів.',
	'LOAD_CPF_MEMBERLIST'			=> 'Дозволити стилям показувати користувацькі поля профілю в списку учасників',
	'LOAD_CPF_PM'					=> 'Показувати користувацькі поля профілю в особистих повідомленнях',
	'LOAD_CPF_VIEWPROFILE'			=> 'Показувати користувацькі поля профілю в профілях користувачів',
	'LOAD_CPF_VIEWTOPIC'			=> 'Показувати користувацькі поля профілю на сторінках тем',
	'LOAD_USER_ACTIVITY'			=> 'Показувати активність користувача',
	'LOAD_USER_ACTIVITY_EXPLAIN'	=> 'Показує активну тему/форум у профілях користувачів і панелі керування користувача. Рекомендується вимкнути це на форумах з понад мільйоном повідомлень.',
	'LOAD_USER_ACTIVITY_LIMIT'		=> 'Ліміт повідомлень для активності користувача',
	'LOAD_USER_ACTIVITY_LIMIT_EXPLAIN'	=> 'Активна тема/форум не показуватиметься для користувачів з кількістю повідомлень, що перевищує це число. Встановіть 0, щоб вимкнути ліміт.',
	'READ_NOTIFICATION_EXPIRE_DAYS'	=> 'Термін дії прочитаного сповіщення',
	'READ_NOTIFICATION_EXPIRE_DAYS_EXPLAIN' => 'Кількість днів, яка мине, перш ніж прочитане сповіщення буде автоматично видалено. Встановіть це значення на 0, щоб зробити сповіщення постійними.',
	'RECOMPILE_STYLES'				=> 'Перекомпілювати застарілі компоненти стилю',
	'RECOMPILE_STYLES_EXPLAIN'		=> 'Перевірити наявність оновлених компонентів стилю у файловій системі та перекомпілювати.',
	'YES_ACCURATE_PM_BUTTON'			=> 'Увімкнути специфічну для прав кнопку ОП на сторінках тем',
	'YES_ACCURATE_PM_BUTTON_EXPLAIN'	=> 'Якщо це налаштування увімкнено, кнопку особистого повідомлення матимуть лише профілі повідомлень користувачів, яким дозволено читати особисті повідомлення.',
	'YES_ANON_READ_MARKING'			=> 'Увімкнути позначення тем для гостей',
	'YES_ANON_READ_MARKING_EXPLAIN'	=> 'Зберігає інформацію про статус прочитано/непрочитано для гостей. Якщо вимкнено, повідомлення для гостей завжди позначаються прочитаними.',
	'YES_BIRTHDAYS'					=> 'Увімкнути список днів народження',
	'YES_BIRTHDAYS_EXPLAIN'			=> 'Якщо вимкнено, список днів народження більше не показуватиметься. Щоб це налаштування набуло чинності, функцію днів народження також потрібно увімкнути.',
	'YES_JUMPBOX'					=> 'Увімкнути показ поля швидкого переходу',
	'YES_MODERATORS'				=> 'Увімкнути показ модераторів',
	'YES_ONLINE'					=> 'Увімкнути списки користувачів онлайн',
	'YES_ONLINE_EXPLAIN'			=> 'Показувати інформацію про користувачів онлайн на головній сторінці, форумах і сторінках тем.',
	'YES_ONLINE_GUESTS'				=> 'Увімкнути списки гостей онлайн у перегляді онлайн',
	'YES_ONLINE_GUESTS_EXPLAIN'		=> 'Дозволити показ інформації про гостей у перегляді онлайн.',
	'YES_ONLINE_TRACK'				=> 'Увімкнути показ інформації про статус онлайн/офлайн користувача',
	'YES_ONLINE_TRACK_EXPLAIN'		=> 'Показувати інформацію про статус онлайн для користувача в профілях і на сторінках тем.',
	'YES_POST_MARKING'				=> 'Увімкнути позначені крапкою теми',
	'YES_POST_MARKING_EXPLAIN'		=> 'Вказує, чи публікував користувач повідомлення в темі.',
	'YES_READ_MARKING'				=> 'Увімкнути серверне позначення тем',
	'YES_READ_MARKING_EXPLAIN'		=> 'Зберігає інформацію про статус прочитано/непрочитано в базі даних замість cookie.',
	'YES_UNREAD_SEARCH'				=> 'Увімкнути пошук непрочитаних повідомлень',
));

// Auth settings
$lang = array_merge($lang, array(
	'ACP_AUTH_SETTINGS_EXPLAIN'	=> 'phpBB підтримує плагіни, або модулі, автентифікації. Вони дозволяють визначати, як користувачі автентифікуються при вході на форум. За замовчуванням надано чотири плагіни: БД, LDAP, Apache та OAuth. Не всі методи вимагають додаткової інформації, тому заповнюйте поля лише якщо вони стосуються обраного методу.',

	'AUTH_METHOD'				=> 'Оберіть метод автентифікації',

	'AUTH_PROVIDER_OAUTH_ERROR_ELEMENT_MISSING'	=> 'Потрібно вказати як ключ, так і секрет для кожного увімкненого постачальника служби OAuth. Для постачальника служби OAuth було вказано лише один з них.',
	'AUTH_PROVIDER_OAUTH_EXPLAIN'				=> 'Кожен постачальник OAuth вимагає унікальний секрет і ключ для автентифікації із зовнішнім сервером. Їх має надати служба OAuth під час реєстрації вашого вебсайту в них, і їх слід вводити точно так, як надано вам.<br>Будь-яка служба, для якої тут не введено обидва — ключ і секрет, буде недоступна для використання користувачами форуму. Також зауважте, що користувач все ще може реєструватися та входити за допомогою плагіна автентифікації БД.',
	'AUTH_PROVIDER_OAUTH_KEY'					=> 'Ключ',
	'AUTH_PROVIDER_OAUTH_TITLE'					=> 'OAuth',
	'AUTH_PROVIDER_OAUTH_SECRET'				=> 'Секрет',

	'APACHE_SETUP_BEFORE_USE'	=> 'Вам потрібно налаштувати автентифікацію apache, перш ніж перемикати phpBB на цей метод автентифікації. Майте на увазі, ім’я користувача, яке ви використовуєте для автентифікації apache, має збігатися з вашим іменем користувача phpBB. Автентифікацію apache можна використовувати лише з mod_php (не з версією CGI).',

	'LDAP'							=> 'LDAP',
	'LDAP_DN'						=> 'Базовий <var>dn</var> LDAP',
	'LDAP_DN_EXPLAIN'				=> 'Це Distinguished Name, що вказує на розташування інформації про користувача, напр. <samp>o=My Company,c=US</samp>.',
	'LDAP_EMAIL'					=> 'Атрибут email LDAP',
	'LDAP_EMAIL_EXPLAIN'			=> 'Встановіть це на назву атрибута email вашого запису користувача (якщо він існує), щоб автоматично встановлювати email-адресу для нових користувачів. Залишення цього порожнім призводить до порожньої email-адреси для користувачів, які входять уперше.',
	'LDAP_INCORRECT_USER_PASSWORD'	=> 'Прив’язку до сервера LDAP не вдалося виконати з вказаним користувачем/паролем.',
	'LDAP_NO_EMAIL'					=> 'Вказаного атрибута email не існує.',
	'LDAP_NO_IDENTITY'				=> 'Не вдалося знайти ідентифікатор входу для %s.',
	'LDAP_PASSWORD'					=> 'Пароль LDAP',
	'LDAP_PASSWORD_EXPLAIN'			=> 'Залиште порожнім для використання анонімної прив’язки, інакше введіть пароль для вищевказаного користувача. Обов’язково для серверів Active Directory.<br><em><strong>Увага:</strong> цей пароль буде збережено у вигляді звичайного тексту в базі даних, видимий кожному, хто має доступ до вашої бази даних або може переглянути цю сторінку конфігурації.</em>',
	'LDAP_PORT'						=> 'Порт сервера LDAP',
	'LDAP_PORT_EXPLAIN'				=> 'За бажанням ви можете вказати порт, який слід використовувати для з’єднання із сервером LDAP замість порту 389 за замовчуванням.',
	'LDAP_SERVER'					=> 'Назва сервера LDAP',
	'LDAP_SERVER_EXPLAIN'			=> 'Якщо використовується LDAP, це ім’я хосту чи IP-адреса сервера LDAP. Крім того, ви можете вказати URL-адресу на кшталт ldap://hostname:port/',
	'LDAP_UID'						=> '<var>uid</var> LDAP',
	'LDAP_UID_EXPLAIN'				=> 'Це ключ, за яким слід шукати вказаний ідентифікатор входу, напр. <var>uid</var>, <var>sn</var> тощо.',
	'LDAP_USER'						=> 'Користувацький <var>dn</var> LDAP',
	'LDAP_USER_EXPLAIN'				=> 'Залиште порожнім для використання анонімної прив’язки. Якщо заповнено, phpBB використовує вказане Distinguished Name під час спроб входу для пошуку правильного користувача, напр. <samp>uid=Username,ou=MyUnit,o=MyCompany,c=US</samp>. Обов’язково для серверів Active Directory.',
	'LDAP_USER_FILTER'				=> 'Фільтр користувачів LDAP',
	'LDAP_USER_FILTER_EXPLAIN'		=> 'За бажанням ви можете додатково обмежити шукані об’єкти додатковими фільтрами. Наприклад, <samp>objectClass=posixGroup</samp> призведе до використання <samp>(&amp;(uid=$username)(objectClass=posixGroup))</samp>',
));

// Server Settings
$lang = array_merge($lang, array(
	'ACP_SERVER_SETTINGS_EXPLAIN'	=> 'Тут ви визначаєте налаштування, залежні від сервера й домену. Будь ласка, переконайтеся, що введені вами дані точні, помилки призведуть до листів з неправильною інформацією. Вводячи назву домену, пам’ятайте, вона не включає http:// чи інший протокольний термін. Змінюйте номер порту, лише якщо ви знаєте, що ваш сервер використовує інше значення, порт 80 правильний у більшості випадків.',

	'ENABLE_GZIP'				=> 'Увімкнути стиснення GZip',
	'ENABLE_GZIP_EXPLAIN'		=> 'Згенерований вміст буде стиснено перед надсиланням користувачу. Це може зменшити мережевий трафік, але також збільшить використання ЦП як на сервері, так і на стороні клієнта. Вимагає завантаженого розширення PHP zlib.',
	'FORCE_SERVER_VARS'			=> 'Примусово застосувати налаштування URL-адреси сервера',
	'FORCE_SERVER_VARS_EXPLAIN'	=> 'Якщо встановлено «так», визначені тут налаштування сервера матимуть пріоритет над автоматично визначеними значеннями.',
	'ICONS_PATH'				=> 'Шлях зберігання значків повідомлень',
	'ICONS_PATH_EXPLAIN'		=> 'Шлях у межах кореневої теки phpBB, напр. <samp>images/icons</samp>.',
	'MOD_REWRITE_ENABLE'		=> 'Увімкнути перезапис URL',
	'MOD_REWRITE_ENABLE_EXPLAIN' => 'При увімкненні URL-адреси, що містять «app.php», будуть переписані для видалення назви файлу (тобто app.php/foo стане /foo). <strong>Для роботи цього функціоналу потрібен модуль mod_rewrite сервера Apache; якщо цей параметр увімкнено без підтримки mod_rewrite, URL-адреси вашого форуму можуть бути пошкоджені.</strong>',
	'MOD_REWRITE_DISABLED'		=> 'Модуль <strong>mod_rewrite</strong> на вашому веб-сервері Apache вимкнено. Увімкніть модуль або зверніться до вашого хостинг-провайдера, якщо бажаєте увімкнути цю функцію.',
	'MOD_REWRITE_INFORMATION_UNAVAILABLE' => 'Ми не можемо визначити, чи підтримує цей сервер перезапис URL. Це налаштування може бути увімкнено, але якщо перезапис URL недоступний, шляхи, згенеровані цим форумом (наприклад, для використання в посиланнях), можуть бути пошкоджені. Зверніться до вашого хостинг-провайдера, якщо не впевнені, чи можете ви безпечно увімкнути цю функцію.',
	'PATH_SETTINGS'				=> 'Налаштування шляхів',
	'RANKS_PATH'				=> 'Шлях зберігання зображень звань',
	'RANKS_PATH_EXPLAIN'		=> 'Шлях у межах кореневої теки phpBB, напр. <samp>images/ranks</samp>.',
	'SCRIPT_PATH'				=> 'Шлях скрипта',
	'SCRIPT_PATH_EXPLAIN'		=> 'Шлях, за яким розташовано phpBB відносно назви домену, напр. <samp>/phpBB3</samp>.',
	'SERVER_NAME'				=> 'Назва домену',
	'SERVER_NAME_EXPLAIN'		=> 'Назва домену, з якого працює цей форум (наприклад: <samp>example.com</samp>).',
	'SERVER_PORT'				=> 'Порт сервера',
	'SERVER_PORT_EXPLAIN'		=> 'Порт, на якому працює ваш сервер, зазвичай 80, змінюйте, лише якщо відрізняється.',
	'SERVER_PROTOCOL'			=> 'Протокол сервера',
	'SERVER_PROTOCOL_EXPLAIN'	=> 'Це використовується як протокол сервера, якщо ці налаштування примусово застосовуються. Якщо порожньо або не застосовується примусово, протокол визначається налаштуваннями безпечного cookie (<samp>http://</samp> чи <samp>https://</samp>).',
	'SERVER_URL_SETTINGS'		=> 'Налаштування URL-адреси сервера',
	'SMILIES_PATH'				=> 'Шлях зберігання смайлів',
	'SMILIES_PATH_EXPLAIN'		=> 'Шлях у межах кореневої теки phpBB, напр. <samp>images/smilies</samp>.',
	'UPLOAD_ICONS_PATH'			=> 'Шлях зберігання значків груп розширень',
	'UPLOAD_ICONS_PATH_EXPLAIN'	=> 'Шлях у межах кореневої теки phpBB, напр. <samp>images/upload_icons</samp>.',
	'USE_SYSTEM_CRON'			=> 'Запускати періодичні завдання з cron операційної системи',
	'USE_SYSTEM_CRON_EXPLAIN'	=> 'При вимкненні phpBB організовуватиме автоматичний запуск періодичних завдань самостійно. При увімкненні phpBB не плануватиме жодних періодичних завдань самостійно; системному адміністратору потрібно організувати регулярний запуск <code>bin/phpbbcli.php cron:run</code> через cron операційної системи (напр. кожні 5 хвилин).',
));

// Security Settings
$lang = array_merge($lang, array(
	'ACP_SECURITY_SETTINGS_EXPLAIN'		=> 'Тут ви можете визначити налаштування, пов’язані із сеансами й входом.',

	'ALL'							=> 'Всі',
	'ALLOW_AUTOLOGIN'				=> 'Дозволити вхід «Запам’ятати мене»',
	'ALLOW_AUTOLOGIN_EXPLAIN'		=> 'Визначає, чи надається користувачам параметр «Запам’ятати мене» при відвідуванні форуму.',
	'ALLOW_PASSWORD_RESET'			=> 'Дозволити скидання пароля («Забув пароль»)',
	'ALLOW_PASSWORD_RESET_EXPLAIN'	=> 'Визначає, чи можуть користувачі використовувати посилання «Я забув свій пароль» на сторінці входу для відновлення свого облікового запису. Якщо ви використовуєте зовнішній механізм автентифікації, можливо, ви захочете вимкнути цю функцію.',
	'AUTOLOGIN_LENGTH'				=> 'Термін дії ключа входу «Запам’ятати мене» (у днях)',
	'AUTOLOGIN_LENGTH_EXPLAIN'		=> 'Кількість днів, після якої ключі входу «Запам’ятати мене» видаляються, або нуль, щоб вимкнути.',
	'BROWSER_VALID'					=> 'Перевіряти браузер',
	'BROWSER_VALID_EXPLAIN'			=> 'Вмикає перевірку браузера для кожного сеансу, покращуючи безпеку.',
	'CHECK_DNSBL'					=> 'Перевіряти IP за списком DNS Blackhole',
	'CHECK_DNSBL_EXPLAIN'			=> 'Якщо увімкнено, IP-адресу користувача перевіряється за наступними службами DNSBL під час реєстрації та публікації: <a href="http://spamcop.net">spamcop.net</a> і <a href="http://www.spamhaus.org">www.spamhaus.org</a>. Цей пошук може зайняти деякий час залежно від конфігурації сервера. Якщо ви відчуваєте уповільнення або отримуєте забагато хибних спрацьовувань, рекомендується вимкнути цю перевірку.',
	'CLASS_B'						=> 'A.B',
	'CLASS_C'						=> 'A.B.C',
	'EMAIL_CHECK_MX'				=> 'Перевіряти домен email на дійсний запис MX',
	'EMAIL_CHECK_MX_EXPLAIN'		=> 'Якщо увімкнено, домен email, наданий під час реєстрації та змін профілю, перевіряється на дійсний запис MX.',
	'FORCE_PASS_CHANGE'				=> 'Примусова зміна пароля',
	'FORCE_PASS_CHANGE_EXPLAIN'		=> 'Вимагати від користувача змінювати пароль через встановлену кількість днів. Встановлення цього значення на 0 вимикає цю поведінку.',
	'FORM_TIME_MAX'					=> 'Максимальний час для надсилання форм',
	'FORM_TIME_MAX_EXPLAIN'			=> 'Час, який користувач має для надсилання форми. Використовуйте -1, щоб вимкнути. Зверніть увагу, форма може стати недійсною, якщо сеанс закінчиться, незалежно від цього налаштування.',
	'FORM_SID_GUESTS'				=> 'Прив’язати форми до сеансів гостей',
	'FORM_SID_GUESTS_EXPLAIN'		=> 'Якщо увімкнено, токен форми, виданий гостям, буде виключним для сеансу. Це може спричинити проблеми з деякими інтернет-провайдерами.',
	'FORWARDED_FOR_VALID'			=> 'Перевіряти заголовок <var>X_FORWARDED_FOR</var>',
	'FORWARDED_FOR_VALID_EXPLAIN'	=> 'Сеанси продовжуватимуться, лише якщо надісланий заголовок <var>X_FORWARDED_FOR</var> збігається з тим, що був надісланий з попереднім запитом. Блокування також перевірятимуться за IP у <var>X_FORWARDED_FOR</var>.',
	'IP_VALID'						=> 'Перевірка IP сеансу',
	'IP_VALID_EXPLAIN'				=> 'Визначає, яку частину IP-адреси користувача використовують для перевірки сеансу; <samp>Всі</samp> порівнює повну адресу, <samp>A.B.C</samp> — перші x.x.x, <samp>A.B</samp> — перші x.x, <samp>Немає</samp> вимикає перевірку. Для адрес IPv6 <samp>A.B.C</samp> порівнює перші 4 блоки, а <samp>A.B</samp> — перші 3 блоки.',
	'IP_LOGIN_LIMIT_MAX'			=> 'Максимальна кількість спроб входу з IP-адреси',
	'IP_LOGIN_LIMIT_MAX_EXPLAIN'	=> 'Поріг дозволених спроб входу з однієї IP-адреси, перш ніж спрацює завдання проти спам-ботів. Введіть 0, щоб запобігти спрацюванню завдання проти спам-ботів за IP-адресами.',
	'IP_LOGIN_LIMIT_TIME'			=> 'Час дії спроби входу з IP-адреси',
	'IP_LOGIN_LIMIT_TIME_EXPLAIN'	=> 'Спроби входу закінчуються після цього періоду.',
	'IP_LOGIN_LIMIT_USE_FORWARDED'	=> 'Обмежити спроби входу за заголовком <var>X_FORWARDED_FOR</var>',
	'IP_LOGIN_LIMIT_USE_FORWARDED_EXPLAIN'	=> 'Замість обмеження спроб входу за IP-адресою вони обмежуються за значеннями <var>X_FORWARDED_FOR</var>. <br><em><strong>Увага:</strong> вмикайте це лише якщо ви керуєте проксі-сервером, який встановлює <var>X_FORWARDED_FOR</var> на надійні значення.</em>',
	'MAX_LOGIN_ATTEMPTS'			=> 'Максимальна кількість спроб входу на ім’я користувача',
	'MAX_LOGIN_ATTEMPTS_EXPLAIN'	=> 'Кількість дозволених спроб входу для одного облікового запису, перш ніж спрацює завдання проти спам-ботів. Введіть 0, щоб запобігти спрацюванню завдання проти спам-ботів для окремих облікових записів.',
	'NO_IP_VALIDATION'				=> 'Немає',
	'NO_REF_VALIDATION'				=> 'Немає',
	'PASSWORD_TYPE'					=> 'Складність пароля',
	'PASSWORD_TYPE_EXPLAIN'			=> 'Визначає, наскільки складним має бути пароль при встановленні чи зміні, наступні параметри включають попередні.',
	'PASS_TYPE_ALPHA'				=> 'Має містити літери й цифри',
	'PASS_TYPE_ANY'					=> 'Без вимог',
	'PASS_TYPE_CASE'				=> 'Має бути в різному регістрі',
	'PASS_TYPE_SYMBOL'				=> 'Має містити символи',
	'REF_HOST'						=> 'Перевіряти лише хост',
	'REF_PATH'						=> 'Також перевіряти шлях',
	'REFERRER_VALID'				=> 'Перевіряти реферер',
	'REFERRER_VALID_EXPLAIN'		=> 'Якщо увімкнено, реферер POST-запитів буде перевірено відповідно до налаштувань хосту/шляху скрипта. Це може спричинити проблеми на форумах, що використовують кілька доменів та/або зовнішні входи.',
	'TPL_ALLOW_PHP'					=> 'Дозволити php у шаблонах',
	'TPL_ALLOW_PHP_EXPLAIN'			=> 'Якщо цей параметр увімкнено, оператори <code>PHP</code> і <code>INCLUDEPHP</code> будуть розпізнані та оброблені в шаблонах.',
	'UPLOAD_CERT_VALID'				=> 'Перевіряти сертифікат завантаження',
	'UPLOAD_CERT_VALID_EXPLAIN'		=> 'Якщо увімкнено, сертифікати віддалених завантажень будуть перевірені. Це вимагає визначення набору CA параметром <samp>openssl.cafile</samp> чи <samp>curl.cainfo</samp> у вашому php.ini.',
));

// Email Settings
$lang = array_merge($lang, array(
	'ACP_EMAIL_SETTINGS_EXPLAIN'	=> 'Ця інформація використовується, коли форум надсилає листи вашим користувачам. Будь ласка, переконайтеся, що вказана вами email-адреса дійсна, будь-які повернуті чи недоставлені повідомлення, ймовірно, надсилатимуться на цю адресу. Якщо ваш хостинг не надає нативну (на основі PHP) поштову службу, ви можете натомість надсилати повідомлення напряму через SMTP. Це вимагає адреси відповідного сервера (за потреби запитайте у вашого провайдера). Якщо сервер вимагає автентифікації (і лише якщо вимагає), введіть необхідне ім’я користувача, пароль і метод автентифікації.',

	'ADMIN_EMAIL'					=> 'Email-адреса відправника',
	'ADMIN_EMAIL_EXPLAIN'			=> 'Це буде використано як адреса відправника у всіх листах, технічна контактна email-адреса. Її завжди використовуватимуть як адресу <samp>Return-Path</samp> та <samp>Sender</samp> у листах.',
	'BOARD_EMAIL_FORM'				=> 'Користувачі надсилають листи через форум',
	'BOARD_EMAIL_FORM_EXPLAIN'		=> 'Замість показу email-адреси користувача користувачі можуть надсилати листи через форум.',
	'BOARD_HIDE_EMAILS'				=> 'Приховати email-адреси',
	'BOARD_HIDE_EMAILS_EXPLAIN'		=> 'Ця функція зберігає email-адреси повністю приватними.',
	'CONTACT_EMAIL'					=> 'Контактна email-адреса',
	'CONTACT_EMAIL_EXPLAIN'			=> 'Ця адреса використовуватиметься, коли потрібна конкретна точка контакту, напр. спам, виведення помилок тощо. Її завжди використовуватимуть як адресу <samp>From</samp> та <samp>Reply-To</samp> у листах.',
	'CONTACT_EMAIL_NAME'			=> 'Контактне ім’я',
	'CONTACT_EMAIL_NAME_EXPLAIN'	=> 'Це контактне ім’я, яке бачитимуть отримувачі листів. Якщо ви не бажаєте мати контактне ім’я, залиште це поле порожнім.',
	'EMAIL_FORCE_SENDER'			=> 'Примусово встановити адресу відправника',
	'EMAIL_FORCE_SENDER_EXPLAIN'	=> 'Це встановить <samp>Return-Path</samp> на адресу відправника замість використання локального користувача та імені хосту сервера. Це налаштування не застосовується при використанні SMTP.<br><em><strong>Увага:</strong> вимагає, щоб користувач, від імені якого працює веб-сервер, був доданий як довірений користувач до конфігурації sendmail.</em>',
	'EMAIL_PACKAGE_SIZE'			=> 'Розмір пакета листів',
	'EMAIL_PACKAGE_SIZE_EXPLAIN'	=> 'Це максимальна кількість листів, що надсилаються в одному пакеті. Це налаштування застосовується до внутрішньої черги повідомлень; встановіть це значення на 0, якщо у вас виникають проблеми з недоставленими листами-сповіщеннями.',
	'EMAIL_MAX_CHUNK_SIZE'			=> 'Максимальна дозволена кількість отримувачів листа',
	'EMAIL_MAX_CHUNK_SIZE_EXPLAIN'	=> 'За потреби встановіть це, щоб не перевищувати максимальну кількість отримувачів, яку дозволяє ваш поштовий сервер в одному листі.',
	'EMAIL_SIG'						=> 'Підпис листа',
	'EMAIL_SIG_EXPLAIN'				=> 'Цей текст буде додано до всіх листів, які надсилає форум.',
	'ENABLE_EMAIL'					=> 'Увімкнути загальнофорумні листи',
	'ENABLE_EMAIL_EXPLAIN'			=> 'Якщо це вимкнено, форум взагалі не надсилатиме листи. <em>Зверніть увагу, налаштування активації користувача й адміністратора вимагають увімкнення цього параметра. Якщо наразі використовується активація «користувачем» чи «адміністратором» у налаштуваннях активації, вимкнення цього параметра вимкне реєстрацію.</em>',
	'SEND_TEST_EMAIL'				=> 'Надіслати тестовий лист',
	'SEND_TEST_EMAIL_EXPLAIN'		=> 'Це надішле тестовий лист на адресу, вказану у вашому обліковому записі.',
	'SMTP_ALLOW_SELF_SIGNED'		=> 'Дозволити самопідписані SSL-сертифікати',
	'SMTP_ALLOW_SELF_SIGNED_EXPLAIN'=> 'Дозволити з’єднання із сервером SMTP із самопідписаним SSL-сертифікатом. <br><em><strong>Увага:</strong> дозвіл самопідписаних SSL-сертифікатів може мати наслідки для безпеки.</em>',
	'SMTP_AUTH_METHOD'				=> 'Метод автентифікації для SMTP',
	'SMTP_AUTH_METHOD_EXPLAIN'		=> 'Використовується лише якщо встановлено ім’я користувача/пароль, запитайте у свого провайдера, якщо не впевнені, який метод використовувати.',
	'SMTP_CRAM_MD5'					=> 'CRAM-MD5',
	'SMTP_DIGEST_MD5'				=> 'DIGEST-MD5',
	'SMTP_LOGIN'					=> 'LOGIN',
	'SMTP_PASSWORD'					=> 'Пароль SMTP',
	'SMTP_PASSWORD_EXPLAIN'			=> 'Введіть пароль, лише якщо цього вимагає ваш сервер SMTP.<br><em><strong>Увага:</strong> цей пароль буде збережено у вигляді звичайного тексту в базі даних, видимий кожному, хто має доступ до вашої бази даних або може переглянути цю сторінку конфігурації.</em>',
	'SMTP_PLAIN'					=> 'PLAIN',
	'SMTP_POP_BEFORE_SMTP'			=> 'POP-BEFORE-SMTP',
	'SMTP_PORT'						=> 'Порт сервера SMTP',
	'SMTP_PORT_EXPLAIN'				=> 'Змінюйте це, лише якщо ви знаєте, що ваш сервер SMTP знаходиться на іншому порту.',
	'SMTP_SERVER'					=> 'Адреса сервера SMTP',
	'SMTP_SERVER_EXPLAIN'			=> 'Не вказуйте протокол (<samp>ssl://</samp> чи <samp>tls://</samp>), якщо тільки ваш поштовий хостинг не вказав вам це зробити.',
	'SMTP_SETTINGS'					=> 'Налаштування SMTP',
	'SMTP_USERNAME'					=> 'Ім’я користувача SMTP',
	'SMTP_USERNAME_EXPLAIN'			=> 'Введіть ім’я користувача, лише якщо цього вимагає ваш сервер SMTP.',
	'SMTP_VERIFY_PEER'				=> 'Перевіряти SSL-сертифікат',
	'SMTP_VERIFY_PEER_EXPLAIN'		=> 'Вимагати перевірку SSL-сертифіката, що використовується сервером SMTP. <br><em><strong>Увага:</strong> з’єднання з непідтвердженими SSL-сертифікатами може мати наслідки для безпеки.</em>',
	'SMTP_VERIFY_PEER_NAME'			=> 'Перевіряти ім’я вузла SMTP',
	'SMTP_VERIFY_PEER_NAME_EXPLAIN'	=> 'Вимагати перевірку імені вузла для серверів SMTP, що використовують з’єднання SSL/TLS. <br><em><strong>Увага:</strong> з’єднання з непідтвердженими вузлами може мати наслідки для безпеки.</em>',
	'TEST_EMAIL_SENT'				=> 'Тестовий лист надіслано.<br>Якщо ви його не отримали, будь ласка, перевірте налаштування ваших листів.<br><br>Якщо вам потрібна допомога, будь ласка, відвідайте <a href="https://www.phpbb.com/community/">форуми підтримки phpBB</a>.',

	'USE_SMTP'						=> 'Використовувати сервер SMTP для email',
	'USE_SMTP_EXPLAIN'				=> 'Оберіть «Так», якщо ви бажаєте чи маєте надсилати листи через названий сервер замість локальної поштової функції.',
));

// Jabber settings
$lang = array_merge($lang, array(
	'ACP_JABBER_SETTINGS_EXPLAIN'	=> 'Тут ви можете вмикати й контролювати використання Jabber для миттєвих повідомлень і сповіщень форуму. Jabber — це протокол з відкритим кодом, тому доступний для використання будь-ким. Деякі сервери Jabber включають шлюзи чи транспорти, які дозволяють зв’язуватися з користувачами в інших мережах. Не всі сервери пропонують усі транспорти, і зміни в протоколах можуть перешкоджати роботі транспортів. Будь ласка, обов’язково вводьте дані вже зареєстрованого облікового запису — phpBB використовуватиме введені вами тут дані як є.',

	'JAB_ALLOW_SELF_SIGNED'			=> 'Дозволити самопідписані SSL-сертифікати',
	'JAB_ALLOW_SELF_SIGNED_EXPLAIN'	=> 'Дозволити з’єднання із сервером Jabber із самопідписаним SSL-сертифікатом. <br><em><strong>Увага:</strong> дозвіл самопідписаних SSL-сертифікатів може мати наслідки для безпеки.</em>',
	'JAB_ENABLE'					=> 'Увімкнути Jabber',
	'JAB_ENABLE_EXPLAIN'			=> 'Вмикає використання повідомлень і сповіщень Jabber.',
	'JAB_GTALK_NOTE'				=> 'Будь ласка, зверніть увагу, GTalk не працюватиме, оскільки функцію <samp>dns_get_record</samp> не вдалося знайти. Ця функція недоступна в PHP4 і не реалізована на платформах Windows. Наразі вона не працює в системах на основі BSD, включно з Mac OS.',
	'JAB_PACKAGE_SIZE'				=> 'Розмір пакета Jabber',
	'JAB_PACKAGE_SIZE_EXPLAIN'		=> 'Це кількість повідомлень, що надсилаються в одному пакеті. Якщо встановлено 0, повідомлення надсилається негайно і не буде поставлено в чергу для подальшого надсилання.',
	'JAB_PASSWORD'					=> 'Пароль Jabber',
	'JAB_PASSWORD_EXPLAIN'			=> '<em><strong>Увага:</strong> цей пароль буде збережено у вигляді звичайного тексту в базі даних, видимий кожному, хто має доступ до вашої бази даних або може переглянути цю сторінку конфігурації.</em>',
	'JAB_PORT'						=> 'Порт Jabber',
	'JAB_PORT_EXPLAIN'				=> 'Залиште порожнім, якщо не знаєте, що це не порт 5222.',
	'JAB_SERVER'					=> 'Сервер Jabber',
	'JAB_SERVER_EXPLAIN'			=> 'Список серверів див. на %sjabber.org%s.',
	'JAB_SETTINGS_CHANGED'			=> 'Налаштування Jabber успішно змінено.',
	'JAB_USE_SSL'					=> 'Використовувати SSL для з’єднання',
	'JAB_USE_SSL_EXPLAIN'			=> 'Якщо увімкнено, буде здійснено спробу встановити безпечне з’єднання. Порт Jabber буде змінено на 5223, якщо вказано порт 5222.',
	'JAB_USERNAME'					=> 'Ім’я користувача Jabber або JID',
	'JAB_USERNAME_EXPLAIN'			=> 'Вкажіть зареєстроване ім’я користувача або дійсний JID. Ім’я користувача не буде перевірено на дійсність. Якщо ви вкажете лише ім’я користувача, ваш JID складатиметься з імені користувача та вказаного вами вище сервера. Інакше вкажіть дійсний JID, наприклад user@jabber.org.',
	'JAB_VERIFY_PEER'				=> 'Перевіряти SSL-сертифікат',
	'JAB_VERIFY_PEER_EXPLAIN'		=> 'Вимагати перевірку SSL-сертифіката, що використовується сервером Jabber. <br><em><strong>Увага:</strong> з’єднання з непідтвердженими SSL-сертифікатами може мати наслідки для безпеки.</em>',
	'JAB_VERIFY_PEER_NAME'			=> 'Перевіряти ім’я вузла Jabber',
	'JAB_VERIFY_PEER_NAME_EXPLAIN'	=> 'Вимагати перевірку імені вузла для серверів Jabber, що використовують з’єднання SSL/TLS. <br><em><strong>Увага:</strong> з’єднання з непідтвердженими вузлами може мати наслідки для безпеки.</em>',
));
