<?php
/**
*
* This file is part of the Ukrainian Language Pack
* for the phpBB Forum Software.
*
* @copyright (c) 2026 Magnum <https://magnumblog.space>
* @license GNU General Public License, version 2 (GPL-2.0)
*
* Ukrainian translation by Magnum (magnumblog.space)
*
*/

/**
* DO NOT CHANGE
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine

// Forum Admin
$lang = array_merge($lang, array(
	'AUTO_PRUNE_DAYS'			=> 'Вік повідомлень для автоочищення',
	'AUTO_PRUNE_DAYS_EXPLAIN'	=> 'Кількість днів з моменту останнього повідомлення, після якої тему буде видалено.',
	'AUTO_PRUNE_FREQ'			=> 'Частота автоочищення',
	'AUTO_PRUNE_FREQ_EXPLAIN'	=> 'Час у днях між подіями очищення.',
	'AUTO_PRUNE_VIEWED'			=> 'Вік перегляду повідомлень для автоочищення',
	'AUTO_PRUNE_VIEWED_EXPLAIN'	=> 'Кількість днів з моменту перегляду теми, після якої тему буде видалено.',
	'AUTO_PRUNE_SHADOW_FREQ'	=> 'Частота автоочищення тем-тіней',
	'AUTO_PRUNE_SHADOW_DAYS'	=> 'Вік автоочищення тем-тіней',
	'AUTO_PRUNE_SHADOW_DAYS_EXPLAIN'	=> 'Кількість днів, після якої тему-тінь буде видалено.',
	'AUTO_PRUNE_SHADOW_FREQ_EXPLAIN'	=> 'Час у днях між подіями очищення.',

	'CONTINUE'						=> 'Продовжити',
	'COPY_PERMISSIONS'				=> 'Копіювати права з',
	'COPY_PERMISSIONS_EXPLAIN'		=> 'Щоб полегшити налаштування прав для вашого нового форуму, ви можете скопіювати права наявного форуму.',
	'COPY_PERMISSIONS_ADD_EXPLAIN'	=> 'Після створення форум матиме такі самі права, як і обраний вами тут. Якщо форум не обрано, щойно створений форум не буде видимим, доки не буде встановлено права.',
	'COPY_PERMISSIONS_EDIT_EXPLAIN'	=> 'Якщо ви оберете копіювання прав, форум матиме такі самі права, як і обраний вами тут. Це перезапише будь-які права, встановлені вами раніше для цього форуму, правами обраного тут форуму. Якщо форум не обрано, поточні права буде збережено.',
	'COPY_TO_ACL'					=> 'Крім того, ви також можете %sвстановити нові права%s для цього форуму.',
	'CREATE_FORUM'					=> 'Створити новий форум',

	'DECIDE_MOVE_DELETE_CONTENT'		=> 'Видалити вміст або перемістити до форуму',
	'DECIDE_MOVE_DELETE_SUBFORUMS'		=> 'Видалити підфоруми або перемістити до форуму',
	'DEFAULT_STYLE'						=> 'Стиль за замовчуванням',
	'DELETE_ALL_POSTS'					=> 'Видалити повідомлення',
	'DELETE_SUBFORUMS'					=> 'Видалити підфоруми та повідомлення',
	'DISPLAY_ACTIVE_TOPICS'				=> 'Увімкнути активні теми',
	'DISPLAY_ACTIVE_TOPICS_EXPLAIN'		=> 'Якщо встановлено «так», активні теми в обраних підфорумах будуть показані під цією категорією.',

	'EDIT_FORUM'					=> 'Редагувати форум',
	'ENABLE_INDEXING'				=> 'Увімкнути пошукову індексацію',
	'ENABLE_INDEXING_EXPLAIN'		=> 'Якщо встановлено «так», повідомлення, надіслані в цьому форумі, будуть проіндексовані для пошуку.',
	'ENABLE_POST_REVIEW'			=> 'Увімкнути огляд повідомлень',
	'ENABLE_POST_REVIEW_EXPLAIN'	=> 'Якщо встановлено «так», користувачі можуть переглядати огляд свого повідомлення, якщо в темі з’явилися нові повідомлення, поки вони писали своє. Це слід вимкнути для форумів-чатів.',
	'ENABLE_QUICK_REPLY'			=> 'Увімкнути швидку відповідь',
	'ENABLE_QUICK_REPLY_EXPLAIN'	=> 'Вмикає швидку відповідь у цьому форумі. Це налаштування не враховується, якщо швидку відповідь вимкнено для всього форуму. Швидка відповідь буде показана лише користувачам, які мають право публікувати повідомлення в цьому форумі.',
	'ENABLE_RECENT'					=> 'Показувати активні теми',
	'ENABLE_RECENT_EXPLAIN'			=> 'Якщо встановлено «так», теми, створені в цьому форумі, будуть показані в списку активних тем.',
	'ENABLE_TOPIC_ICONS'			=> 'Увімкнути значки тем',

	'FORUM_ADMIN'						=> 'Керування форумами',
	'FORUM_ADMIN_EXPLAIN'				=> 'У phpBB3 все базується на форумах. Категорія — це просто особливий тип форуму. Кожен форум може мати необмежену кількість підфорумів, і ви можете визначати, чи можна в нього публікувати повідомлення (тобто чи діє він як стара категорія). Тут ви можете додавати, редагувати, видаляти, закривати, відкривати окремі форуми, а також встановлювати певні додаткові параметри. Якщо ваші повідомлення й теми розсинхронізувалися, ви також можете синхронізувати форум. <strong>Вам потрібно скопіювати або встановити відповідні права для новостворених форумів, щоб вони показувалися.</strong>',
	'FORUM_AUTO_PRUNE'					=> 'Увімкнути автоочищення',
	'FORUM_AUTO_PRUNE_EXPLAIN'			=> 'Очищує форум від тем, встановіть параметри частоти/віку нижче.',
	'FORUM_CREATED'						=> 'Форум успішно створено.',
	'FORUM_DATA_NEGATIVE'				=> 'Параметри очищення не можуть бути від’ємними.',
	'FORUM_DESC_TOO_LONG'				=> 'Опис форуму задовгий, він має бути коротшим за 4000 символів.',
	'FORUM_DELETE'						=> 'Видалити форум',
	'FORUM_DELETE_EXPLAIN'				=> 'Форма нижче дозволить вам видалити форум. Якщо в форум можна публікувати повідомлення, ви можете вирішити, куди помістити всі теми (чи форуми), які він містив.',
	'FORUM_DELETED'						=> 'Форум успішно видалено.',
	'FORUM_DESC'						=> 'Опис',
	'FORUM_DESC_EXPLAIN'				=> 'Будь-яка розмітка HTML, введена тут, буде показана як є. Якщо обраний тип форуму — категорія, опис не використовується.',
	'FORUM_EDIT_EXPLAIN'				=> 'Форма нижче дозволить вам налаштувати цей форум. Зверніть увагу, параметри модерування та підрахунку повідомлень встановлюються через права форуму для кожного користувача чи групи користувачів.',
	'FORUM_IMAGE'						=> 'Зображення форуму',
	'FORUM_IMAGE_EXPLAIN'				=> 'Розташування додаткового зображення, пов’язаного з цим форумом, відносно кореневої теки phpBB.',
	'FORUM_IMAGE_NO_EXIST'				=> 'Вказане зображення форуму не існує',
	'FORUM_LINK_EXPLAIN'				=> 'Повна URL-адреса (включно з протоколом, тобто: <samp>http://</samp>) місця призначення, куди перейде користувач, натиснувши цей форум, напр.: <samp>http://www.phpbb.com/</samp>.',
	'FORUM_LINK_TRACK'					=> 'Відстежувати переходи за посиланням',
	'FORUM_LINK_TRACK_EXPLAIN'			=> 'Записує кількість натискань на посилання форуму.',
	'FORUM_NAME'						=> 'Назва форуму',
	'FORUM_NAME_EMPTY'					=> 'Вам потрібно ввести назву для цього форуму.',
	'FORUM_NAME_EMOJI'					=> 'Введена вами назва форуму недійсна.<br>Вона містить наступні непідтримувані символи:<br>%s',
	'FORUM_PARENT'						=> 'Батьківський форум',
	'FORUM_PASSWORD'					=> 'Пароль форуму',
	'FORUM_PASSWORD_CONFIRM'			=> 'Підтвердіть пароль форуму',
	'FORUM_PASSWORD_CONFIRM_EXPLAIN'	=> 'Потрібно встановити лише якщо введено пароль форуму.',
	'FORUM_PASSWORD_EXPLAIN'			=> 'Визначає пароль для цього форуму, надавайте перевагу системі прав.',
	'FORUM_PASSWORD_UNSET'				=> 'Видалити пароль форуму',
	'FORUM_PASSWORD_UNSET_EXPLAIN'		=> 'Позначте тут, якщо бажаєте видалити пароль форуму.',
	'FORUM_PASSWORD_OLD'				=> 'Пароль форуму використовує застарілий метод хешування і його слід змінити.',
	'FORUM_PASSWORD_MISMATCH'			=> 'Введені вами паролі не збігаються.',
	'FORUM_PRUNE_SETTINGS'				=> 'Налаштування очищення форуму',
	'FORUM_PRUNE_SHADOW'				=> 'Увімкнути автоочищення тем-тіней',
	'FORUM_PRUNE_SHADOW_EXPLAIN'			=> 'Очищує форум від тем-тіней, встановіть параметри частоти/віку нижче.',
	'FORUM_RESYNCED'					=> 'Форум «%s» успішно синхронізовано',
	'FORUM_RULES_EXPLAIN'				=> 'Правила форуму показуються на кожній сторінці в межах вказаного форуму.',
	'FORUM_RULES_LINK'					=> 'Посилання на правила форуму',
	'FORUM_RULES_LINK_EXPLAIN'			=> 'Тут ви можете ввести URL-адресу сторінки/повідомлення з правилами вашого форуму. Це налаштування перевизначить текст правил форуму, який ви вказали.',
	'FORUM_RULES_PREVIEW'				=> 'Перегляд правил форуму',
	'FORUM_RULES_TOO_LONG'				=> 'Правила форуму мають бути коротшими за 4000 символів.',
	'FORUM_SETTINGS'					=> 'Налаштування форуму',
	'FORUM_STATUS'						=> 'Статус форуму',
	'FORUM_STYLE'						=> 'Стиль форуму',
	'FORUM_TOPICS_PAGE'					=> 'Тем на сторінці',
	'FORUM_TOPICS_PAGE_EXPLAIN'			=> 'Якщо не нуль, це значення перевизначить налаштування кількості тем на сторінці за замовчуванням.',
	'FORUM_TYPE'						=> 'Тип форуму',
	'FORUM_UPDATED'						=> 'Інформацію про форум успішно оновлено.',

	'FORUM_WITH_SUBFORUMS_NOT_TO_LINK'		=> 'Ви бажаєте змінити форум, у який можна публікувати повідомлення та який має підфоруми, на посилання. Будь ласка, перемістіть усі підфоруми з цього форуму, перш ніж продовжити, оскільки після зміни на посилання ви більше не зможете бачити підфоруми, наразі пов’язані з цим форумом.',

	'GENERAL_FORUM_SETTINGS'	=> 'Загальні налаштування форуму',

	'LINK'						=> 'Посилання',
	'LIMIT_SUBFORUMS'			=> 'Обмежити легенду прямими дочірніми підфорумами',
	'LIMIT_SUBFORUMS_EXPLAIN'	=> 'Обмежує показувані підфоруми лише тими, що є прямими нащадками (дочірніми) поточного форуму. Вимкнення цього покаже всі підфоруми з увімкненим параметром «Показувати підфоруми в легенді», незалежно від глибини.',
	'LIST_INDEX'				=> 'Показувати підфорум у легенді батьківського форуму',
	'LIST_INDEX_EXPLAIN'		=> 'Показує цей форум на головній сторінці та в інших місцях як посилання в легенді свого батьківського форуму, якщо для батьківського форуму увімкнено параметр «Показувати підфоруми в легенді».',
	'LIST_SUBFORUMS'			=> 'Показувати підфоруми в легенді',
	'LIST_SUBFORUMS_EXPLAIN'	=> 'Показує підфоруми цього форуму на головній сторінці та в інших місцях як посилання в легенді, якщо для них увімкнено параметр «Показувати підфорум у легенді батьківського форуму».',
	'LOCKED'					=> 'Закрито',

	'MOVE_POSTS_NO_POSTABLE_FORUM'	=> 'Обраний вами форум для переміщення повідомлень непридатний для публікацій. Будь ласка, оберіть форум, придатний для публікацій.',
	'MOVE_POSTS_TO'					=> 'Перемістити повідомлення до',
	'MOVE_SUBFORUMS_TO'				=> 'Перемістити підфоруми до',

	'NO_DESTINATION_FORUM'			=> 'Ви не вказали форум для переміщення вмісту.',
	'NO_FORUM_ACTION'				=> 'Не визначено дію щодо того, що станеться з вмістом форуму.',
	'NO_PARENT'						=> 'Немає батьківського',
	'NO_PERMISSIONS'				=> 'Не копіювати права',
	'NO_PERMISSION_FORUM_ADD'		=> 'У вас немає необхідних прав для додавання форумів.',
	'NO_PERMISSION_FORUM_DELETE'	=> 'У вас немає необхідних прав для видалення форумів.',

	'PARENT_IS_LINK_FORUM'		=> 'Вказаний вами батьківський елемент є форумом-посиланням. Форуми-посилання не можуть містити інші форуми, будь ласка, вкажіть категорію чи форум як батьківський форум.',
	'PARENT_NOT_EXIST'			=> 'Батьківський елемент не існує.',
	'PRUNE_ANNOUNCEMENTS'		=> 'Очистити оголошення',
	'PRUNE_STICKY'				=> 'Очистити закріплені теми',
	'PRUNE_OLD_POLLS'			=> 'Очистити старі опитування',
	'PRUNE_OLD_POLLS_EXPLAIN'	=> 'Видаляє теми з опитуваннями, у яких не голосували протягом вказаної кількості днів з часу повідомлення.',

	'REDIRECT_ACL'	=> 'Тепер ви можете %sвстановити права%s для цього форуму.',

	'SYNC_IN_PROGRESS'			=> 'Синхронізація форуму',
	'SYNC_IN_PROGRESS_EXPLAIN'	=> 'Наразі синхронізується діапазон тем %1$d/%2$d.',

	'TYPE_CAT'			=> 'Категорія',
	'TYPE_FORUM'		=> 'Форум',
	'TYPE_LINK'			=> 'Посилання',

	'UNLOCKED'			=> 'Відкрито',
));
