<?php
/**
*
* This file is part of the Ukrainian Language Pack
* for the phpBB Forum Software.
*
* @copyright (c) 2026 Magnum <https://magnumblog.space>
* @license GNU General Public License, version 2 (GPL-2.0)
*
* Ukrainian translation by Magnum (magnumblog.space)
*
*/

/**
* DO NOT CHANGE
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine

$lang = array_merge($lang, array(
	'ACP_GROUPS_MANAGE_EXPLAIN'		=> 'На цій панелі ви можете керувати всіма своїми групами користувачів. Ви можете видаляти, створювати та редагувати наявні групи. Крім того, ви можете обирати лідерів груп, перемикати статус групи (відкрита/прихована/закрита) та встановлювати назву й опис групи.',
	'ADD_GROUP_CATEGORY'			=> 'Додати категорію',
	'ADD_USERS'						=> 'Додати користувачів',
	'ADD_USERS_EXPLAIN'				=> 'Тут ви можете додати нових користувачів до групи. Ви можете обрати, чи стане ця група новою основною для обраних користувачів. Крім того, ви можете визначити їх лідерами групи. Будь ласка, вводьте кожне ім’я користувача в окремому рядку.',

	'COPY_PERMISSIONS'				=> 'Копіювати права з',
	'COPY_PERMISSIONS_EXPLAIN'		=> 'Після створення група матиме такі самі права, як і обрана вами тут.',
	'CREATE_GROUP'					=> 'Створити нову групу',

	'GROUPS_NO_MEMBERS'				=> 'У цій групі немає учасників',
	'GROUPS_NO_MODS'				=> 'Лідерів групи не визначено',

	'GROUP_APPROVE'					=> 'Схвалити учасника',
	'GROUP_APPROVED'				=> 'Схвалені учасники',
	'GROUP_AVATAR'					=> 'Аватар групи',
	'GROUP_AVATAR_EXPLAIN'			=> 'Це зображення буде показано в панелі керування групою.',
	'GROUP_CATEGORY_NAME'			=> 'Назва категорії',
	'GROUP_CLOSED'					=> 'Закрита',
	'GROUP_COLOR'					=> 'Колір групи',
	'GROUP_COLOR_EXPLAIN'			=> 'Визначає колір, яким показуватимуться імена користувачів учасників, залиште порожнім для значення за замовчуванням.',
	'GROUP_CONFIRM_ADD_USERS'		=> array(
		1	=> 'Ви впевнені, що бажаєте додати користувача %2$s до групи?',
		2	=> 'Ви впевнені, що бажаєте додати користувачів %2$s до групи?',
	),
	'GROUP_CREATED'					=> 'Групу успішно створено.',
	'GROUP_DEFAULT'					=> 'Зробити групу основною для учасника',
	'GROUP_DEFS_UPDATED'			=> 'Основну групу встановлено для всіх обраних учасників.',
	'GROUP_DELETE'					=> 'Видалити учасника з групи',
	'GROUP_DELETED'					=> 'Групу видалено, основні групи користувачів успішно встановлено.',
	'GROUP_DEMOTE'					=> 'Понизити лідера групи',
	'GROUP_DESC'					=> 'Опис групи',
	'GROUP_DETAILS'					=> 'Дані групи',
	'GROUP_EDIT_EXPLAIN'			=> 'Тут ви можете редагувати наявну групу. Ви можете змінити її назву, опис і тип (відкрита, закрита тощо). Ви також можете встановити певні загальногрупові параметри, такі як колір, звання тощо. Зміни, зроблені тут, перевизначають поточні налаштування користувачів. Зверніть увагу, учасники групи можуть перевизначати налаштування аватара групи, якщо ви не встановите відповідні права користувача.',
	'GROUP_ERR_USERS_EXIST'			=> 'Вказані користувачі вже є учасниками цієї групи.',
	'GROUP_FOUNDER_MANAGE'			=> 'Керування лише засновниками',
	'GROUP_FOUNDER_MANAGE_EXPLAIN'	=> 'Обмежити керування цією групою лише засновниками. Користувачі з груповими правами все ще можуть бачити цю групу та її учасників.',
	'GROUP_HIDDEN'					=> 'Прихована',
	'GROUP_LANG'					=> 'Мова групи',
	'GROUP_LEAD'					=> 'Лідери групи',
	'GROUP_LEADERS_ADDED'			=> 'Нових лідерів успішно додано до групи.',
	'GROUP_LEGEND'					=> 'Показувати групу в легенді',
	'GROUP_LIST'					=> 'Поточні учасники',
	'GROUP_LIST_EXPLAIN'			=> 'Це повний список усіх поточних користувачів, які є учасниками цієї групи. Ви можете видаляти учасників (за винятком певних спеціальних груп) або додавати нових на власний розсуд.',
	'GROUP_MEMBERS'					=> 'Учасники групи',
	'GROUP_MEMBERS_EXPLAIN'			=> 'Це повний список усіх учасників цієї групи користувачів. Він включає окремі розділи для лідерів, очікуваних та наявних учасників. Звідси ви можете керувати всіма аспектами членства в цій групі та ролями учасників. Щоб видалити лідера, але залишити його в групі, використовуйте «Понизити», а не «Видалити». Аналогічно використовуйте «Підвищити», щоб зробити наявного учасника лідером.',
	'GROUP_MESSAGE_LIMIT'			=> 'Ліміт особистих повідомлень групи на теку',
	'GROUP_MESSAGE_LIMIT_EXPLAIN'	=> 'Це налаштування перевизначає ліміт повідомлень у теці для окремого користувача. Для визначення фактичного значення використовується максимум серед усіх груп користувача.<br />Встановіть це значення на 0, щоб перезаписати налаштування для всіх користувачів цієї групи загальнофорумним налаштуванням.',
	'GROUP_MODS_ADDED'				=> 'Нових лідерів групи успішно додано.',
	'GROUP_MODS_DEMOTED'			=> 'Лідерів групи успішно понижено.',
	'GROUP_MODS_PROMOTED'			=> 'Учасників групи успішно підвищено.',
	'GROUP_NAME'					=> 'Назва групи',
	'GROUP_NAME_TAKEN'				=> 'Введена вами назва групи вже використовується, будь ласка, оберіть іншу.',
	'GROUP_OPEN'					=> 'Відкрита',
	'GROUP_PENDING'					=> 'Учасники, що очікують',
	'GROUP_MAX_RECIPIENTS'			=> 'Максимальна кількість дозволених отримувачів на особисте повідомлення',
	'GROUP_MAX_RECIPIENTS_EXPLAIN'	=> 'Максимальна кількість дозволених отримувачів в особистому повідомленні. Для визначення фактичного значення використовується максимум серед усіх груп користувача.<br />Встановіть це значення на 0, щоб перезаписати налаштування для всіх користувачів цієї групи загальнофорумним налаштуванням.',
	'GROUP_OPTIONS_SAVE'			=> 'Загальногрупові параметри',
	'GROUP_PROMOTE'					=> 'Підвищити до лідера групи',
	'GROUP_RANK'					=> 'Звання групи',
	'GROUP_RECEIVE_PM'				=> 'Група може отримувати особисті повідомлення',
	'GROUP_RECEIVE_PM_EXPLAIN'		=> 'Зверніть увагу, прихованим групам неможливо надіслати повідомлення, незалежно від цього налаштування.',
	'GROUP_REQUEST'					=> 'Запит',
	'GROUP_SETTINGS_SAVE'			=> 'Загальногрупові налаштування',
	'GROUP_SKIP_AUTH'				=> 'Звільнити лідера групи від прав',
	'GROUP_SKIP_AUTH_EXPLAIN'		=> 'Якщо увімкнено, лідер групи більше не успадковує права від групи.',
	'GROUP_SPECIAL'					=> 'Наперед визначена',
	'GROUP_TEAMPAGE'				=> 'Показувати групу на сторінці команди',
	'GROUP_TYPE'					=> 'Тип групи',
	'GROUP_TYPE_EXPLAIN'			=> 'Це визначає, які користувачі можуть приєднуватися до цієї групи чи переглядати її.',
	'GROUP_UPDATED'					=> 'Налаштування групи успішно оновлено.',

	'GROUP_USERS_ADDED'				=> 'Нових користувачів успішно додано до групи.',
	'GROUP_USERS_EXIST'				=> 'Обрані користувачі вже є учасниками.',
	'GROUP_USERS_REMOVE'			=> 'Користувачів видалено з групи, нові основні групи успішно встановлено.',
	'GROUP_USERS_INVALID'			=> 'Жодного користувача не додано до групи, оскільки наступні імена користувачів не існують: %s',

	'LEGEND_EXPLAIN'				=> 'Це групи, які показано в легенді груп:',
	'LEGEND_SETTINGS'				=> 'Налаштування легенди',
	'LEGEND_SORT_GROUPNAME'			=> 'Сортувати легенду за назвою групи',
	'LEGEND_SORT_GROUPNAME_EXPLAIN'	=> 'Порядок нижче ігнорується, коли цей параметр увімкнено.',

	'MANAGE_LEGEND'			=> 'Керування легендою груп',
	'MANAGE_TEAMPAGE'		=> 'Керування сторінкою команди',
	'MAKE_DEFAULT_FOR_ALL'	=> 'Зробити основною групою для кожного учасника',
	'MEMBERS'				=> 'Учасники',

	'NO_GROUP'					=> 'Групу не вказано.',
	'NO_GROUPS_ADDED'			=> 'Груп ще не додано.',
	'NO_GROUPS_CREATED'			=> 'Груп ще не створено.',
	'NO_PERMISSIONS'			=> 'Не копіювати права',
	'NO_USERS'					=> 'Ви не ввели жодного користувача.',
	'NO_USERS_ADDED'			=> 'Жодного користувача не додано до групи.',
	'NO_VALID_USERS'			=> 'Ви не ввели жодного користувача, придатного для цієї дії.',

	'PENDING_MEMBERS'			=> 'Очікують',

	'SELECT_GROUP'				=> 'Оберіть групу',
	'SPECIAL_GROUPS'			=> 'Наперед визначені групи',
	'SPECIAL_GROUPS_EXPLAIN'	=> 'Наперед визначені групи — це спеціальні групи, їх неможливо видалити чи напряму змінити. Однак ви все ще можете додавати користувачів і змінювати базові налаштування.',

	'TEAMPAGE'					=> 'Сторінка команди',
	'TEAMPAGE_DISP_ALL'			=> 'Усі членства',
	'TEAMPAGE_DISP_DEFAULT'		=> 'Лише основна група користувача',
	'TEAMPAGE_DISP_FIRST'		=> 'Лише перше членство',
	'TEAMPAGE_EXPLAIN'			=> 'Це групи, які показано на сторінці команди:',
	'TEAMPAGE_FORUMS'			=> 'Показувати модеровані форуми',
	'TEAMPAGE_FORUMS_EXPLAIN'	=> 'Якщо встановлено «так», модератори матимуть у своєму рядку список усіх форумів, де вони мають права модератора. Це може бути дуже вимогливим до бази даних для великих форумів.',
	'TEAMPAGE_MEMBERSHIPS'		=> 'Показувати членства користувача',
	'TEAMPAGE_SETTINGS'			=> 'Налаштування сторінки команди',
	'TOTAL_MEMBERS'				=> 'Учасники',

	'USERS_APPROVED'				=> 'Користувачів успішно схвалено.',
	'USER_DEFAULT'					=> 'За замовчуванням для користувача',
	'USER_DEF_GROUPS'				=> 'Визначені користувачем групи',
	'USER_DEF_GROUPS_EXPLAIN'		=> 'Це групи, створені вами чи іншим адміністратором на цьому форумі. Ви можете керувати членством, а також редагувати властивості групи чи навіть видалити групу.',
	'USER_GROUP_DEFAULT'			=> 'Встановити як основну групу',
	'USER_GROUP_DEFAULT_EXPLAIN'	=> 'Вибір «так» тут встановить цю групу як основну для доданих користувачів.',
	'USER_GROUP_LEADER'				=> 'Встановити як лідера групи',
));
