<?php
/**
*
* This file is part of the Ukrainian Language Pack
* for the phpBB Forum Software.
*
* @copyright (c) 2026 Magnum <https://magnumblog.space>
* @license GNU General Public License, version 2 (GPL-2.0)
*
* Ukrainian translation by Magnum (magnumblog.space)
*
*/

/**
* DO NOT CHANGE
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine

$lang = array_merge($lang, array(
	'ACP_PERMISSIONS_EXPLAIN'	=> '
		<p>Права дуже деталізовані та поділені на чотири основні розділи:</p>

		<h2>Загальні права</h2>
		<p>Використовуються для контролю доступу на загальному рівні та стосуються всього форуму. Вони додатково поділяються на права користувачів, права груп, адміністраторів і глобальних модераторів.</p>

		<h2>Права на основі форуму</h2>
		<p>Використовуються для контролю доступу для кожного форуму окремо. Вони додатково поділяються на права форуму, модераторів форуму, права користувачів форуму та права груп форуму.</p>

		<h2>Ролі прав</h2>
		<p>Використовуються для створення різних наборів прав для різних типів прав, які пізніше можна призначати на основі ролей. Наперед визначені ролі мають охоплювати керування як великими, так і малими форумами, хоча в кожному з чотирьох розділів ви можете додавати/редагувати/видаляти ролі на свій розсуд.</p>

		<h2>Маски прав</h2>
		<p>Використовуються для перегляду фактичних прав, призначених користувачам, модераторам (локальним і глобальним), адміністраторам чи форумам.</p>

		<br />

		<p>Для отримання додаткової інформації про налаштування та керування правами на вашому форумі phpBB3, будь ласка, перегляньте розділ <a href="https://www.phpbb.com/support/docs/en/3.3/ug/quickstart/permissions/">«Встановлення прав» нашого посібника швидкого старту</a>.</p>
	',

	'ACL_NEVER'				=> 'Ніколи',
	'ACL_SET'				=> 'Встановлення прав',
	'ACL_SET_EXPLAIN'		=> 'Права базуються на простій системі <strong>ТАК</strong>/<strong>НІ</strong>. Встановлення параметра на <strong>НІКОЛИ</strong> для користувача чи групи користувачів перевизначає будь-яке інше призначене йому значення. Якщо ви не бажаєте призначати значення для цього параметра для цього користувача чи групи, оберіть <strong>НІ</strong>. Якщо значення для цього параметра призначено в іншому місці, вони матимуть пріоритет, інакше вважається <strong>НІКОЛИ</strong>. Всі об’єкти, позначені (прапорцем перед ними), скопіюють визначений вами набір прав. Зверніть увагу, встановлення адміністративних прав для облікових записів засновників не має ефекту, оскільки права адміністратора для засновників завжди встановлено на <strong>ТАК</strong>.',
	'ACL_SETTING'			=> 'Налаштування',

	'ACL_TYPE_A_'			=> 'Адміністративні права',
	'ACL_TYPE_F_'			=> 'Права форуму',
	'ACL_TYPE_M_'			=> 'Права модерування',
	'ACL_TYPE_U_'			=> 'Права користувача',

	'ACL_TYPE_GLOBAL_A_'	=> 'Адміністративні права',
	'ACL_TYPE_GLOBAL_U_'	=> 'Права користувача',
	'ACL_TYPE_GLOBAL_M_'	=> 'Права глобального модератора',
	'ACL_TYPE_LOCAL_M_'		=> 'Права модератора форуму',
	'ACL_TYPE_LOCAL_F_'		=> 'Права форуму',

	'ACL_NO'				=> 'Ні',
	'ACL_VIEW'				=> 'Перегляд прав',
	'ACL_VIEW_EXPLAIN'		=> 'Тут ви можете переглянути фактичні права, які має користувач/група. Червоний квадрат означає, що користувач/група не має цього права, зелений квадрат означає, що користувач/група має це право.',
	'ACL_YES'				=> 'Так',

	'ACP_ADMINISTRATORS_EXPLAIN'				=> 'Тут ви можете призначати права адміністратора користувачам чи групам. Всі користувачі з правами адміністратора можуть переглядати панель адміністрування.',
	'ACP_FORUM_MODERATORS_EXPLAIN'				=> 'Тут ви можете призначати користувачів і групи модераторами форуму. Щоб надати користувачам доступ до форумів, визначити глобальні права модерування чи адміністраторів, будь ласка, скористайтеся відповідною сторінкою.',
	'ACP_FORUM_PERMISSIONS_EXPLAIN'				=> 'Тут ви можете змінювати, які користувачі та групи мають доступ до яких форумів. Щоб призначити модераторів чи визначити адміністраторів, будь ласка, скористайтеся відповідною сторінкою.',
	'ACP_FORUM_PERMISSIONS_COPY_EXPLAIN'		=> 'Тут ви можете скопіювати права форуму з одного форуму до одного чи кількох інших форумів.',
	'ACP_GLOBAL_MODERATORS_EXPLAIN'				=> 'Тут ви можете призначати права глобального модератора користувачам чи групам. Ці модератори схожі на звичайних модераторів, окрім того, що вони мають доступ до кожного форуму на вашому форумі.',
	'ACP_GROUPS_FORUM_PERMISSIONS_EXPLAIN'		=> 'Тут ви можете призначати права форуму групам.',
	'ACP_GROUPS_PERMISSIONS_EXPLAIN'			=> 'Тут ви можете призначати групам загальні права: права користувача, права глобального модератора та права адміністратора. Права користувача включають можливості, такі як використання аватарів, надсилання особистих повідомлень тощо; права глобального модератора — схвалення повідомлень, керування темами, керування блокуваннями тощо, і, нарешті, права адміністратора — зміну прав, визначення користувацьких BBCode, керування форумами тощо. Окремі права користувача слід змінювати лише в рідкісних випадках, бажаний метод — розміщення користувачів у групах і призначення прав групи.',
	'ACP_ADMIN_ROLES_EXPLAIN'					=> 'Тут ви можете керувати ролями для адміністративних прав. Ролі — це фактичні права; якщо ви зміните роль, елементи з призначеною цією роллю також змінять свої права.',
	'ACP_FORUM_ROLES_EXPLAIN'					=> 'Тут ви можете керувати ролями для прав форуму. Ролі — це фактичні права; якщо ви зміните роль, елементи з призначеною цією роллю також змінять свої права.',
	'ACP_MOD_ROLES_EXPLAIN'						=> 'Тут ви можете керувати ролями для прав модерування. Ролі — це фактичні права; якщо ви зміните роль, елементи з призначеною цією роллю також змінять свої права.',
	'ACP_USER_ROLES_EXPLAIN'					=> 'Тут ви можете керувати ролями для прав користувача. Ролі — це фактичні права; якщо ви зміните роль, елементи з призначеною цією роллю також змінять свої права.',
	'ACP_USERS_FORUM_PERMISSIONS_EXPLAIN'		=> 'Тут ви можете призначати права форуму користувачам.',
	'ACP_USERS_PERMISSIONS_EXPLAIN'				=> 'Тут ви можете призначати користувачам загальні права: права користувача, права глобального модератора та права адміністратора. Права користувача включають можливості, такі як використання аватарів, надсилання особистих повідомлень тощо; права глобального модератора — схвалення повідомлень, керування темами, керування блокуваннями тощо, і, нарешті, права адміністратора — зміну прав, визначення користувацьких BBCode, керування форумами тощо. Щоб змінити ці налаштування для великої кількості користувачів, бажаний спосіб — система прав груп. Права користувача слід змінювати лише в рідкісних випадках, бажаний метод — розміщення користувачів у групах і призначення прав групи.',
	'ACP_VIEW_ADMIN_PERMISSIONS_EXPLAIN'		=> 'Тут ви можете переглянути фактичні адміністративні права, призначені обраним користувачам/групам.',
	'ACP_VIEW_GLOBAL_MOD_PERMISSIONS_EXPLAIN'	=> 'Тут ви можете переглянути глобальні права модерування, призначені обраним користувачам/групам.',
	'ACP_VIEW_FORUM_PERMISSIONS_EXPLAIN'		=> 'Тут ви можете переглянути права форуму, призначені обраним користувачам/групам і форумам.',
	'ACP_VIEW_FORUM_MOD_PERMISSIONS_EXPLAIN'	=> 'Тут ви можете переглянути права модератора форуму, призначені обраним користувачам/групам і форумам.',
	'ACP_VIEW_USER_PERMISSIONS_EXPLAIN'			=> 'Тут ви можете переглянути фактичні права користувача, призначені обраним користувачам/групам.',

	'ADD_GROUPS'				=> 'Додати групи',
	'ADD_PERMISSIONS'			=> 'Додати права',
	'ADD_USERS'					=> 'Додати користувачів',
	'ADVANCED_PERMISSIONS'		=> 'Розширені права',
	'ALL_GROUPS'				=> 'Обрати всі групи',
	'ALL_NEVER'					=> 'Всі <strong>НІКОЛИ</strong>',
	'ALL_NO'					=> 'Всі <strong>НІ</strong>',
	'ALL_USERS'					=> 'Обрати всіх користувачів',
	'ALL_YES'					=> 'Всі <strong>ТАК</strong>',
	'APPLY_ALL_PERMISSIONS'		=> 'Застосувати всі права',
	'APPLY_PERMISSIONS'			=> 'Застосувати права',
	'APPLY_PERMISSIONS_EXPLAIN'	=> 'Права та роль, визначені для цього елемента, будуть застосовані лише до цього елемента та всіх позначених елементів.',
	'AUTH_UPDATED'				=> 'Права оновлено.',

	'COPY_PERMISSIONS_CONFIRM'				=> 'Ви впевнені, що бажаєте виконати цю операцію? Будь ласка, майте на увазі, що це перезапише будь-які наявні права на обраних цілях.',
	'COPY_PERMISSIONS_FORUM_FROM_EXPLAIN'	=> 'Форум-джерело, з якого ви бажаєте скопіювати права.',
	'COPY_PERMISSIONS_FORUM_TO_EXPLAIN'		=> 'Форуми призначення, до яких застосовуватимуться скопійовані права.',
	'COPY_PERMISSIONS_FROM'					=> 'Копіювати права з',
	'COPY_PERMISSIONS_TO'					=> 'Застосувати права до',

	'CREATE_ROLE'				=> 'Створити роль',
	'CREATE_ROLE_FROM'			=> 'Використати налаштування з…',
	'CUSTOM'					=> 'Власне…',

	'DEFAULT'					=> 'За замовчуванням',
	'DELETE_ROLE'				=> 'Видалити роль',
	'DELETE_ROLE_CONFIRM'		=> 'Ви впевнені, що бажаєте видалити цю роль? Елементи з призначеною цією роллю <strong>не</strong> втратять свої налаштування прав.',
	'DISPLAY_ROLE_ITEMS'		=> 'Переглянути елементи, що використовують цю роль',

	'EDIT_PERMISSIONS'			=> 'Редагувати права',
	'EDIT_ROLE'					=> 'Редагувати роль',

	'GROUPS_NOT_ASSIGNED'		=> 'Жодну групу не призначено цій ролі',

	'LOOK_UP_GROUP'				=> 'Знайти групу користувачів',
	'LOOK_UP_USER'				=> 'Знайти користувача',

	'MANAGE_GROUPS'		=> 'Керування групами',
	'MANAGE_USERS'		=> 'Керування користувачами',

	'NO_AUTH_SETTING_FOUND'		=> 'Налаштування прав не визначено.',
	'NO_ROLE_ASSIGNED'			=> 'Роль не призначено…',
	'NO_ROLE_ASSIGNED_EXPLAIN'	=> 'Встановлення цієї ролі не змінює права праворуч. Якщо ви бажаєте скасувати/видалити всі права, вам слід скористатися посиланням «Всі <strong>НІ</strong>».',
	'NO_ROLE_AVAILABLE'			=> 'Немає доступних ролей',
	'NO_ROLE_NAME_SPECIFIED'	=> 'Будь ласка, вкажіть назву ролі.',
	'NO_ROLE_SELECTED'			=> 'Роль не знайдено.',
	'NO_USER_GROUP_SELECTED'	=> 'Ви не обрали жодного користувача чи групу.',

	'ONLY_FORUM_DEFINED'	=> 'Ви вказали лише форуми у своєму виборі. Будь ласка, оберіть також щонайменше одного користувача чи одну групу.',

	'PERMISSION_APPLIED_TO_ALL'		=> 'Права та роль також будуть застосовані до всіх позначених об’єктів',
	'PLUS_SUBFORUMS'				=> '+Підфоруми',

	'REMOVE_PERMISSIONS'			=> 'Видалити права',
	'REMOVE_ROLE'					=> 'Видалити роль',
	'RESULTING_PERMISSION'			=> 'Результуюче право',
	'ROLE'							=> 'Роль',
	'ROLE_ADD_SUCCESS'				=> 'Роль успішно додано.',
	'ROLE_ASSIGNED_TO'				=> 'Користувачі/групи, призначені до %s',
	'ROLE_DELETED'					=> 'Роль успішно видалено.',
	'ROLE_DESCRIPTION'				=> 'Опис ролі',

	'ROLE_ADMIN_FORUM'			=> 'Адміністратор форуму',
	'ROLE_ADMIN_FULL'			=> 'Повний адміністратор',
	'ROLE_ADMIN_STANDARD'		=> 'Стандартний адміністратор',
	'ROLE_ADMIN_USERGROUP'		=> 'Адміністратор користувачів і груп',
	'ROLE_FORUM_BOT'			=> 'Доступ для бота',
	'ROLE_FORUM_FULL'			=> 'Повний доступ',
	'ROLE_FORUM_LIMITED'		=> 'Обмежений доступ',
	'ROLE_FORUM_LIMITED_POLLS'	=> 'Обмежений доступ + опитування',
	'ROLE_FORUM_NOACCESS'		=> 'Без доступу',
	'ROLE_FORUM_ONQUEUE'		=> 'У черзі модерації',
	'ROLE_FORUM_POLLS'			=> 'Стандартний доступ + опитування',
	'ROLE_FORUM_READONLY'		=> 'Доступ лише для читання',
	'ROLE_FORUM_STANDARD'		=> 'Стандартний доступ',
	'ROLE_FORUM_NEW_MEMBER'		=> 'Доступ новозареєстрованого користувача',
	'ROLE_MOD_FULL'				=> 'Повний модератор',
	'ROLE_MOD_QUEUE'			=> 'Модератор черги',
	'ROLE_MOD_SIMPLE'			=> 'Простий модератор',
	'ROLE_MOD_STANDARD'			=> 'Стандартний модератор',
	'ROLE_USER_FULL'			=> 'Всі функції',
	'ROLE_USER_LIMITED'			=> 'Обмежені функції',
	'ROLE_USER_NOAVATAR'		=> 'Без аватара',
	'ROLE_USER_NOPM'			=> 'Без особистих повідомлень',
	'ROLE_USER_STANDARD'		=> 'Стандартні функції',
	'ROLE_USER_NEW_MEMBER'		=> 'Функції новозареєстрованого користувача',

	'ROLE_DESCRIPTION_ADMIN_FORUM'			=> 'Має доступ до керування форумами та налаштувань прав форуму.',
	'ROLE_DESCRIPTION_ADMIN_FULL'			=> 'Має доступ до всіх адміністративних функцій цього форуму.<br />Не рекомендується.',
	'ROLE_DESCRIPTION_ADMIN_STANDARD'		=> 'Має доступ до більшості адміністративних функцій, але не має права використовувати інструменти, пов’язані із сервером чи системою.',
	'ROLE_DESCRIPTION_ADMIN_USERGROUP'		=> 'Може керувати групами й користувачами: змінювати права, налаштування, керувати блокуваннями та званнями.',
	'ROLE_DESCRIPTION_FORUM_BOT'			=> 'Ця роль рекомендована для ботів і пошукових павуків.',
	'ROLE_DESCRIPTION_FORUM_FULL'			=> 'Може використовувати всі функції форуму, включно з публікацією оголошень і закріплених тем. Також може ігнорувати обмеження частоти.<br />Не рекомендується для звичайних користувачів.',
	'ROLE_DESCRIPTION_FORUM_LIMITED'		=> 'Може використовувати деякі функції форуму, але не може додавати вкладення чи використовувати значки повідомлень.',
	'ROLE_DESCRIPTION_FORUM_LIMITED_POLLS'	=> 'Як обмежений доступ, але також може створювати опитування.',
	'ROLE_DESCRIPTION_FORUM_NOACCESS'		=> 'Не може ні бачити, ні отримати доступ до форуму.',
	'ROLE_DESCRIPTION_FORUM_ONQUEUE'		=> 'Може використовувати більшість функцій форуму, включно з вкладеннями, але повідомлення й теми потребують схвалення модератором.',
	'ROLE_DESCRIPTION_FORUM_POLLS'			=> 'Як стандартний доступ, але також може створювати опитування.',
	'ROLE_DESCRIPTION_FORUM_READONLY'		=> 'Може читати форум, але не може створювати нові теми чи відповідати на повідомлення.',
	'ROLE_DESCRIPTION_FORUM_STANDARD'		=> 'Може використовувати більшість функцій форуму, включно з вкладеннями та видаленням власних тем, але не може закривати власні теми та не може створювати опитування.',
	'ROLE_DESCRIPTION_FORUM_NEW_MEMBER'		=> 'Роль для учасників спеціальної групи новозареєстрованих користувачів; містить права <strong>НІКОЛИ</strong> для блокування функцій новим користувачам.',
	'ROLE_DESCRIPTION_MOD_FULL'				=> 'Може використовувати всі функції модерування, включно з блокуванням.',
	'ROLE_DESCRIPTION_MOD_QUEUE'			=> 'Може використовувати чергу модерації для перевірки й редагування повідомлень, але нічого більше.',
	'ROLE_DESCRIPTION_MOD_SIMPLE'			=> 'Може використовувати лише базові дії з темами. Не може надсилати попередження чи використовувати чергу модерації.',
	'ROLE_DESCRIPTION_MOD_STANDARD'			=> 'Може використовувати більшість інструментів модерування, але не може блокувати користувачів чи змінювати автора повідомлення.',
	'ROLE_DESCRIPTION_USER_FULL'			=> 'Може використовувати всі доступні функції форуму для користувачів, включно зі зміною імені користувача чи ігноруванням обмеження частоти.<br />Не рекомендується.',
	'ROLE_DESCRIPTION_USER_LIMITED'			=> 'Має доступ до деяких функцій користувача. Вкладення, листи чи миттєві повідомлення не дозволені.',
	'ROLE_DESCRIPTION_USER_NOAVATAR'		=> 'Має обмежений набір функцій і не може використовувати функцію аватара.',
	'ROLE_DESCRIPTION_USER_NOPM'			=> 'Має обмежений набір функцій і не може використовувати особисті повідомлення.',
	'ROLE_DESCRIPTION_USER_STANDARD'		=> 'Має доступ до більшості, але не всіх функцій користувача. Наприклад, не може змінювати ім’я користувача чи ігнорувати обмеження частоти.',
	'ROLE_DESCRIPTION_USER_NEW_MEMBER'		=> 'Роль для учасників спеціальної групи новозареєстрованих користувачів; містить права <strong>НІКОЛИ</strong> для блокування функцій новим користувачам.',

	'ROLE_DESCRIPTION_EXPLAIN'		=> 'Ви можете ввести короткий опис того, що робить ця роль або для чого вона призначена. Введений вами текст буде також показано на екранах прав.',
	'ROLE_DESCRIPTION_LONG'			=> 'Опис ролі задовгий, будь ласка, обмежте його 4000 символами.',
	'ROLE_DETAILS'					=> 'Дані ролі',
	'ROLE_EDIT_SUCCESS'				=> 'Роль успішно відредаговано.',
	'ROLE_NAME'						=> 'Назва ролі',
	'ROLE_NAME_ALREADY_EXIST'		=> 'Роль з назвою <strong>%s</strong> вже існує для вказаного типу прав.',
	'ROLE_NOT_ASSIGNED'				=> 'Роль ще не призначено.',

	'SELECTED_FORUM_NOT_EXIST'		=> 'Обраного(-их) форуму(-ів) не існує.',
	'SELECTED_GROUP_NOT_EXIST'		=> 'Обраної(-их) групи(-груп) не існує.',
	'SELECTED_USER_NOT_EXIST'		=> 'Обраного(-их) користувача(-ів) не існує.',
	'SELECT_FORUM_SUBFORUM_EXPLAIN'	=> 'Обраний тут форум включить у вибір усі підфоруми.',
	'SELECT_ROLE'					=> 'Оберіть роль…',
	'SELECT_TYPE'					=> 'Оберіть тип',
	'SET_PERMISSIONS'				=> 'Встановити права',
	'SET_ROLE_PERMISSIONS'			=> 'Встановити права ролі',
	'SET_USERS_PERMISSIONS'			=> 'Встановити права користувача',
	'SET_USERS_FORUM_PERMISSIONS'	=> 'Встановити права форуму для користувача',

	'TRACE_DEFAULT'					=> 'За замовчуванням кожне право має значення <strong>НІ</strong> (не встановлено). Тому право може бути перезаписане іншими налаштуваннями.',
	'TRACE_FOR'						=> 'Трасування для',
	'TRACE_GLOBAL_SETTING'			=> '%s (загальне)',
	'TRACE_GROUP_NEVER_TOTAL_NEVER'	=> 'Право цієї групи встановлено на <strong>НІКОЛИ</strong>, як і загальний результат, тому старий результат зберігається.',
	'TRACE_GROUP_NEVER_TOTAL_NEVER_LOCAL'	=> 'Право цієї групи для цього форуму встановлено на <strong>НІКОЛИ</strong>, як і загальний результат, тому старий результат зберігається.',
	'TRACE_GROUP_NEVER_TOTAL_NO'	=> 'Право цієї групи встановлено на <strong>НІКОЛИ</strong>, що стає новим загальним значенням, оскільки його ще не було встановлено (значення <strong>НІ</strong>).',
	'TRACE_GROUP_NEVER_TOTAL_NO_LOCAL'	=> 'Право цієї групи для цього форуму встановлено на <strong>НІКОЛИ</strong>, що стає новим загальним значенням, оскільки його ще не було встановлено (значення <strong>НІ</strong>).',
	'TRACE_GROUP_NEVER_TOTAL_YES'	=> 'Право цієї групи встановлено на <strong>НІКОЛИ</strong>, що перезаписує загальне значення <strong>ТАК</strong> на <strong>НІКОЛИ</strong> для цього користувача.',
	'TRACE_GROUP_NEVER_TOTAL_YES_LOCAL'	=> 'Право цієї групи для цього форуму встановлено на <strong>НІКОЛИ</strong>, що перезаписує загальне значення <strong>ТАК</strong> на <strong>НІКОЛИ</strong> для цього користувача.',
	'TRACE_GROUP_NO'				=> 'Право для цієї групи має значення <strong>НІ</strong>, тому зберігається старе загальне значення.',
	'TRACE_GROUP_NO_LOCAL'			=> 'Право для цієї групи в межах цього форуму має значення <strong>НІ</strong>, тому зберігається старе загальне значення.',
	'TRACE_GROUP_YES_TOTAL_NEVER'	=> 'Право цієї групи встановлено на <strong>ТАК</strong>, але загальне значення <strong>НІКОЛИ</strong> неможливо перезаписати.',
	'TRACE_GROUP_YES_TOTAL_NEVER_LOCAL'	=> 'Право цієї групи для цього форуму встановлено на <strong>ТАК</strong>, але загальне значення <strong>НІКОЛИ</strong> неможливо перезаписати.',
	'TRACE_GROUP_YES_TOTAL_NO'		=> 'Право цієї групи встановлено на <strong>ТАК</strong>, що стає новим загальним значенням, оскільки його ще не було встановлено (значення <strong>НІ</strong>).',
	'TRACE_GROUP_YES_TOTAL_NO_LOCAL'	=> 'Право цієї групи для цього форуму встановлено на <strong>ТАК</strong>, що стає новим загальним значенням, оскільки його ще не було встановлено (значення <strong>НІ</strong>).',
	'TRACE_GROUP_YES_TOTAL_YES'		=> 'Право цієї групи встановлено на <strong>ТАК</strong>, а загальне право вже встановлено на <strong>ТАК</strong>, тому загальний результат зберігається.',
	'TRACE_GROUP_YES_TOTAL_YES_LOCAL'	=> 'Право цієї групи для цього форуму встановлено на <strong>ТАК</strong>, а загальне право вже встановлено на <strong>ТАК</strong>, тому загальний результат зберігається.',
	'TRACE_PERMISSION'				=> 'Трасування права — %s',
	'TRACE_RESULT'					=> 'Результат трасування',
	'TRACE_SETTING'					=> 'Налаштування трасування',

	'TRACE_USER_GLOBAL_YES_TOTAL_YES'		=> 'Незалежне від форуму право користувача обчислюється як <strong>ТАК</strong>, але загальне право вже встановлено на <strong>ТАК</strong>, тому загальний результат зберігається. %sТрасування загального права%s',
	'TRACE_USER_GLOBAL_YES_TOTAL_NEVER'		=> 'Незалежне від форуму право користувача обчислюється як <strong>ТАК</strong>, що перезаписує поточний локальний результат <strong>НІКОЛИ</strong>. %sТрасування загального права%s',
	'TRACE_USER_GLOBAL_NEVER_TOTAL_KEPT'	=> 'Незалежне від форуму право користувача обчислюється як <strong>НІКОЛИ</strong>, що не впливає на локальне право. %sТрасування загального права%s',

	'TRACE_USER_FOUNDER'					=> 'Користувач є засновником, тому права адміністратора завжди встановлено на <strong>ТАК</strong>.',
	'TRACE_USER_KEPT'						=> 'Право користувача — <strong>НІ</strong>, тому зберігається старе загальне значення.',
	'TRACE_USER_KEPT_LOCAL'					=> 'Право користувача для цього форуму — <strong>НІ</strong>, тому зберігається старе загальне значення.',
	'TRACE_USER_NEVER_TOTAL_NEVER'			=> 'Право користувача встановлено на <strong>НІКОЛИ</strong>, а загальне значення встановлено на <strong>НІКОЛИ</strong>, тому нічого не змінюється.',
	'TRACE_USER_NEVER_TOTAL_NEVER_LOCAL'	=> 'Право користувача для цього форуму встановлено на <strong>НІКОЛИ</strong>, а загальне значення встановлено на <strong>НІКОЛИ</strong>, тому нічого не змінюється.',
	'TRACE_USER_NEVER_TOTAL_NO'				=> 'Право користувача встановлено на <strong>НІКОЛИ</strong>, що стає загальним значенням, оскільки воно було встановлено на НІ.',
	'TRACE_USER_NEVER_TOTAL_NO_LOCAL'		=> 'Право користувача для цього форуму встановлено на <strong>НІКОЛИ</strong>, що стає загальним значенням, оскільки воно було встановлено на НІ.',
	'TRACE_USER_NEVER_TOTAL_YES'			=> 'Право користувача встановлено на <strong>НІКОЛИ</strong> і перезаписує попереднє значення <strong>ТАК</strong>.',
	'TRACE_USER_NEVER_TOTAL_YES_LOCAL'		=> 'Право користувача для цього форуму встановлено на <strong>НІКОЛИ</strong> і перезаписує попереднє значення <strong>ТАК</strong>.',
	'TRACE_USER_NO_TOTAL_NO'				=> 'Право користувача — <strong>НІ</strong>, а загальне значення було встановлено на НІ, тому за замовчуванням застосовується <strong>НІКОЛИ</strong>.',
	'TRACE_USER_NO_TOTAL_NO_LOCAL'			=> 'Право користувача для цього форуму — <strong>НІ</strong>, а загальне значення було встановлено на НІ, тому за замовчуванням застосовується <strong>НІКОЛИ</strong>.',
	'TRACE_USER_YES_TOTAL_NEVER'			=> 'Право користувача встановлено на <strong>ТАК</strong>, але загальне значення <strong>НІКОЛИ</strong> неможливо перезаписати.',
	'TRACE_USER_YES_TOTAL_NEVER_LOCAL'		=> 'Право користувача для цього форуму встановлено на <strong>ТАК</strong>, але загальне значення <strong>НІКОЛИ</strong> неможливо перезаписати.',
	'TRACE_USER_YES_TOTAL_NO'				=> 'Право користувача встановлено на <strong>ТАК</strong>, що стає загальним значенням, оскільки воно було встановлено на <strong>НІ</strong>.',
	'TRACE_USER_YES_TOTAL_NO_LOCAL'			=> 'Право користувача для цього форуму встановлено на <strong>ТАК</strong>, що стає загальним значенням, оскільки воно було встановлено на <strong>НІ</strong>.',
	'TRACE_USER_YES_TOTAL_YES'				=> 'Право користувача встановлено на <strong>ТАК</strong>, а загальне значення встановлено на <strong>ТАК</strong>, тому нічого не змінюється.',
	'TRACE_USER_YES_TOTAL_YES_LOCAL'		=> 'Право користувача для цього форуму встановлено на <strong>ТАК</strong>, а загальне значення встановлено на <strong>ТАК</strong>, тому нічого не змінюється.',
	'TRACE_WHO'								=> 'Хто',
	'TRACE_TOTAL'							=> 'Загалом',

	'USERS_NOT_ASSIGNED'			=> 'Жодного користувача не призначено цій ролі',
	'USER_IS_MEMBER_OF_DEFAULT'		=> 'є учасником наступних наперед визначених груп',
	'USER_IS_MEMBER_OF_CUSTOM'		=> 'є учасником наступних визначених користувачем груп',

	'VIEW_ASSIGNED_ITEMS'	=> 'Переглянути призначені елементи',
	'VIEW_LOCAL_PERMS'		=> 'Локальні права',
	'VIEW_GLOBAL_PERMS'		=> 'Загальні права',
	'VIEW_PERMISSIONS'		=> 'Переглянути права',

	'WRONG_PERMISSION_TYPE'				=> 'Обрано неправильний тип прав.',
	'WRONG_PERMISSION_SETTING_FORMAT'	=> 'Налаштування прав мають неправильний формат, phpBB не може коректно їх обробити.',
));
