<?php
/**
*
* This file is part of the Ukrainian Language Pack
* for the phpBB Forum Software.
*
* @copyright (c) 2026 Magnum <https://magnumblog.space>
* @license GNU General Public License, version 2 (GPL-2.0)
*
* Ukrainian translation by Magnum (magnumblog.space)
*
*/

/**
* DO NOT CHANGE
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine

// BBCodes
// Note to translators: you can translate everything but what's between { and }
$lang = array_merge($lang, array(
	'ACP_BBCODES_EXPLAIN'		=> 'BBCode — це особлива реалізація HTML, що надає більший контроль над тим, що і як показується. На цій сторінці ви можете додавати, видаляти й редагувати користувацькі BBCode.',
	'ADD_BBCODE'				=> 'Додати новий BBCode',

	'BBCODE_DANGER'				=> 'BBCode, який ви намагаєтеся додати, здається небезпечним. Якщо BBCode використовує токен {TEXT} у чутливому контексті, спробуйте натомість використати більш обмежувальний тип. Продовжуйте, лише якщо розумієте пов’язані ризики.',
	'BBCODE_DANGER_PROCEED'		=> 'Продовжити', //'I understand the risk',

	'BBCODE_ADDED'				=> 'BBCode успішно додано.',
	'BBCODE_EDITED'				=> 'BBCode успішно відредаговано.',
	'BBCODE_DELETED'			=> 'BBCode успішно видалено.',
	'BBCODE_NOT_EXIST'			=> 'Обраного вами BBCode не існує.',
	'BBCODE_HELPLINE'			=> 'Рядок підказки',
	'BBCODE_HELPLINE_EXPLAIN'	=> 'Це поле містить текст, що з’являється при наведенні миші на BBCode.',
	'BBCODE_HELPLINE_TEXT'		=> 'Текст рядка підказки',
	'BBCODE_HELPLINE_TOO_LONG'	=> 'Введений вами рядок підказки задовгий.',

	'BBCODE_INVALID_TAG_NAME'	=> 'Обрана вами назва тегу BBCode вже існує.',
	'BBCODE_INVALID'			=> 'Ваш BBCode побудовано в неприпустимій формі.',
	'BBCODE_INVALID_TEMPLATE'	=> 'Шаблон вашого BBCode недійсний.',
	'BBCODE_TAG'				=> 'Тег',
	'BBCODE_TAG_TOO_LONG'		=> 'Обрана вами назва тегу задовга.',
	'BBCODE_TAG_DEF_TOO_LONG'	=> 'Введене вами визначення тегу задовге, будь ласка, скоротіть його.',
	'BBCODE_USAGE'				=> 'Використання BBCode',
	'BBCODE_USAGE_EXAMPLE'		=> '[highlight={COLOR}]{TEXT}[/highlight]<br /><br />[font={SIMPLETEXT1}]{SIMPLETEXT2}[/font]',
	'BBCODE_USAGE_EXPLAIN'		=> 'Тут ви визначаєте, як використовувати BBCode. Замініть будь-яке змінне введення відповідним токеном (%sдив. нижче%s).',

	'EXAMPLE'						=> 'Приклад:',
	'EXAMPLES'						=> 'Приклади:',

	'HTML_REPLACEMENT'				=> 'Заміна HTML',
	'HTML_REPLACEMENT_EXAMPLE'		=> '&lt;span style="background-color: {COLOR};"&gt;{TEXT}&lt;/span&gt;<br /><br />&lt;span style="font-family: {SIMPLETEXT1};"&gt;{SIMPLETEXT2}&lt;/span&gt;',
	'HTML_REPLACEMENT_EXPLAIN'		=> 'Тут ви визначаєте заміну HTML за замовчуванням. Не забудьте повернути токени, які ви використали вище!',

	'TOKEN'					=> 'Токен',
	'TOKENS'				=> 'Токени',
	'TOKENS_EXPLAIN'		=> 'Токени — це заповнювачі для введення користувача. Введення буде перевірено, лише якщо воно відповідає відповідному визначенню. За потреби ви можете нумерувати їх, додавши число як останній символ між фігурними дужками, напр. {TEXT1}, {TEXT2}.<br /><br />У межах заміни HTML ви також можете використовувати будь-який мовний рядок, наявний у вашій теці language/, так: {L_<em>&lt;НАЗВА_РЯДКА&gt;</em>}, де <em>&lt;НАЗВА_РЯДКА&gt;</em> — це назва перекладеного рядка, який ви бажаєте додати. Наприклад, {L_WROTE} буде показано як «написав(-ла)» або його переклад відповідно до локалі користувача.<br /><br /><strong>Зверніть увагу, лише токени, перелічені нижче, можна використовувати в користувацьких BBCode.</strong>',
	'TOKEN_DEFINITION'		=> 'Чим це може бути?',
	'TOO_MANY_BBCODES'		=> 'Ви не можете створити більше BBCode. Будь ласка, видаліть один чи кілька BBCode і спробуйте ще раз.',

	'tokens'	=>	array(
		'TEXT'			=> 'Будь-який текст, включно з іноземними символами, цифрами тощо…',
		'SIMPLETEXT'	=> 'Символи з латинського алфавіту (A-Z), цифри, пробіли, коми, крапки, мінус, плюс, дефіс та підкреслення',
		'INTTEXT'		=> 'Символи літер Unicode, цифри, пробіли, коми, крапки, мінус, плюс, дефіс, підкреслення та пробільні символи.',
		'IDENTIFIER'	=> 'Символи з латинського алфавіту (A-Z), цифри, дефіс та підкреслення',
		'NUMBER'		=> 'Будь-яка послідовність цифр',
		'EMAIL'			=> 'Дійсна email-адреса',
		'URL'			=> 'Дійсна URL-адреса з використанням будь-якого дозволеного протоколу (http, ftp тощо… не може використовуватися для javascript-експлойтів). Якщо жодного не вказано, до рядка додається префікс «http://».',
		'LOCAL_URL'		=> 'Локальна URL-адреса. URL-адреса має бути відносною до сторінки теми і не може містити ім’я сервера чи протокол, оскільки посилання мають префікс «%s»',
		'RELATIVE_URL'	=> 'Відносна URL-адреса. Ви можете використовувати це для збігу частин URL-адреси, але будьте обережні: повна URL-адреса є дійсною відносною URL-адресою. Якщо ви бажаєте використовувати відносні URL-адреси вашого форуму, використовуйте токен LOCAL_URL.',
		'COLOR'			=> 'Колір HTML, може бути в числовій формі <samp>#FF1234</samp> або <a href="http://www.w3.org/TR/CSS21/syndata.html#value-def-color">ключовим словом кольору CSS</a>, наприклад <samp>fuchsia</samp> чи <samp>InactiveBorder</samp>',
		'ALNUM'			=> 'Символи з латинського алфавіту (A-Z) та цифри.',
		'CHOICE'		=> 'Вибір із вказаних значень, напр. <samp>{CHOICE=spades,hearts,diamonds,clubs}</samp>. Значення за замовчуванням розглядаються без урахування регістру та можуть розглядатися з урахуванням регістру, якщо вказано параметр <samp>caseSensitive</samp>: <samp>{CHOICE=Spades,Hearts,Diamonds,Clubs;caseSensitive}</samp>',
		'FLOAT'			=> 'Десяткове значення, напр. <samp>0.5</samp>.',
		'HASHMAP'		=> 'Зіставляє рядки з їхньою заміною у формі <samp>{HASHMAP=рядок1:заміна1,рядок2:заміна2}</samp>. З урахуванням регістру. За замовчуванням зберігає невідомі значення.',
		'INT'			=> 'Ціле значення, напр. <samp>2</samp>.',
		'IP'			=> 'Дійсна адреса IPv4 чи IPv6.',
		'IPPORT'		=> 'Дійсна адреса IPv4 чи IPv6 з номером порту.',
		'IPV4'			=> 'Дійсна адреса IPv4.',
		'IPV6'			=> 'Дійсна адреса IPv6.',
		'MAP'			=> 'Зіставляє рядки з їхньою заміною у формі <samp>{MAP=рядок1:заміна1,рядок2:заміна2}</samp>. Без урахування регістру. За замовчуванням зберігає невідомі значення.',
		'RANGE'			=> 'Приймає ціле число у вказаному діапазоні, напр. <samp>{RANGE=-10,42}</samp>.',
		'REGEXP'		=> 'Перевіряє своє значення за вказаним regexp, напр. <samp>{REGEXP=/^foo\w+bar$/}</samp>.',
		'TIMESTAMP'		=> 'Часова мітка, наприклад <samp>1h30m10s</samp>, яку буде перетворено на кількість секунд. Також приймає число.',
		'UINT'			=> 'Беззнакове ціле значення. Те саме, що й <samp>{INT}</samp>, але відхиляє значення менші за 0.',
 	),
));

// Smilies and topic icons
$lang = array_merge($lang, array(
	'ACP_ICONS_EXPLAIN'		=> 'На цій сторінці ви можете додавати, видаляти й редагувати значки, які користувачі можуть додавати до своїх тем чи повідомлень. Ці значки зазвичай показуються поруч із назвами тем у списку форуму або темами повідомлень у списках тем. Ви також можете встановлювати та створювати нові пакети значків.',
	'ACP_SMILIES_EXPLAIN'	=> 'Смайли, або емотикони, — це зазвичай маленькі, іноді анімовані зображення, що використовуються для передачі емоції чи почуття. На цій сторінці ви можете додавати, видаляти й редагувати емотикони, які користувачі можуть використовувати у своїх повідомленнях і особистих повідомленнях. Ви також можете встановлювати та створювати нові пакети смайлів.',
	'ADD_SMILIES'			=> 'Додати кілька смайлів',
	'ADD_SMILEY_CODE'		=> 'Додати додатковий код смайла',
	'ADD_ICONS'				=> 'Додати кілька значків',
	'AFTER_ICONS'			=> 'Після %s',
	'AFTER_SMILIES'			=> 'Після %s',

	'CODE'						=> 'Код',
	'CURRENT_ICONS'				=> 'Поточні значки',
	'CURRENT_ICONS_EXPLAIN'		=> 'Оберіть, що робити з наразі встановленими значками.',
	'CURRENT_SMILIES'			=> 'Поточні смайли',
	'CURRENT_SMILIES_EXPLAIN'	=> 'Оберіть, що робити з наразі встановленими смайлами.',

	'DISPLAY_ON_POSTING'		=> 'Показувати на сторінці публікації',
	'DISPLAY_POSTING'			=> 'На сторінці публікації',
	'DISPLAY_POSTING_NO'		=> 'Не на сторінці публікації',

	'EDIT_ICONS'				=> 'Редагувати значки',
	'EDIT_SMILIES'				=> 'Редагувати смайли',
	'EMOTION'					=> 'Емоція',
	'EXPORT_ICONS'				=> 'Експортувати та завантажити icons.pak',
	'EXPORT_ICONS_EXPLAIN'		=> '%sПри натисканні на це посилання конфігурацію ваших встановлених значків буде запаковано у <samp>icons.pak</samp>, який після завантаження можна використати для створення файлу <samp>.zip</samp> чи <samp>.tgz</samp>, що міститиме всі ваші значки плюс цей файл конфігурації <samp>icons.pak</samp>%s.',
	'EXPORT_SMILIES'			=> 'Експортувати та завантажити smilies.pak',
	'EXPORT_SMILIES_EXPLAIN'	=> '%sПри натисканні на це посилання конфігурацію ваших встановлених смайлів буде запаковано у <samp>smilies.pak</samp>, який після завантаження можна використати для створення файлу <samp>.zip</samp> чи <samp>.tgz</samp>, що міститиме всі ваші смайли плюс цей файл конфігурації <samp>smilies.pak</samp>%s.',

	'FIRST'			=> 'Перший',

	'ICONS_ADD'				=> 'Додати новий значок',
	'ICONS_ADDED'			=> array(
		0	=> 'Жодного значка не додано.',
		1	=> 'Значок успішно додано.',
		2	=> 'Значки успішно додано.',
	),
	'ICONS_CONFIG'			=> 'Конфігурація значка',
	'ICONS_DELETED'			=> 'Значок успішно видалено.',
	'ICONS_EDIT'			=> 'Редагувати значок',
	'ICONS_EDITED'			=> array(
		0	=> 'Жодного значка не оновлено.',
		1	=> 'Значок успішно оновлено.',
		2	=> 'Значки успішно оновлено.',
	),
	'ICONS_HEIGHT'			=> 'Висота значка',
	'ICONS_IMAGE'			=> 'Зображення значка',
	'ICONS_IMPORTED'		=> 'Пакет значків успішно встановлено.',
	'ICONS_IMPORT_SUCCESS'	=> 'Пакет значків успішно імпортовано.',
	'ICONS_LOCATION'		=> 'Розташування значка',
	'ICONS_NOT_DISPLAYED'	=> 'Наступні значки не показуються на сторінці публікації',
	'ICONS_ORDER'			=> 'Порядок значків',
	'ICONS_URL'				=> 'Файл зображення значка',
	'ICONS_WIDTH'			=> 'Ширина значка',
	'IMPORT_ICONS'			=> 'Встановити пакет значків',
	'IMPORT_SMILIES'		=> 'Встановити пакет смайлів',

	'KEEP_ALL'			=> 'Зберегти всі',

	'MASS_ADD_SMILIES'	=> 'Додати кілька смайлів',

	'NO_ICONS_ADD'		=> 'Немає доступних значків для додавання.',
	'NO_ICONS_EDIT'		=> 'Немає доступних значків для зміни.',
	'NO_ICONS_EXPORT'	=> 'У вас немає значків, з яких можна створити пакет.',
	'NO_ICONS_PAK'		=> 'Пакетів значків не знайдено.',
	'NO_SMILIES_ADD'	=> 'Немає доступних смайлів для додавання.',
	'NO_SMILIES_EDIT'	=> 'Немає доступних смайлів для зміни.',
	'NO_SMILIES_EXPORT'	=> 'У вас немає смайлів, з яких можна створити пакет.',
	'NO_SMILIES_PAK'	=> 'Пакетів смайлів не знайдено.',

	'PAK_FILE_NOT_READABLE'		=> 'Не вдалося прочитати файл <samp>.pak</samp>.',

	'REPLACE_MATCHES'	=> 'Замінити збіги',

	'SELECT_PACKAGE'			=> 'Оберіть файл пакета',
	'SMILIES_ADD'				=> 'Додати новий смайл',
	'SMILIES_ADDED'				=> array(
		0	=> 'Жодного смайла не додано.',
		1	=> 'Смайл успішно додано.',
		2	=> 'Смайли успішно додано.',
	),
	'SMILIES_CODE'				=> 'Код смайла',
	'SMILIES_CONFIG'			=> 'Конфігурація смайла',
	'SMILIES_DELETED'			=> 'Смайл успішно видалено.',
	'SMILIES_EDIT'				=> 'Редагувати смайл',
	'SMILIE_NO_CODE'			=> 'Смайл «%s» проігноровано, оскільки не введено код.',
	'SMILIE_NO_EMOTION'			=> 'Смайл «%s» проігноровано, оскільки не введено емоцію.',
	'SMILIE_NO_FILE'			=> 'Смайл «%s» проігноровано, оскільки файл відсутній.',
	'SMILIES_EDITED'			=> array(
		0	=> 'Жодного смайла не оновлено.',
		1	=> 'Смайл успішно оновлено.',
		2	=> 'Смайли успішно оновлено.',
	),
	'SMILIES_EMOTION'			=> 'Емоція',
	'SMILIES_HEIGHT'			=> 'Висота смайла',
	'SMILIES_IMAGE'				=> 'Зображення смайла',
	'SMILIES_IMPORTED'			=> 'Пакет смайлів успішно встановлено.',
	'SMILIES_IMPORT_SUCCESS'	=> 'Пакет смайлів успішно імпортовано.',
	'SMILIES_LOCATION'			=> 'Розташування смайла',
	'SMILIES_NOT_DISPLAYED'		=> 'Наступні смайли не показуються на сторінці публікації',
	'SMILIES_ORDER'				=> 'Порядок смайлів',
	'SMILIES_URL'				=> 'Файл зображення смайла',
	'SMILIES_WIDTH'				=> 'Ширина смайла',

	'TOO_MANY_SMILIES'			=> array(
		1	=> 'Досягнуто ліміт у %d смайл.',
		2	=> 'Досягнуто ліміт у %d смайли.',
	),

	'WRONG_PAK_TYPE'	=> 'Вказаний пакет не містить відповідних даних.',
));

// Word censors
$lang = array_merge($lang, array(
	'ACP_WORDS_EXPLAIN'		=> 'У цій панелі керування ви можете додавати, редагувати й видаляти слова, які будуть автоматично цензуровані на ваших форумах. Людям все ще дозволено реєструватися з іменами користувачів, що містять ці слова. У полі слова допускаються символи підстановки (*), напр. *test* збігатиметься з detestable, test* збігатиметься з testing, *test збігатиметься з detest.',
	'ADD_WORD'				=> 'Додати нове слово',

	'EDIT_WORD'		=> 'Редагувати цензуроване слово',
	'ENTER_WORD'	=> 'Вам потрібно ввести слово та його заміну.',

	'NO_WORD'	=> 'Слово для редагування не обрано.',

	'REPLACEMENT'	=> 'Заміна',

	'UPDATE_WORD'	=> 'Оновити цензуроване слово',

	'WORD'				=> 'Слово',
	'WORD_ADDED'		=> 'Цензуроване слово успішно додано.',
	'WORD_REMOVED'		=> 'Обране цензуроване слово успішно видалено.',
	'WORD_UPDATED'		=> 'Обране цензуроване слово успішно оновлено.',
));

// Ranks
$lang = array_merge($lang, array(
	'ACP_RANKS_EXPLAIN'		=> 'За допомогою цієї форми ви можете додавати, редагувати, переглядати й видаляти звання. Ви також можете створювати спеціальні звання, які можна застосувати до користувача через інструмент керування користувачами.',
	'ADD_RANK'				=> 'Додати нове звання',

	'MUST_SELECT_RANK'		=> 'Вам потрібно обрати звання.',

	'NO_ASSIGNED_RANK'		=> 'Спеціальне звання не призначено.',
	'NO_RANK_TITLE'			=> 'Ви не вказали назву для цього звання.',
	'NO_UPDATE_RANKS'		=> 'Звання успішно видалено. Однак облікові записи користувачів, які використовували це звання, не було оновлено. Вам потрібно буде вручну скинути звання для цих облікових записів.',

	'RANK_ADDED'			=> 'Звання успішно додано.',
	'RANK_IMAGE'			=> 'Зображення звання',
	'RANK_IMAGE_EXPLAIN'	=> 'Використовуйте це, щоб визначити невелике зображення, пов’язане зі званням. Шлях відносний до кореневої теки phpBB.',
	'RANK_IMAGE_IN_USE'		=> '(Використовується)',
	'RANK_MINIMUM'			=> 'Мінімум повідомлень',
	'RANK_REMOVED'			=> 'Звання успішно видалено.',
	'RANK_SPECIAL'			=> 'Встановити як спеціальне звання',
	'RANK_TITLE'			=> 'Назва звання',
	'RANK_UPDATED'			=> 'Звання успішно оновлено.',
));

// Disallow Usernames
$lang = array_merge($lang, array(
	'ACP_DISALLOW_EXPLAIN'	=> 'Тут ви можете керувати іменами користувачів, які буде заборонено використовувати. Заборонені імена користувачів можуть містити символ підстановки *.',
	'ADD_DISALLOW_EXPLAIN'	=> 'Ви можете заборонити ім’я користувача, використовуючи символ підстановки *, щоб відповідати будь-якому символу.',
	'ADD_DISALLOW_TITLE'	=> 'Додати заборонене ім’я користувача',

	'DELETE_DISALLOW_EXPLAIN'	=> 'Ви можете видалити заборонене ім’я користувача, обравши ім’я користувача з цього списку та натиснувши кнопку надсилання.',
	'DELETE_DISALLOW_TITLE'		=> 'Видалити заборонене ім’я користувача',
	'DISALLOWED_ALREADY'		=> 'Введене вами ім’я вже заборонено.',
	'DISALLOWED_DELETED'		=> 'Заборонене ім’я користувача успішно видалено.',
	'DISALLOW_SUCCESSFUL'		=> 'Заборонене ім’я користувача успішно додано.',

	'NO_DISALLOWED'				=> 'Заборонених імен користувачів немає',
	'NO_USERNAME_SPECIFIED'		=> 'Ви не обрали чи не ввели ім’я користувача для виконання дії.',
));

// Reasons
$lang = array_merge($lang, array(
	'ACP_REASONS_EXPLAIN'	=> 'Тут ви можете керувати причинами, що використовуються в скаргах і повідомленнях про відхилення при відхиленні повідомлень. Є одна причина за замовчуванням (позначена *), яку ви не можете видалити, ця причина зазвичай використовується для власних повідомлень, якщо жодна причина не підходить.',
	'ADD_NEW_REASON'		=> 'Додати нову причину',
	'AVAILABLE_TITLES'		=> 'Доступні локалізовані назви причин',

	'IS_NOT_TRANSLATED'			=> 'Причину <strong>не</strong> локалізовано.',
	'IS_NOT_TRANSLATED_EXPLAIN'	=> 'Причину <strong>не</strong> локалізовано. Якщо ви бажаєте надати локалізовану форму, вкажіть правильний ключ з розділу причин скарг мовних файлів.',
	'IS_TRANSLATED'				=> 'Причину локалізовано.',
	'IS_TRANSLATED_EXPLAIN'		=> 'Причину локалізовано. Якщо назва, яку ви тут вводите, вказана в розділі причин скарг мовних файлів, буде використано локалізовану форму назви та опису.',

	'NO_REASON'					=> 'Причину не знайдено.',
	'NO_REASON_INFO'			=> 'Вам потрібно вказати назву й опис для цієї причини.',
	'NO_REMOVE_DEFAULT_REASON'	=> 'Ви не можете видалити причину за замовчуванням «Інше».',

	'REASON_ADD'				=> 'Додати причину скарги/відхилення',
	'REASON_ADDED'				=> 'Причину скарги/відхилення успішно додано.',
	'REASON_ALREADY_EXIST'		=> 'Причина з такою назвою вже існує, будь ласка, введіть іншу назву для цієї причини.',
	'REASON_DESCRIPTION'		=> 'Опис причини',
	'REASON_DESC_TRANSLATED'	=> 'Показуваний опис причини',
	'REASON_EDIT'				=> 'Редагувати причину скарги/відхилення',
	'REASON_EDIT_EXPLAIN'		=> 'Тут ви можете додати чи редагувати причину. Якщо причину перекладено, замість введеного тут опису використовується локалізована версія.',
	'REASON_REMOVED'			=> 'Причину скарги/відхилення успішно видалено.',
	'REASON_TITLE'				=> 'Назва причини',
	'REASON_TITLE_TRANSLATED'	=> 'Показувана назва причини',
	'REASON_UPDATED'			=> 'Причину скарги/відхилення успішно оновлено.',

	'USED_IN_REPORTS'		=> 'Використовується у скаргах',
));
