<?php
/**
*
* This file is part of the Ukrainian Language Pack
* for the phpBB Forum Software.
*
* @copyright (c) 2026 Magnum <https://magnumblog.space>
* @license GNU General Public License, version 2 (GPL-2.0)
*
* Ukrainian translation by Magnum (magnumblog.space)
*
*/

/**
* DO NOT CHANGE
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine

// Custom profile fields
$lang = array_merge($lang, array(
	'ADDED_PROFILE_FIELD'	=> 'Користувацьке поле профілю успішно додано.',
	'ALPHA_DOTS'			=> 'Літери, цифри та крапки',
	'ALPHA_ONLY'			=> 'Лише літери та цифри',
	'ALPHA_SPACERS'			=> 'Літери, цифри та роздільники',
	'ALPHA_UNDERSCORE'		=> 'Літери, цифри та підкреслення',
	'ALPHA_PUNCTUATION'		=> 'Літери, цифри, кома, крапки, підкреслення й дефіси, починаючи з літери',
	'ALWAYS_TODAY'			=> 'Завжди поточна дата',

	'BOOL_ENTRIES_EXPLAIN'	=> 'Введіть ваші варіанти зараз',
	'BOOL_TYPE_EXPLAIN'		=> 'Визначте тип: прапорець або перемикачі. Прапорець буде показано лише якщо він позначений для конкретного користувача. У такому разі буде використано <strong>другий</strong> мовний варіант. Перемикачі показуватимуться незалежно від значення.',

	'CHANGED_PROFILE_FIELD'		=> 'Поле профілю успішно змінено.',
	'CHARS_ANY'					=> 'Будь-який символ',
	'CHECKBOX'					=> 'Прапорець',
	'COLUMNS'					=> 'Стовпці',
	'CP_LANG_DEFAULT_VALUE'		=> 'Значення за замовчуванням',
	'CP_LANG_EXPLAIN'			=> 'Опис поля',
	'CP_LANG_EXPLAIN_EXPLAIN'	=> 'Пояснення до цього поля, показане користувачу.',
	'CP_LANG_NAME'				=> 'Назва/заголовок поля, показані користувачу',
	'CP_LANG_OPTIONS'			=> 'Варіанти',
	'CREATE_NEW_FIELD'			=> 'Створити нове поле',
	'CUSTOM_FIELDS_NOT_TRANSLATED'	=> 'Щонайменше одне користувацьке поле профілю ще не перекладено. Будь ласка, введіть необхідну інформацію, натиснувши посилання «Перекласти».',

	'DEFAULT_ISO_LANGUAGE'			=> 'Мова за замовчуванням [%s]',
	'DEFAULT_LANGUAGE_NOT_FILLED'	=> 'Мовні записи для мови за замовчуванням не заповнено для цього поля профілю.',
	'DEFAULT_VALUE'					=> 'Значення за замовчуванням',
	'DELETE_PROFILE_FIELD'			=> 'Видалити поле профілю',
	'DELETE_PROFILE_FIELD_CONFIRM'	=> 'Ви впевнені, що бажаєте видалити це поле профілю?',
	'DISPLAY_AT_PROFILE'			=> 'Показувати в панелі керування користувача',
	'DISPLAY_AT_PROFILE_EXPLAIN'	=> 'Користувач може змінити це поле профілю в панелі керування користувача.',
	'DISPLAY_AT_REGISTER'			=> 'Показувати на екрані реєстрації',
	'DISPLAY_AT_REGISTER_EXPLAIN'	=> 'Якщо цей параметр увімкнено, поле буде показано під час реєстрації.',
	'DISPLAY_ON_MEMBERLIST'			=> 'Показувати на екрані списку учасників',
	'DISPLAY_ON_MEMBERLIST_EXPLAIN'	=> 'Якщо цей параметр увімкнено, поле буде показано в рядках користувачів на екрані списку учасників.',
	'DISPLAY_ON_PM'					=> 'Показувати на екрані перегляду особистого повідомлення',
	'DISPLAY_ON_PM_EXPLAIN'			=> 'Якщо цей параметр увімкнено, поле буде показано в міні-профілі на екрані особистого повідомлення.',
	'DISPLAY_ON_VT'					=> 'Показувати на екрані перегляду теми',
	'DISPLAY_ON_VT_EXPLAIN'			=> 'Якщо цей параметр увімкнено, поле буде показано в міні-профілі на екрані теми.',
	'DISPLAY_PROFILE_FIELD'			=> 'Показувати поле профілю публічно',
	'DISPLAY_PROFILE_FIELD_EXPLAIN'	=> 'Поле профілю буде показано в усіх дозволених місцях відповідно до налаштувань завантаження. Встановлення «ні» сховає поле зі сторінок тем, профілів і списку учасників.',
	'DROPDOWN_ENTRIES_EXPLAIN'		=> 'Введіть ваші варіанти зараз, кожен варіант в окремому рядку.',

	'EDIT_DROPDOWN_LANG_EXPLAIN'	=> 'Зверніть увагу, ви можете змінювати текст своїх варіантів, а також додавати нові варіанти в кінець. Не рекомендується додавати нові варіанти між наявними — це може призвести до неправильного призначення варіантів вашим користувачам. Це також може статися, якщо ви видалите варіанти посередині. Видалення варіантів з кінця призведе до того, що користувачам, які мали призначений цей елемент, буде повернуто значення за замовчуванням.',
	'EMPTY_FIELD_IDENT'				=> 'Порожня ідентифікація поля',
	'EMPTY_USER_FIELD_NAME'			=> 'Будь ласка, введіть назву/заголовок поля',
	'ENTRIES'						=> 'Записи',
	'EVERYTHING_OK'					=> 'Все гаразд',

	'FIELD_BOOL'				=> 'Булеве (так/ні)',
	'FIELD_CONTACT_DESC'		=> 'Опис контакту',
	'FIELD_CONTACT_URL'			=> 'Посилання контакту',
	'FIELD_DATE'				=> 'Дата',
	'FIELD_DESCRIPTION'			=> 'Опис поля',
	'FIELD_DESCRIPTION_EXPLAIN'	=> 'Пояснення до цього поля, показане користувачу.',
	'FIELD_DROPDOWN'			=> 'Випадний список',
	'FIELD_IDENT'				=> 'Ідентифікація поля',
	'FIELD_IDENT_ALREADY_EXIST'	=> 'Обрана ідентифікація поля вже існує. Будь ласка, оберіть іншу назву.',
	'FIELD_IDENT_EXPLAIN'		=> 'Ідентифікація поля — це назва для ідентифікації поля профілю в базі даних і шаблонах.',
	'FIELD_INT'					=> 'Числа',
	'FIELD_IS_CONTACT'			=> 'Показувати поле як контактне поле',
	'FIELD_IS_CONTACT_EXPLAIN'	=> 'Контактні поля показуються в розділі контактів профілю користувача та по-іншому відображаються в міні-профілі поруч з повідомленнями й особистими повідомленнями. Ви можете використовувати <samp>%s</samp> як змінну-заповнювач, яку буде замінено значенням, наданим користувачем.',
	'FIELD_LENGTH'				=> 'Довжина поля вводу',
	'FIELD_NOT_FOUND'			=> 'Поле профілю не знайдено.',
	'FIELD_STRING'				=> 'Однорядкове текстове поле',
	'FIELD_TEXT'				=> 'Текстова область',
	'FIELD_TYPE'				=> 'Тип поля',
	'FIELD_TYPE_EXPLAIN'		=> 'Ви не зможете змінити тип поля пізніше.',
	'FIELD_URL'					=> 'URL (посилання)',
	'FIELD_VALIDATION'			=> 'Перевірка поля',
	'FIRST_OPTION'				=> 'Перший варіант',

	'HIDE_PROFILE_FIELD'			=> 'Сховати поле профілю',
	'HIDE_PROFILE_FIELD_EXPLAIN'	=> 'Сховати поле профілю від усіх користувачів, окрім адміністраторів і модераторів, які все ще можуть бачити це поле. Якщо параметр «Показувати в панелі керування користувача» вимкнено, користувач не зможе бачити чи змінювати це поле, і його зможуть змінювати лише адміністратори.',

	'INVALID_CHARS_FIELD_IDENT'	=> 'Ідентифікація поля може містити лише малі літери a-z та _',
	'INVALID_FIELD_IDENT_LEN'	=> 'Довжина ідентифікації поля може становити лише 17 символів',
	'ISO_LANGUAGE'				=> 'Мова [%s]',

	'LANG_SPECIFIC_OPTIONS'		=> 'Мовно-специфічні варіанти [<strong>%s</strong>]',

	'LETTER_NUM_DOTS'			=> 'Будь-які літери, цифри та крапки',
	'LETTER_NUM_ONLY'			=> 'Будь-які літери та цифри',
	'LETTER_NUM_PUNCTUATION'	=> 'Будь-які літери, цифри, кома, крапки та дефіси, починаючи з будь-якої літери',
	'LETTER_NUM_SPACERS'		=> 'Будь-які літери, цифри та роздільники',
	'LETTER_NUM_UNDERSCORE'		=> 'Будь-які літери, цифри та підкреслення',

	'MAX_FIELD_CHARS'		=> 'Максимальна кількість символів',
	'MAX_FIELD_NUMBER'		=> 'Найбільше дозволене число',
	'MIN_FIELD_CHARS'		=> 'Мінімальна кількість символів',
	'MIN_FIELD_NUMBER'		=> 'Найменше дозволене число',

	'NO_FIELD_ENTRIES'			=> 'Записів не визначено',
	'NO_FIELD_ID'				=> 'ID поля не вказано.',
	'NO_FIELD_TYPE'				=> 'Тип поля не вказано.',
	'NO_VALUE_OPTION'			=> 'Варіант, що дорівнює невведеному значенню',
	'NO_VALUE_OPTION_EXPLAIN'	=> 'Значення для невведеного варіанту. Якщо поле обов’язкове, користувач отримає помилку, якщо обере вказаний тут варіант.',
	'NUMBERS_ONLY'				=> 'Лише цифри (0-9)',

	'PROFILE_BASIC_OPTIONS'		=> 'Базові параметри',
	'PROFILE_FIELD_ACTIVATED'	=> 'Поле профілю успішно активовано.',
	'PROFILE_FIELD_DEACTIVATED'	=> 'Поле профілю успішно деактивовано.',
	'PROFILE_LANG_OPTIONS'		=> 'Мовно-специфічні варіанти',
	'PROFILE_TYPE_OPTIONS'		=> 'Параметри, специфічні для типу профілю',

	'RADIO_BUTTONS'				=> 'Перемикачі',
	'REMOVED_PROFILE_FIELD'		=> 'Поле профілю успішно видалено.',
	'REQUIRED_FIELD'			=> 'Обов’язкове поле',
	'REQUIRED_FIELD_EXPLAIN'	=> 'Примусово вимагати заповнення чи вказання поля профілю користувачем або адміністратором. Якщо параметр показу на екрані реєстрації вимкнено, поле буде обов’язковим лише коли користувач редагує свій профіль.',
	'ROWS'						=> 'Рядки',

	'SAVE'							=> 'Зберегти',
	'SECOND_OPTION'					=> 'Другий варіант',
	'SHOW_NOVALUE_FIELD'			=> 'Показувати поле, якщо значення не обрано',
	'SHOW_NOVALUE_FIELD_EXPLAIN'	=> 'Визначає, чи слід показувати поле профілю, якщо для необов’язкових полів значення не обрано або якщо для обов’язкових полів значення ще не обрано.',
	'STEP_1_EXPLAIN_CREATE'			=> 'Тут ви можете ввести перші базові параметри вашого нового поля профілю. Ця інформація потрібна для другого кроку, на якому ви зможете встановити решту параметрів і додатково налаштувати ваше поле профілю.',
	'STEP_1_EXPLAIN_EDIT'			=> 'Тут ви можете змінити базові параметри вашого поля профілю. Відповідні параметри буде перераховано на другому кроці.',
	'STEP_1_TITLE_CREATE'			=> 'Додати поле профілю',
	'STEP_1_TITLE_EDIT'				=> 'Редагувати поле профілю',
	'STEP_2_EXPLAIN_CREATE'			=> 'Тут ви можете визначити деякі загальні параметри, які, можливо, забажаєте налаштувати.',
	'STEP_2_EXPLAIN_EDIT'			=> 'Тут ви можете змінити деякі загальні параметри.<br /><strong>Зверніть увагу, зміни в полях профілю не впливатимуть на наявні дані профілю, введені вашими користувачами.</strong>',
	'STEP_2_TITLE_CREATE'			=> 'Параметри, специфічні для типу профілю',
	'STEP_2_TITLE_EDIT'				=> 'Параметри, специфічні для типу профілю',
	'STEP_3_EXPLAIN_CREATE'			=> 'Оскільки у вас встановлено більше однієї мови форуму, вам також потрібно заповнити решту мовних елементів. Якщо ви цього не зробите, для цього користувацького поля профілю буде використано налаштування мови за замовчуванням, ви також зможете заповнити решту мовних елементів пізніше.',
	'STEP_3_EXPLAIN_EDIT'			=> 'Оскільки у вас встановлено більше однієї мови форуму, тепер ви також можете змінити чи додати решту мовних елементів. Якщо ви цього не зробите, для цього користувацького поля профілю буде використано налаштування мови за замовчуванням.',
	'STEP_3_TITLE_CREATE'			=> 'Решта мовних визначень',
	'STEP_3_TITLE_EDIT'				=> 'Мовні визначення',
	'STRING_DEFAULT_VALUE_EXPLAIN'	=> 'Введіть фразу за замовчуванням для показу, значення за замовчуванням. Залиште порожнім, якщо бажаєте спочатку показувати поле порожнім.',

	'TEXT_DEFAULT_VALUE_EXPLAIN'	=> 'Введіть текст за замовчуванням для показу, значення за замовчуванням. Залиште порожнім, якщо бажаєте спочатку показувати поле порожнім.',
	'TRANSLATE'						=> 'Перекласти',

	'USER_FIELD_NAME'	=> 'Назва/заголовок поля, показані користувачу',

	'VISIBILITY_OPTION'				=> 'Параметри видимості',
));
