<?php
/**
*
* This file is part of the Ukrainian Language Pack
* for the phpBB Forum Software.
*
* @copyright (c) 2026 Magnum <https://magnumblog.space>
* @license GNU General Public License, version 2 (GPL-2.0)
*
* Ukrainian translation by Magnum (magnumblog.space)
*
*/

/**
* DO NOT CHANGE
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine

$lang = array_merge($lang, array(
	'ACP_SEARCH_INDEX_EXPLAIN'				=> 'Тут ви можете керувати індексами пошукового бекенду. Оскільки зазвичай використовується лише один бекенд, вам слід видалити всі індекси, якими ви не користуєтеся. Після зміни деяких налаштувань пошуку (напр. мінімальної/максимальної кількості символів) варто перестворити індекс, щоб він відображав ці зміни.',
	'ACP_SEARCH_SETTINGS_EXPLAIN'			=> 'Тут ви можете визначити, який пошуковий бекенд буде використовуватися для індексації повідомлень і виконання пошуку. Ви можете встановити різні параметри, що впливають на те, скільки обробки вимагають ці дії. Деякі з цих налаштувань однакові для всіх пошукових бекендів.',

	'COMMON_WORD_THRESHOLD'					=> 'Поріг поширеного слова',
	'COMMON_WORD_THRESHOLD_EXPLAIN'			=> 'Слова, які містяться в більшому відсотку всіх повідомлень, вважатимуться поширеними. Поширені слова ігноруються в пошукових запитах. Встановіть нуль, щоб вимкнути. Діє лише якщо повідомлень більше 100. Якщо ви бажаєте, щоб слова, які наразі вважаються поширеними, були переглянуті знову, вам потрібно перестворити індекс.',
	'CONFIRM_SEARCH_BACKEND'				=> 'Ви впевнені, що бажаєте перейти на інший пошуковий бекенд? Після зміни пошукового бекенду вам потрібно буде створити індекс для нового бекенду. Якщо ви не плануєте повертатися до старого пошукового бекенду, ви також можете видалити індекс старого бекенду, щоб звільнити системні ресурси.',
	'CONTINUE_DELETING_INDEX'				=> 'Продовжити попередній процес видалення індексу',
	'CONTINUE_DELETING_INDEX_EXPLAIN'		=> 'Розпочато процес видалення індексу. Щоб отримати доступ до сторінки пошукового індексу, вам потрібно завершити або скасувати цей процес.',
	'CONTINUE_INDEXING'						=> 'Продовжити попередній процес індексації',
	'CONTINUE_INDEXING_EXPLAIN'				=> 'Розпочато процес індексації. Щоб отримати доступ до сторінки пошукового індексу, вам потрібно завершити або скасувати цей процес.',
	'CREATE_INDEX'							=> 'Створити індекс',

	'DEFAULT_SEARCH_RETURN_CHARS'			=> 'Кількість символів у результатах за замовчуванням',
	'DEFAULT_SEARCH_RETURN_CHARS_EXPLAIN'	=> 'Кількість символів, що повертатимуться за замовчуванням під час пошуку. Значення 0 поверне повне повідомлення.',
	'DELETE_INDEX'							=> 'Видалити індекс',
	'DELETING_INDEX_IN_PROGRESS'			=> 'Видалення індексу триває…',
	'DELETING_INDEX_IN_PROGRESS_EXPLAIN'	=> 'Пошуковий бекенд наразі очищує свій індекс. Це може зайняти кілька хвилин.',

	'FULLTEXT_MYSQL_INCOMPATIBLE_DATABASE'	=> 'Повнотекстовий бекенд MySQL можна використовувати лише з MySQL4 і новішими версіями.',
	'FULLTEXT_MYSQL_NOT_SUPPORTED'			=> 'Повнотекстові індекси MySQL можна використовувати лише з таблицями MyISAM чи InnoDB. Для повнотекстових індексів у таблицях InnoDB потрібен MySQL 5.6.8 або новіший.',
	'FULLTEXT_MYSQL_TOTAL_POSTS'			=> 'Загальна кількість проіндексованих повідомлень',
	'FULLTEXT_MYSQL_MIN_SEARCH_CHARS_EXPLAIN'	=> 'Слова з щонайменше такою кількістю символів будуть проіндексовані для пошуку. Ви або ваш хостинг-провайдер можете змінити це налаштування лише через зміну конфігурації mysql.',
	'FULLTEXT_MYSQL_MAX_SEARCH_CHARS_EXPLAIN'	=> 'Слова з не більше ніж такою кількістю символів будуть проіндексовані для пошуку. Ви або ваш хостинг-провайдер можете змінити це налаштування лише через зміну конфігурації mysql.',

	'FULLTEXT_POSTGRES_INCOMPATIBLE_DATABASE'	=> 'Повнотекстовий бекенд PostgreSQL можна використовувати лише з PostgreSQL.',
	'FULLTEXT_POSTGRES_TOTAL_POSTS'			=> 'Загальна кількість проіндексованих повідомлень',
	'FULLTEXT_POSTGRES_VERSION_CHECK'		=> 'Версія PostgreSQL',
	'FULLTEXT_POSTGRES_TS_NAME'				=> 'Профіль конфігурації текстового пошуку:',
	'FULLTEXT_POSTGRES_MIN_WORD_LEN'			=> 'Мінімальна довжина слова для ключових слів',
	'FULLTEXT_POSTGRES_MAX_WORD_LEN'			=> 'Максимальна довжина слова для ключових слів',
	'FULLTEXT_POSTGRES_VERSION_CHECK_EXPLAIN'		=> 'Цей пошуковий бекенд вимагає PostgreSQL версії 8.3 і новішої.',
	'FULLTEXT_POSTGRES_TS_NAME_EXPLAIN'				=> 'Профіль конфігурації текстового пошуку, що використовується для визначення парсера та словника.',
	'FULLTEXT_POSTGRES_MIN_WORD_LEN_EXPLAIN'			=> 'Слова з щонайменше такою кількістю символів будуть включені в запит до бази даних.',
	'FULLTEXT_POSTGRES_MAX_WORD_LEN_EXPLAIN'			=> 'Слова з не більше ніж такою кількістю символів будуть включені в запит до бази даних.',

	'FULLTEXT_SPHINX_CONFIGURE'				=> 'Налаштуйте наступні параметри для генерації файлу конфігурації sphinx',
	'FULLTEXT_SPHINX_DATA_PATH'				=> 'Шлях до теки даних',
	'FULLTEXT_SPHINX_DATA_PATH_EXPLAIN'		=> 'Використовуватиметься для зберігання індексів і файлів журналу. Вам слід створити цю теку поза межами тек, доступних через веб. (має закінчуватися скісною рискою)',
	'FULLTEXT_SPHINX_DELTA_POSTS'			=> 'Кількість повідомлень у часто оновлюваному дельта-індексі',
	'FULLTEXT_SPHINX_HOST'					=> 'Хост демона пошуку sphinx',
	'FULLTEXT_SPHINX_HOST_EXPLAIN'			=> 'Хост, на якому прослуховує демон пошуку sphinx (searchd). Залиште порожнім для використання localhost за замовчуванням',
	'FULLTEXT_SPHINX_INDEXER_MEM_LIMIT'		=> 'Обмеження пам’яті індексатора',
	'FULLTEXT_SPHINX_INDEXER_MEM_LIMIT_EXPLAIN'	=> 'Це число має завжди бути меншим за доступну на вашому сервері оперативну пам’ять. Якщо у вас виникають періодичні проблеми з продуктивністю, це може бути через те, що індексатор споживає забагато ресурсів. Може допомогти зменшення обсягу пам’яті, доступного індексатору.',
	'FULLTEXT_SPHINX_MAIN_POSTS'			=> 'Кількість повідомлень в основному індексі',
	'FULLTEXT_SPHINX_PORT'					=> 'Порт демона пошуку sphinx',
	'FULLTEXT_SPHINX_PORT_EXPLAIN'			=> 'Порт, на якому прослуховує демон пошуку sphinx (searchd). Залиште порожнім для використання порту API Sphinx за замовчуванням 9312',
	'FULLTEXT_SPHINX_WRONG_DATABASE'		=> 'Пошук sphinx для phpBB підтримує лише MySQL і PostgreSQL.',
	'FULLTEXT_SPHINX_CONFIG_FILE'			=> 'Файл конфігурації sphinx',
	'FULLTEXT_SPHINX_CONFIG_FILE_EXPLAIN'	=> 'Згенерований вміст файлу конфігурації sphinx. Ці дані потрібно вставити у sphinx.conf, який використовується демоном пошуку sphinx. Замініть заповнювачі [dbuser] і [dbpassword] вашими даними доступу до бази даних.',
	'FULLTEXT_SPHINX_NO_CONFIG_DATA'		=> 'Шлях до теки даних sphinx не визначено. Будь ласка, визначте шлях і надішліть форму, щоб згенерувати файл конфігурації.',

	'GENERAL_SEARCH_SETTINGS'				=> 'Загальні налаштування пошуку',
	'GO_TO_SEARCH_INDEX'					=> 'Перейти до сторінки пошукового індексу',

	'INDEX_STATS'							=> 'Статистика індексу',
	'INDEXING_IN_PROGRESS'					=> 'Індексація триває…',
	'INDEXING_IN_PROGRESS_EXPLAIN'			=> 'Пошуковий бекенд наразі індексує всі повідомлення на форумі. Це може зайняти від кількох хвилин до кількох годин залежно від розміру вашого форуму.',

	'LIMIT_SEARCH_LOAD'						=> 'Обмеження навантаження системи для сторінки пошуку',
	'LIMIT_SEARCH_LOAD_EXPLAIN'				=> 'Якщо навантаження системи за 1 хвилину перевищує це значення, сторінка пошуку стане недоступною, 1.0 дорівнює ~100% використання одного процесора. Це працює лише на серверах на основі UNIX.',

	'MAX_SEARCH_CHARS'						=> 'Макс. символів, що індексуються пошуком',
	'MAX_SEARCH_CHARS_EXPLAIN'				=> 'Слова з не більше ніж такою кількістю символів будуть проіндексовані для пошуку.',
	'MAX_NUM_SEARCH_KEYWORDS'				=> 'Максимальна кількість дозволених ключових слів',
	'MAX_NUM_SEARCH_KEYWORDS_EXPLAIN'		=> 'Максимальна кількість слів, які користувач може шукати. Значення 0 дозволяє необмежену кількість слів.',
	'MIN_SEARCH_CHARS'						=> 'Мін. символів, що індексуються пошуком',
	'MIN_SEARCH_CHARS_EXPLAIN'				=> 'Слова з щонайменше такою кількістю символів будуть проіндексовані для пошуку.',
	'MIN_SEARCH_AUTHOR_CHARS'				=> 'Мін. символів імені автора',
	'MIN_SEARCH_AUTHOR_CHARS_EXPLAIN'		=> 'Користувачам потрібно вводити щонайменше стільки символів імені під час пошуку автора з символом підстановки. Якщо ім’я користувача автора коротше цього числа, ви все ще можете шукати повідомлення автора, ввівши повне ім’я користувача.',

	'PROGRESS_BAR'							=> 'Індикатор прогресу',

	'SEARCH_GUEST_INTERVAL'					=> 'Інтервал обмеження пошуку для гостей',
	'SEARCH_GUEST_INTERVAL_EXPLAIN'			=> 'Кількість секунд, які гості мають чекати між пошуками. Якщо один гість шукає, всі інші мають чекати, доки не мине цей інтервал часу.',
	'SEARCH_INDEX_CREATE_REDIRECT'			=> array(
		2	=> 'Всі повідомлення до ID повідомлення %2$d проіндексовано, з них %1$d повідомлень оброблено на цьому кроці.',
	),
	'SEARCH_INDEX_CREATE_REDIRECT_RATE'		=> array(
		2	=> 'Поточна швидкість індексації становить приблизно %1$.1f повідомлень за секунду.',
	),
	'SEARCH_INDEX_DELETE_REDIRECT'			=> array(
		2	=> 'Всі повідомлення до ID повідомлення %2$d видалено з пошукового індексу, з них %1$d повідомлень оброблено на цьому кроці.',
	),
	'SEARCH_INDEX_DELETE_REDIRECT_RATE'		=> array(
		2	=> 'Поточна швидкість видалення становить приблизно %1$.1f повідомлень за секунду.',
	),
	'SEARCH_INDEX_CREATED'					=> 'Всі повідомлення в базі даних форуму успішно проіндексовано.',
	'SEARCH_INDEX_PROGRESS'					=> 'Готово: %1$d | Очікує: %2$d | Всього: %3$d',
	'SEARCH_INDEX_REMOVED'					=> 'Пошуковий індекс для цього бекенду успішно видалено.',
	'SEARCH_INTERVAL'						=> 'Інтервал обмеження пошуку для користувачів',
	'SEARCH_INTERVAL_EXPLAIN'				=> 'Кількість секунд, які користувачі мають чекати між пошуками. Цей інтервал перевіряється незалежно для кожного користувача.',
	'SEARCH_STORE_RESULTS'					=> 'Тривалість кешу результатів пошуку',
	'SEARCH_STORE_RESULTS_EXPLAIN'			=> 'Кешовані результати пошуку закінчуватимуться через цей час у секундах. Встановіть 0, якщо бажаєте вимкнути кеш пошуку.',
	'SEARCH_TYPE'							=> 'Пошуковий бекенд',
	'SEARCH_TYPE_EXPLAIN'					=> 'phpBB дозволяє обрати бекенд, що використовується для пошуку тексту у вмісті повідомлень. За замовчуванням пошук використовуватиме власний повнотекстовий пошук phpBB.',
	'SWITCHED_SEARCH_BACKEND'				=> 'Ви перейшли на інший пошуковий бекенд. Щоб використовувати новий пошуковий бекенд, вам слід переконатися, що для обраного вами бекенду існує індекс.',

	'TOTAL_WORDS'							=> 'Загальна кількість проіндексованих слів',
	'TOTAL_MATCHES'							=> 'Загальна кількість проіндексованих зв’язків слово-повідомлення',

	'YES_SEARCH'							=> 'Увімкнути функції пошуку',
	'YES_SEARCH_EXPLAIN'					=> 'Вмикає функціонал пошуку для користувачів, включно з пошуком учасників.',
	'YES_SEARCH_UPDATE'						=> 'Увімкнути оновлення повнотекстового індексу',
	'YES_SEARCH_UPDATE_EXPLAIN'				=> 'Оновлення повнотекстових індексів під час публікації, перевизначається, якщо пошук вимкнено.',
));
