<?php
/**
 *
 * This file is part of the Ukrainian Language Pack
 * for the phpBB Forum Software.
 *
 * @copyright (c) 2026 Magnum <https://magnumblog.space>
 * @license GNU General Public License, version 2 (GPL-2.0)
 *
 * Ukrainian translation by Magnum (magnumblog.space)
 *
 */

/**
 * DO NOT CHANGE
 */
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine

// Common installer pages
$lang = array_merge($lang, array(
	'INSTALL_PANEL'	=> 'Панель встановлення',
	'SELECT_LANG'	=> 'Оберіть мову',

	'STAGE_INSTALL'	=> 'Встановлення phpBB',

	// Introduction page
	'INTRODUCTION_TITLE'	=> 'Вступ',
	'INTRODUCTION_BODY'		=> 'Ласкаво просимо до phpBB3!<br /><br />phpBB® — найпоширеніше у світі рішення для форумів з відкритим кодом. phpBB3 — це останнє покоління лінійки, започаткованої у 2000 році. Як і його попередники, phpBB3 багатий на функції, зручний у користуванні та повністю підтримується командою phpBB. phpBB3 значно покращує все те, що зробило phpBB2 популярним, і додає часто затребувані функції, яких не було в попередніх версіях. Сподіваємося, він перевершить ваші очікування.<br /><br />Ця система встановлення проведе вас через процес встановлення phpBB3, оновлення до останньої версії phpBB3 з попередніх випусків, а також конвертації до phpBB3 з іншої системи форумів (включно з phpBB2). Для отримання додаткової інформації радимо прочитати <a href="%1$s">посібник зі встановлення</a>.<br /><br />Щоб прочитати ліцензію phpBB3 або дізнатися про отримання підтримки та нашу позицію щодо неї, будь ласка, оберіть відповідні пункти в бічному меню. Щоб продовжити, оберіть відповідну вкладку вище.',

	// Support page
	'SUPPORT_TITLE'		=> 'Підтримка',
	'SUPPORT_BODY'		=> 'Повна підтримка надається безкоштовно для поточного стабільного випуску phpBB3. Це включає:</p><ul><li>встановлення</li><li>налаштування</li><li>технічні питання</li><li>проблеми, пов’язані з можливими помилками в програмному забезпеченні</li><li>оновлення з версій Release Candidate (RC) до останньої стабільної версії</li><li>конвертацію з phpBB 2.0.x до phpBB3</li><li>конвертацію з іншого програмного забезпечення форумів до phpBB3 (див. <a href="https://www.phpbb.com/community/viewforum.php?f=486">форум конвертерів</a>)</li></ul><p>Ми рекомендуємо користувачам, які досі використовують бета-версії phpBB3, замінити своє встановлення на свіжу копію останньої версії.</p><h2>Розширення / Стилі</h2><p>З питань, пов’язаних з розширеннями, будь ласка, публікуйте повідомлення у відповідному <a href="https://www.phpbb.com/community/viewforum.php?f=451">форумі розширень</a>.<br />З питань, пов’язаних зі стилями, шаблонами та темами, будь ласка, публікуйте повідомлення у відповідному <a href="https://www.phpbb.com/community/viewforum.php?f=471">форумі стилів</a>.<br /><br />Якщо ваше питання стосується конкретного пакета, будь ласка, публікуйте повідомлення безпосередньо в темі, присвяченій цьому пакету.</p><h2>Отримання підтримки</h2><p><a href="https://www.phpbb.com/support/">Розділ підтримки</a><br /><a href="https://www.phpbb.com/support/docs/en/3.2/ug/quickstart/">Посібник швидкого старту</a><br /><br />Щоб бути в курсі останніх новин і випусків, слідкуйте за нами в <a href="https://www.twitter.com/phpbb/">Twitter</a> та <a href="https://www.facebook.com/phpbb/">Facebook</a><br /><br />',

	// License
	'LICENSE_TITLE'		=> 'Загальна публічна ліцензія',

	// Install page
	'INSTALL_INTRO'			=> 'Ласкаво просимо до встановлення',
	'INSTALL_INTRO_BODY'	=> 'За допомогою цього варіанту можна встановити phpBB3 на ваш сервер.</p><p>Щоб продовжити, вам знадобляться налаштування бази даних. Якщо ви не знаєте налаштувань своєї бази даних, будь ласка, зверніться до вашого хостинг-провайдера та запитайте їх. Без цих даних ви не зможете продовжити. Вам потрібні:</p>

	<ul>
		<li>Тип бази даних — база даних, яку ви будете використовувати.</li>
		<li>Ім’я хосту сервера бази даних або DSN — адреса сервера бази даних.</li>
		<li>Порт сервера бази даних — порт сервера бази даних (здебільшого це не потрібно).</li>
		<li>Назва бази даних — назва бази даних на сервері.</li>
		<li>Ім’я користувача та пароль бази даних — дані для входу для доступу до бази даних.</li>
	</ul>

	<p><strong>Примітка:</strong> якщо ви встановлюєте за допомогою SQLite, вам слід ввести повний шлях до файлу бази даних у полі DSN і залишити поля імені користувача та пароля порожніми. З міркувань безпеки переконайтеся, що файл бази даних не зберігається в місці, доступному через веб.</p>

	<p>phpBB3 підтримує наступні бази даних:</p>
	<ul>
		<li>MySQL 4.1.3 або новіше (потрібен MySQLi)</li>
		<li>PostgreSQL 8.3+</li>
		<li>SQLite 3.6.15+</li>
		<li>MS SQL Server 2000 або новіше (напряму або через ODBC)</li>
		<li>MS SQL Server 2005 або новіше (нативно)</li>
		<li>Oracle</li>
	</ul>

	<p>Показані будуть лише ті бази даних, які підтримуються на вашому сервері.',

	'ACP_LINK'	=> 'Перейти до <a href="%1$s">ПА</a>',

	'INSTALL_PHPBB_INSTALLED'		=> 'phpBB вже встановлено.',
	'INSTALL_PHPBB_NOT_INSTALLED'	=> 'phpBB ще не встановлено.',
	'INSTALL_RESTART'				=> 'Перезапустити встановлення',
));

// Requirements translation
$lang = array_merge($lang, array(
	// Filesystem requirements
	'FILE_NOT_EXISTS'						=> 'Файл не існує',
	'FILE_NOT_EXISTS_EXPLAIN'				=> 'Щоб мати змогу встановити phpBB, файл %1$s має існувати.',
	'FILE_NOT_EXISTS_EXPLAIN_OPTIONAL'		=> 'Рекомендується, щоб файл %1$s існував для кращого досвіду користувачів форуму.',
	'FILE_NOT_WRITABLE'						=> 'Файл недоступний для запису',
	'FILE_NOT_WRITABLE_EXPLAIN'				=> 'Щоб мати змогу встановити phpBB, файл %1$s має бути доступним для запису.',
	'FILE_NOT_WRITABLE_EXPLAIN_OPTIONAL'	=> 'Рекомендується, щоб файл %1$s був доступним для запису для кращого досвіду користувачів форуму.',

	'DIRECTORY_NOT_EXISTS'						=> 'Тека не існує',
	'DIRECTORY_NOT_EXISTS_EXPLAIN'				=> 'Щоб мати змогу встановити phpBB, тека %1$s має існувати.',
	'DIRECTORY_NOT_EXISTS_EXPLAIN_OPTIONAL'		=> 'Рекомендується, щоб тека %1$s існувала для кращого досвіду користувачів форуму.',
	'DIRECTORY_NOT_WRITABLE'					=> 'Тека недоступна для запису',
	'DIRECTORY_NOT_WRITABLE_EXPLAIN'			=> 'Щоб мати змогу встановити phpBB, тека %1$s має бути доступною для запису.',
	'DIRECTORY_NOT_WRITABLE_EXPLAIN_OPTIONAL'	=> 'Рекомендується, щоб тека %1$s була доступною для запису для кращого досвіду користувачів форуму.',

	// Server requirements
	'PHP_VERSION_REQD'					=> 'Версія PHP',
	'PHP_VERSION_REQD_EXPLAIN'			=> 'phpBB вимагає PHP версії 7.2.0 або новішої.',
	'PHP_GETIMAGESIZE_SUPPORT'			=> 'Потрібна функція PHP getimagesize()',
	'PHP_GETIMAGESIZE_SUPPORT_EXPLAIN'	=> 'Щоб phpBB працював коректно, функція getimagesize має бути доступна.',
	'PCRE_UTF_SUPPORT'					=> 'Підтримка PCRE UTF-8',
	'PCRE_UTF_SUPPORT_EXPLAIN'			=> 'phpBB не запуститься, якщо ваше встановлення PHP скомпільовано без підтримки UTF-8 у розширенні PCRE.',
	'PHP_JSON_SUPPORT'					=> 'Підтримка PHP JSON',
	'PHP_JSON_SUPPORT_EXPLAIN'			=> 'Щоб phpBB працював коректно, розширення PHP JSON має бути доступне.',
	'PHP_MBSTRING_SUPPORT'				=> 'Підтримка PHP mbstring',
	'PHP_MBSTRING_SUPPORT_EXPLAIN'		=> 'Щоб phpBB працював коректно, розширення PHP mbstring має бути доступне.',
	'PHP_XML_SUPPORT'					=> 'Підтримка PHP XML/DOM',
	'PHP_XML_SUPPORT_EXPLAIN'			=> 'Щоб phpBB працював коректно, розширення PHP XML/DOM має бути доступне.',
	'PHP_SUPPORTED_DB'					=> 'Підтримувані бази даних',
	'PHP_SUPPORTED_DB_EXPLAIN'			=> 'У вас має бути підтримка щонайменше однієї сумісної бази даних у PHP. Якщо жоден модуль бази даних не показано як доступний, зверніться до вашого хостинг-провайдера або перегляньте відповідну документацію зі встановлення PHP.',

	'RETEST_REQUIREMENTS'	=> 'Повторно перевірити вимоги',

	'STAGE_REQUIREMENTS'	=> 'Перевірка вимог',
));

// General error messages
$lang = array_merge($lang, array(
	'INST_ERR_MISSING_DATA'		=> 'Вам потрібно заповнити всі поля в цьому блоці.',

	'TIMEOUT_DETECTED_TITLE'	=> 'Встановлювач виявив перевищення часу очікування',
	'TIMEOUT_DETECTED_MESSAGE'	=> 'Встановлювач виявив перевищення часу очікування, ви можете спробувати оновити сторінку, що може призвести до пошкодження даних. Радимо або збільшити налаштування часу очікування, або спробувати використати CLI.',
));

// Data obtaining translations
$lang = array_merge($lang, array(
	'STAGE_OBTAIN_DATA'	=> 'Встановлення даних установки',

	//
	// Admin data
	//
	'STAGE_ADMINISTRATOR'	=> 'Дані адміністратора',

	// Form labels
	'ADMIN_CONFIG'				=> 'Налаштування адміністратора',
	'ADMIN_PASSWORD'			=> 'Пароль адміністратора',
	'ADMIN_PASSWORD_CONFIRM'	=> 'Підтвердіть пароль адміністратора',
	'ADMIN_PASSWORD_EXPLAIN'	=> 'Будь ласка, введіть пароль довжиною від 6 до 30 символів.',
	'ADMIN_USERNAME'			=> 'Ім’я користувача адміністратора',
	'ADMIN_USERNAME_EXPLAIN'	=> 'Будь ласка, введіть ім’я користувача довжиною від 3 до 20 символів.',

	// Errors
	'INST_ERR_EMAIL_INVALID'		=> 'Введена вами email-адреса недійсна.',
	'INST_ERR_PASSWORD_MISMATCH'	=> 'Введені вами паролі не збігаються.',
	'INST_ERR_PASSWORD_TOO_LONG'	=> 'Введений вами пароль задовгий. Максимальна довжина — 30 символів.',
	'INST_ERR_PASSWORD_TOO_SHORT'	=> 'Введений вами пароль закороткий. Мінімальна довжина — 6 символів.',
	'INST_ERR_USER_TOO_LONG'		=> 'Введене вами ім’я користувача задовге. Максимальна довжина — 20 символів.',
	'INST_ERR_USER_TOO_SHORT'		=> 'Введене вами ім’я користувача закоротке. Мінімальна довжина — 3 символи.',

	//
	// Board data
	//
	// Form labels
	'BOARD_CONFIG'		=> 'Налаштування форуму',
	'DEFAULT_LANGUAGE'	=> 'Мова за замовчуванням',
	'BOARD_NAME'		=> 'Назва форуму',
	'BOARD_DESCRIPTION'	=> 'Короткий опис форуму',

	//
	// Database data
	//
	'STAGE_DATABASE'	=> 'Налаштування бази даних',

	// Form labels
	'DB_CONFIG'				=> 'Налаштування бази даних',
	'DBMS'					=> 'Тип бази даних',
	'DB_HOST'				=> 'Ім’я хосту сервера бази даних або DSN',
	'DB_HOST_EXPLAIN'		=> 'DSN означає Data Source Name і стосується лише встановлень ODBC. У PostgreSQL використовуйте localhost для з’єднання з локальним сервером через UNIX-сокет і 127.0.0.1 для з’єднання через TCP. Для SQLite введіть повний шлях до файлу бази даних.',
	'DB_PORT'				=> 'Порт сервера бази даних',
	'DB_PORT_EXPLAIN'		=> 'Залиште порожнім, якщо ви не впевнені, що сервер працює на нестандартному порту.',
	'DB_PASSWORD'			=> 'Пароль бази даних',
	'DB_NAME'				=> 'Назва бази даних',
	'DB_USERNAME'			=> 'Ім’я користувача бази даних',
	'DATABASE_VERSION'		=> 'Версія бази даних',
	'TABLE_PREFIX'			=> 'Префікс таблиць у базі даних',
	'TABLE_PREFIX_EXPLAIN'	=> 'Префікс має починатися з літери й містити лише літери, цифри та підкреслення.',

	// Database options
	'DB_OPTION_MSSQL_ODBC'	=> 'MSSQL Server 2000+ через ODBC',
	'DB_OPTION_MSSQLNATIVE'	=> 'MSSQL Server 2005+ [ Нативно ]',
	'DB_OPTION_MYSQLI'		=> 'MySQL з розширенням MySQLi',
	'DB_OPTION_ORACLE'		=> 'Oracle',
	'DB_OPTION_POSTGRES'	=> 'PostgreSQL',
	'DB_OPTION_SQLITE3'		=> 'SQLite 3',

	// Errors
	'INST_ERR_DB'					=> 'Помилка встановлення бази даних',
	'INST_ERR_NO_DB'				=> 'Не вдалося завантажити модуль PHP для обраного типу бази даних.',
	'INST_ERR_DB_INVALID_PREFIX'	=> 'Введений вами префікс недійсний. Він має починатися з літери й містити лише літери, цифри та підкреслення.',
	'INST_ERR_PREFIX_TOO_LONG'		=> 'Вказаний вами префікс таблиці задовгий. Максимальна довжина — %d символів.',
	'INST_ERR_DB_NO_NAME'			=> 'Назву бази даних не вказано.',
	'INST_ERR_DB_FORUM_PATH'		=> 'Вказаний файл бази даних знаходиться в дереві теки вашого форуму. Вам слід розмістити цей файл у місці, недоступному з веб.',
	'INST_ERR_DB_CONNECT'			=> 'Не вдалося з’єднатися з базою даних, див. повідомлення про помилку нижче.',
	'INST_ERR_DB_NO_WRITABLE'		=> 'І база даних, і тека, що її містить, мають бути доступними для запису.',
	'INST_ERR_DB_NO_ERROR'			=> 'Повідомлення про помилку не надано.',
	'INST_ERR_PREFIX'				=> 'Таблиці з вказаним префіксом вже існують, будь ласка, оберіть інший.',
	'INST_ERR_DB_NO_MYSQLI'			=> 'Версія MySQL, встановлена на цьому сервері, несумісна з обраним вами варіантом «MySQL з розширенням MySQLi». Будь ласка, спробуйте варіант «MySQL».',
	'INST_ERR_DB_NO_SQLITE3'		=> 'Встановлена вами версія розширення SQLite застаріла, її потрібно оновити щонайменше до 3.6.15.',
	'INST_ERR_DB_NO_ORACLE'			=> 'Версія Oracle, встановлена на цьому сервері, вимагає встановити параметр <var>NLS_CHARACTERSET</var> на <var>UTF8</var>. Оновіть встановлення до 9.2+ або змініть цей параметр.',
	'INST_ERR_DB_NO_POSTGRES'		=> 'Обрана вами база даних не була створена в кодуванні <var>UNICODE</var> чи <var>UTF8</var>. Спробуйте встановити з базою даних у кодуванні <var>UNICODE</var> чи <var>UTF8</var>.',
	'INST_SCHEMA_FILE_NOT_WRITABLE'	=> 'Файл схеми недоступний для запису',

	//
	// Email data
	//
	'EMAIL_CONFIG'	=> 'Налаштування email',

	// Package info
	'PACKAGE_VERSION'					=> 'Встановлена версія пакета',
	'UPDATE_INCOMPLETE'				=> 'Ваше встановлення phpBB оновлено некоректно.',
	'UPDATE_INCOMPLETE_MORE'		=> 'Будь ласка, прочитайте інформацію нижче, щоб виправити цю помилку.',
	'UPDATE_INCOMPLETE_EXPLAIN'		=> '<h1>Неповне оновлення</h1>

		<p>Ми помітили, що останнє оновлення вашого встановлення phpBB не було завершено. Відвідайте <a href="%1$s" title="%1$s">засіб оновлення бази даних</a>, переконайтеся, що обрано <em>Оновити лише базу даних</em>, і натисніть <strong>Надіслати</strong>. Не забудьте видалити теку "install" після успішного оновлення бази даних.</p>',

	//
	// Server data
	//
	// Form labels
	'UPGRADE_INSTRUCTIONS'			=> 'Доступний новий випуск з функціями <strong>%1$s</strong>. Будь ласка, прочитайте <a href="%2$s" title="%2$s"><strong>оголошення про випуск</strong></a>, щоб дізнатися, що він пропонує та як оновитися.',
	'SERVER_CONFIG'				=> 'Налаштування сервера',
	'SCRIPT_PATH'				=> 'Шлях скрипта',
	'SCRIPT_PATH_EXPLAIN'		=> 'Шлях, за яким розташовано phpBB відносно назви домену, напр. <samp>/phpBB3</samp>.',
));

// Default database schema entries...
$lang = array_merge($lang, array(
	'CONFIG_BOARD_EMAIL_SIG'		=> 'Дякуємо, Адміністрація',
	'CONFIG_SITE_DESC'				=> 'Короткий текст для опису вашого форуму',
	'CONFIG_SITENAME'				=> 'yourdomain.com',

	'DEFAULT_INSTALL_POST'			=> '<t>Це приклад повідомлення у вашому встановленні phpBB3. Здається, все працює. Ви можете видалити це повідомлення, якщо бажаєте, і продовжити налаштування вашого форуму. Під час процесу встановлення вашій першій категорії та вашому першому форуму призначено відповідний набір прав для наперед визначених груп користувачів: адміністратори, боти, глобальні модератори, гості, зареєстровані користувачі та зареєстровані користувачі COPPA. Якщо ви також вирішите видалити свою першу категорію та свій перший форум, не забудьте призначити права для всіх цих груп для всіх нових категорій і форумів, які ви створюєте. Рекомендується перейменувати вашу першу категорію та ваш перший форум і копіювати права з них під час створення нових категорій і форумів. Успіхів!</t>',

	'FORUMS_FIRST_CATEGORY'			=> 'Ваша перша категорія',
	'FORUMS_TEST_FORUM_DESC'		=> 'Опис вашого першого форуму.',
	'FORUMS_TEST_FORUM_TITLE'		=> 'Ваш перший форум',

	'RANKS_SITE_ADMIN_TITLE'		=> 'Адміністратор сайту',
	'REPORT_WAREZ'					=> 'Повідомлення містить посилання на нелегальне або піратське програмне забезпечення.',
	'REPORT_SPAM'					=> 'Єдина мета повідомлення, на яке подано скаргу, — реклама вебсайту чи іншого продукту.',
	'REPORT_OFF_TOPIC'				=> 'Повідомлення, на яке подано скаргу, не стосується теми.',
	'REPORT_OTHER'					=> 'Повідомлення, на яке подано скаргу, не підходить до жодної іншої категорії, будь ласка, використовуйте поле додаткової інформації.',

	'SMILIES_ARROW'					=> 'Стрілка',
	'SMILIES_CONFUSED'				=> 'Спантеличений',
	'SMILIES_COOL'					=> 'Крутий',
	'SMILIES_CRYING'				=> 'Плаче або дуже сумний',
	'SMILIES_EMARRASSED'			=> 'Збентежений',
	'SMILIES_EVIL'					=> 'Злий або дуже сердитий',
	'SMILIES_EXCLAMATION'			=> 'Оклик',
	'SMILIES_GEEK'					=> 'Ботан',
	'SMILIES_IDEA'					=> 'Ідея',
	'SMILIES_LAUGHING'				=> 'Сміється',
	'SMILIES_MAD'					=> 'Сердитий',
	'SMILIES_MR_GREEN'				=> 'Містер Грін',
	'SMILIES_NEUTRAL'				=> 'Нейтральний',
	'SMILIES_QUESTION'				=> 'Питання',
	'SMILIES_RAZZ'					=> 'Показує язика',
	'SMILIES_ROLLING_EYES'			=> 'Закочує очі',
	'SMILIES_SAD'					=> 'Сумний',
	'SMILIES_SHOCKED'				=> 'Шокований',
	'SMILIES_SMILE'					=> 'Посмішка',
	'SMILIES_SURPRISED'				=> 'Здивований',
	'SMILIES_TWISTED_EVIL'			=> 'Підступно злий',
	'SMILIES_UBER_GEEK'				=> 'Супер ботан',
	'SMILIES_VERY_HAPPY'			=> 'Дуже щасливий',
	'SMILIES_WINK'					=> 'Підморгує',

	'TOPICS_TOPIC_TITLE'			=> 'Ласкаво просимо до phpBB3',
));

// Common navigation items' translation
$lang = array_merge($lang, array(
	'MENU_OVERVIEW'		=> 'Огляд',
	'MENU_INTRO'		=> 'Вступ',
	'MENU_LICENSE'		=> 'Ліцензія',
	'MENU_SUPPORT'		=> 'Підтримка',
));

// Task names
$lang = array_merge($lang, array(
	// Install filesystem
	'TASK_CREATE_CONFIG_FILE'	=> 'Створення файлу конфігурації',

	// Install database
	'TASK_ADD_CONFIG_SETTINGS'			=> 'Додавання налаштувань конфігурації',
	'TASK_ADD_DEFAULT_DATA'				=> 'Додавання типових налаштувань до бази даних',
	'TASK_CREATE_DATABASE_SCHEMA_FILE'	=> 'Створення файлу схеми бази даних',
	'TASK_SETUP_DATABASE'				=> 'Налаштування бази даних',
	'TASK_CREATE_TABLES'				=> 'Створення таблиць',

	// Install data
	'TASK_ADD_BOTS'				=> 'Реєстрація ботів',
	'TASK_ADD_LANGUAGES'		=> 'Встановлення доступних мов',
	'TASK_ADD_MODULES'			=> 'Встановлення модулів',
	'TASK_CREATE_SEARCH_INDEX'	=> 'Створення пошукового індексу',

	// Install finish tasks
	'TASK_INSTALL_EXTENSIONS'	=> 'Встановлення пакетних розширень',
	'TASK_NOTIFY_USER'			=> 'Надсилання листа зі сповіщенням',
	'TASK_POPULATE_MIGRATIONS'	=> 'Заповнення міграцій',

	// Installer general progress messages
	'INSTALLER_FINISHED'	=> 'Встановлювач успішно завершив роботу',
));

// Installer's general messages
$lang = array_merge($lang, array(
	'MODULE_NOT_FOUND'				=> 'Модуль не знайдено',
	'MODULE_NOT_FOUND_DESCRIPTION'	=> 'Не вдалося знайти модуль, оскільки службу %s не визначено.',

	'TASK_NOT_FOUND'				=> 'Завдання не знайдено',
	'TASK_NOT_FOUND_DESCRIPTION'	=> 'Не вдалося знайти завдання, оскільки службу %s не визначено.',

	'SKIP_MODULE'	=> 'Пропустити модуль «%s»',
	'SKIP_TASK'		=> 'Пропустити завдання «%s»',

	'TASK_SERVICE_INSTALLER_MISSING'	=> 'Всі служби завдань встановлювача повинні починатися з «installer»',
	'TASK_CLASS_NOT_FOUND'				=> 'Визначення служби завдання встановлювача недійсне. Надано назву служби «%1$s», очікуваний простір імен класу для неї — «%2$s». Для отримання додаткової інформації див. документацію task_interface.',

	'INSTALLER_CONFIG_NOT_WRITABLE'	=> 'Файл конфігурації встановлювача недоступний для запису.',
));

// CLI messages
$lang = array_merge($lang, array(
	'CLI_INSTALL_BOARD'				=> 'Встановити phpBB',
	'CLI_UPDATE_BOARD'				=> 'Оновити phpBB',
	'CLI_INSTALL_SHOW_CONFIG'		=> 'Показати конфігурацію, яка буде використана',
	'CLI_INSTALL_VALIDATE_CONFIG'	=> 'Перевірити файл конфігурації',
	'CLI_CONFIG_FILE'				=> 'Файл конфігурації для використання',
	'MISSING_FILE'					=> 'Не вдалося отримати доступ до файлу %1$s',
	'MISSING_DATA'					=> 'У файлі конфігурації відсутні дані або він може містити недійсні налаштування.',
	'INVALID_YAML_FILE'				=> 'Не вдалося розібрати YAML-файл %1$s',
	'CONFIGURATION_VALID'			=> 'Файл конфігурації дійсний',
));

// Common updater messages
$lang = array_merge($lang, array(
	'UPDATE_INSTALLATION'			=> 'Оновити встановлення phpBB',
	'UPDATE_INSTALLATION_EXPLAIN'	=> 'За допомогою цього варіанту можна оновити ваше встановлення phpBB до останньої версії.<br />Під час процесу всі ваші файли будуть перевірені на цілісність. Ви можете переглянути всі відмінності та файли перед оновленням.<br /><br />Саме оновлення файлів можна виконати двома різними способами.</p><h2>Ручне оновлення</h2><p>У цьому варіанті ви завантажуєте лише свій особистий набір змінених файлів, щоб не втратити внесені вами зміни. Після завантаження цього пакета вам потрібно вручну завантажити файли на відповідні місця в кореневій теці phpBB. Після цього ви можете знову виконати перевірку файлів, щоб переконатися, що ви перемістили файли в правильні місця.</p><h2>Автоматичне оновлення через FTP</h2><p>Цей метод подібний до першого, але без потреби завантажувати змінені файли та вручну їх завантажувати. Це буде зроблено автоматично. Щоб скористатися цим методом, вам потрібно знати дані входу FTP, оскільки вас про них запитають. Після завершення вас буде перенаправлено назад до перевірки файлів, щоб переконатися, що все оновлено коректно.<br /><br />',
	'UPDATE_INSTRUCTIONS'			=> '

		<h1>Оголошення про випуск</h1>

		<p>Будь ласка, прочитайте оголошення про випуск останньої версії, перш ніж продовжити процес оновлення — воно може містити корисну інформацію. Воно також містить повні посилання для завантаження та журнал змін.</p>

		<br />

		<h1>Як оновити ваше встановлення за допомогою повного пакета</h1>

		<p>Рекомендований спосіб оновлення вашого встановлення — використання повного пакета. Якщо основні файли phpBB у вашому встановленні було змінено, ви можете скористатися розширеним пакетом оновлення, щоб не втратити ці зміни. Ви також можете оновити своє встановлення, використовуючи інші методи, перелічені в документі INSTALL.html. Кроки для оновлення phpBB3 за допомогою повного пакета:</p>

		<ol style="margin-left: 20px; font-size: 1.1em;">
			<li><strong class="error">Створіть резервну копію всіх файлів форуму та бази даних.</strong></li>
			<li>Перейдіть на <a href="https://www.phpbb.com/downloads/" title="https://www.phpbb.com/downloads/">сторінку завантажень phpBB.com</a> і завантажте останній архів «Повний пакет».</li>
			<li>Розпакуйте архів.</li>
			<li>Видаліть файл <code class="inline">config.php</code> та теки <code class="inline">/images</code>, <code class="inline">/store</code> і <code class="inline">/files</code> <em>з пакета</em> (не з вашого сайту).</li>
			<li>Перейдіть до ПА, налаштувань форуму, і переконайтеся, що prosilver встановлено як стиль за замовчуванням. Якщо ні, встановіть його.</li>
			<li>Видаліть теки <code class="inline">/vendor</code> і <code class="inline">/cache</code> з кореневої теки форуму на хостингу.</li>
			<li>Через FTP чи SSH завантажте решту файлів і тек (тобто решту ВМІСТУ теки phpBB3) до кореневої теки вашого встановлення форуму на сервері, перезаписуючи наявні файли. (Примітка: будьте обережні, щоб не видалити жодних розширень у вашій теці <code class="inline">/ext</code> під час завантаження нового вмісту phpBB3.)</li>
			<li><strong><a href="%1$s" title="%1$s">Тепер розпочніть процес оновлення, перейшовши браузером до теки install</a>.</strong></li>
			<li>Дотримуйтесь кроків для оновлення бази даних і дочекайтеся завершення.</li>
			<li>Через FTP чи SSH видаліть теку <code class="inline">/install</code> з кореня вашого встановлення форуму.<br><br></li>
		</ol>

		<p>Тепер у вас новий, актуальний форум з усіма вашими користувачами та повідомленнями. Наступні кроки:</p>
		<ul style="margin-left: 20px; font-size: 1.1em;">
			<li>Оновіть мовний пакет</li>
			<li>Оновіть свій стиль<br><br></li>
		</ul>

		<h1>Як оновити ваше встановлення за допомогою розширеного пакета оновлення</h1>

		<p>Розширений пакет оновлення рекомендується лише в разі, якщо основні файли phpBB у вашому встановленні було змінено. Ви також можете оновити своє встановлення, використовуючи методи, перелічені в документі INSTALL.html. Кроки для оновлення phpBB3 за допомогою розширеного пакета оновлення:</p>

		<ol style="margin-left: 20px; font-size: 1.1em;">
			<li>Перейдіть на <a href="https://www.phpbb.com/downloads/" title="https://www.phpbb.com/downloads/">сторінку завантажень phpBB.com</a> і завантажте архів «Розширений пакет оновлення».</li>
			<li>Розпакуйте архів.</li>
			<li>Завантажте повні розпаковані теки «install» і «vendor» до кореневої теки phpBB (там, де розташований ваш файл config.php).<br><br></li>
		</ol>

		<p>Після завантаження ваш форум буде недоступний для звичайних користувачів через наявність завантаженої теки install.<br /><br />
		<strong><a href="%1$s" title="%1$s">Тепер розпочніть процес оновлення, перейшовши браузером до теки install</a>.</strong><br />
		<br />
		Далі вас проведуть через процес оновлення. Ви отримаєте сповіщення, коли оновлення завершиться.
		</p>
	',
));

// Updater forms
$lang = array_merge($lang, array(
	// Updater types
	'UPDATE_TYPE'			=> 'Тип оновлення для запуску',

	'UPDATE_TYPE_ALL'		=> 'Оновити файлову систему та базу даних',
	'UPDATE_TYPE_DB_ONLY'	=> 'Оновити лише базу даних',

	// File updater methods
	'UPDATE_FILE_METHOD_TITLE'		=> 'Методи оновлення файлів',

	'UPDATE_FILE_METHOD'			=> 'Метод оновлення файлів',
	'UPDATE_FILE_METHOD_DOWNLOAD'	=> 'Завантажити змінені файли в архіві',
	'UPDATE_FILE_METHOD_FTP'		=> 'Оновити файли через FTP (Автоматично)',
	'UPDATE_FILE_METHOD_FILESYSTEM'	=> 'Оновити файли через прямий доступ до файлів (Автоматично)',

	// File updater archives
	'SELECT_DOWNLOAD_FORMAT'	=> 'Оберіть формат архіву для завантаження',

	// FTP settings
	'FTP_SETTINGS'			=> 'Налаштування FTP',
));

// Requirements messages
$lang = array_merge($lang, array(
	'UPDATE_FILES_NOT_FOUND'	=> 'Дійсної теки оновлення не знайдено, переконайтеся, що ви завантажили відповідні файли.',

	'NO_UPDATE_FILES_UP_TO_DATE'	=> 'Ваша версія актуальна. Немає потреби запускати засіб оновлення. Якщо ви бажаєте перевірити цілісність файлів, переконайтеся, що ви завантажили правильні файли оновлення.',
	'OLD_UPDATE_FILES'				=> 'Файли оновлення застарілі. Знайдені файли оновлення призначені для оновлення з phpBB %1$s до phpBB %2$s, але остання версія phpBB — %3$s.',
	'INCOMPATIBLE_UPDATE_FILES'		=> 'Знайдені файли оновлення несумісні з встановленою у вас версією. Ваша встановлена версія — %1$s, а файл оновлення призначений для оновлення phpBB %2$s до %3$s.',
));

// Update files
$lang = array_merge($lang, array(
	'STAGE_UPDATE_FILES'		=> 'Оновлення файлів',

	// Check files
	'UPDATE_CHECK_FILES'	=> 'Перевірити файли для оновлення',

	// Update file differ
	'FILE_DIFFER_ERROR_FILE_CANNOT_BE_READ'	=> 'Засобу порівняння файлів не вдалося відкрити %s.',

	'UPDATE_FILE_DIFF'		=> 'Порівняння змінених файлів',
	'ALL_FILES_DIFFED'		=> 'Всі змінені файли порівняно.',

	// File status
	'UPDATE_CONTINUE_FILE_UPDATE'	=> 'Оновити файли',

	'DOWNLOAD'							=> 'Завантажити',
	'DOWNLOAD_CONFLICTS'				=> 'Завантажити архів конфліктів злиття',
	'DOWNLOAD_CONFLICTS_EXPLAIN'		=> 'Шукайте &lt;&lt;&lt; для виявлення конфліктів',
	'DOWNLOAD_UPDATE_METHOD'			=> 'Завантажити архів змінених файлів',
	'DOWNLOAD_UPDATE_METHOD_EXPLAIN'	=> 'Після завантаження вам слід розпакувати архів. Ви знайдете в ньому змінені файли, які потрібно завантажити до кореневої теки вашого phpBB. Будь ласка, завантажте файли до відповідних місць. Після завантаження всіх файлів ви можете продовжити процес оновлення.',

	'FILE_ALREADY_UP_TO_DATE'		=> 'Файл вже актуальний.',
	'FILE_DIFF_NOT_ALLOWED'			=> 'Порівняння цього файлу не дозволено.',
	'FILE_USED'						=> 'Використана інформація з',			// Single file
	'FILES_CONFLICT'				=> 'Конфліктні файли',
	'FILES_CONFLICT_EXPLAIN'		=> 'Наступні файли змінено, і вони не відповідають оригінальним файлам старої версії. phpBB визначив, що ці файли створюють конфлікти при спробі злиття. Будь ласка, розгляньте конфлікти та спробуйте вирішити їх вручну, або продовжте оновлення, обравши бажаний метод злиття. Якщо ви вирішуєте конфлікти вручну, перевірте файли ще раз після внесення змін. Ви також можете обрати бажаний метод злиття для кожного файлу окремо. Перший призведе до втрати конфліктних рядків зі старого файлу, другий — до втрати змін з новішого файлу.',
	'FILES_DELETED'					=> 'Видалені файли',
	'FILES_DELETED_EXPLAIN'			=> 'Наступних файлів немає в новій версії. Ці файли потрібно видалити з вашого встановлення.',
	'FILES_MODIFIED'				=> 'Змінені файли',
	'FILES_MODIFIED_EXPLAIN'		=> 'Наступні файли змінено, і вони не відповідають оригінальним файлам старої версії. Оновлений файл буде результатом злиття ваших змін і нового файлу.',
	'FILES_NEW'						=> 'Нові файли',
	'FILES_NEW_EXPLAIN'				=> 'Наступних файлів наразі немає у вашому встановленні. Ці файли буде додано до вашого встановлення.',
	'FILES_NEW_CONFLICT'			=> 'Нові конфліктні файли',
	'FILES_NEW_CONFLICT_EXPLAIN'	=> 'Наступні файли нові в останній версії, але виявлено, що файл з такою самою назвою вже існує в тому самому місці. Цей файл буде перезаписано новим.',
	'FILES_NOT_MODIFIED'			=> 'Незмінені файли',
	'FILES_NOT_MODIFIED_EXPLAIN'	=> 'Наступні файли не змінено, і вони відповідають оригінальним файлам phpBB версії, з якої ви оновлюєтеся.',
	'FILES_UP_TO_DATE'				=> 'Вже оновлені файли',
	'FILES_UP_TO_DATE_EXPLAIN'		=> 'Наступні файли вже актуальні та не потребують оновлення.',
	'FILES_VERSION'					=> 'Версія файлів',
	'TOGGLE_DISPLAY'				=> 'Показати/сховати список файлів',

	// File updater
	'UPDATE_UPDATING_FILES'	=> 'Оновлення файлів',

	'UPDATE_FILE_UPDATER_HAS_FAILED'	=> 'Засобу оновлення файлів «%1$s» не вдалося виконати оновлення. Встановлювач спробує перейти до «%2$s».',
	'UPDATE_FILE_UPDATERS_HAVE_FAILED'	=> 'Засіб оновлення файлів не спрацював. Інших резервних методів немає.',

	'UPDATE_CONTINUE_UPDATE_PROCESS'	=> 'Продовжити процес оновлення',
	'UPDATE_RECHECK_UPDATE_FILES'		=> 'Перевірити файли знову',
));

// Update database
$lang = array_merge($lang, array(
	'STAGE_UPDATE_DATABASE'		=> 'Оновлення бази даних',

	'INLINE_UPDATE_SUCCESSFUL'		=> 'Базу даних успішно оновлено.',

	'TASK_UPDATE_EXTENSIONS'	=> 'Оновлення розширень',
));

// Converter
$lang = array_merge($lang, array(
	// Common converter messages
	'CONVERT_NOT_EXIST'			=> 'Вказаного конвертера не існує.',
	'DEV_NO_TEST_FILE'			=> 'Для змінної test_file у конвертері не вказано значення. Якщо ви користувач цього конвертера, вам не слід бачити цю помилку, будь ласка, повідомте про це автору конвертера. Якщо ви автор конвертера, вам потрібно вказати назву файлу, який існує на вихідному форумі, щоб можна було перевірити шлях до нього.',
	'COULD_NOT_FIND_PATH'		=> 'Не вдалося знайти шлях до вашого попереднього форуму. Будь ласка, перевірте свої налаштування та спробуйте ще раз.<br />» %s було вказано як вихідний шлях.',
	'CONFIG_PHPBB_EMPTY'		=> 'Змінна конфігурації phpBB3 для «%s» порожня.',

	'MAKE_FOLDER_WRITABLE'		=> 'Будь ласка, переконайтеся, що ця тека існує та доступна для запису веб-сервером, потім спробуйте ще раз:<br />»<strong>%s</strong>.',
	'MAKE_FOLDERS_WRITABLE'		=> 'Будь ласка, переконайтеся, що ці теки існують та доступні для запису веб-сервером, потім спробуйте ще раз:<br />»<strong>%s</strong>.',

	'INSTALL_TEST'				=> 'Перевірити знову',

	'NO_TABLES_FOUND'			=> 'Таблиць не знайдено.',
	'TABLES_MISSING'			=> 'Не вдалося знайти ці таблиці<br />» <strong>%s</strong>.',
	'CHECK_TABLE_PREFIX'		=> 'Будь ласка, перевірте свій префікс таблиць і спробуйте ще раз.',

	// Conversion in progress
	'CATEGORY'					=> 'Категорія',
	'CONTINUE_CONVERT'			=> 'Продовжити конвертацію',
	'CONTINUE_CONVERT_BODY'		=> 'Виявлено попередню спробу конвертації. Тепер ви можете обрати між початком нової конвертації або продовженням наявної.',
	'CONVERT_NEW_CONVERSION'	=> 'Нова конвертація',
	'CONTINUE_OLD_CONVERSION'	=> 'Продовжити раніше розпочату конвертацію',
	'POST_ID'					=> 'ID повідомлення',

	// Start conversion
	'SUB_INTRO'					=> 'Вступ',
	'CONVERT_INTRO'				=> 'Ласкаво просимо до уніфікованої системи конвертації phpBB',
	'CONVERT_INTRO_BODY'		=> 'Звідси ви можете імпортувати дані з інших (встановлених) систем форумів. Список нижче показує всі наразі доступні модулі конвертації. Якщо в цьому списку немає конвертера для програмного забезпечення форуму, з якого ви бажаєте конвертувати, будь ласка, перевірте наш вебсайт, де можуть бути доступні для завантаження додаткові модулі конвертації.',
	'AVAILABLE_CONVERTORS'		=> 'Доступні конвертери',
	'NO_CONVERTORS'				=> 'Доступних конвертерів немає.',
	'CONVERT_OPTIONS'			=> 'Параметри',
	'SOFTWARE'					=> 'Програмне забезпечення форуму',
	'VERSION'					=> 'Версія',
	'CONVERT'					=> 'Конвертувати',

	// Settings
	'STAGE_SETTINGS'			=> 'Налаштування',
	'TABLE_PREFIX_SAME'			=> 'Префікс таблиці має бути тим самим, що використовується програмним забезпеченням, з якого ви конвертуєте.<br />» Вказаний префікс таблиці: %s.',
	'DEFAULT_PREFIX_IS'			=> 'Конвертеру не вдалося знайти таблиці з вказаним префіксом. Будь ласка, переконайтеся, що ви ввели правильні дані для форуму, з якого конвертуєте. Префікс таблиць за замовчуванням для %1$s — <strong>%2$s</strong>.',
	'SPECIFY_OPTIONS'			=> 'Вкажіть параметри конвертації',
	'FORUM_PATH'				=> 'Шлях форуму',
	'FORUM_PATH_EXPLAIN'		=> 'Це <strong>відносний</strong> шлях на диску до вашого попереднього форуму від <strong>кореня цього встановлення phpBB3</strong>.',
	'REFRESH_PAGE'				=> 'Оновити сторінку для продовження конвертації',
	'REFRESH_PAGE_EXPLAIN'		=> 'Якщо встановлено «так», конвертер оновлюватиме сторінку для продовження конвертації після завершення кожного кроку. Якщо це ваша перша конвертація для тестування та виявлення можливих помилок заздалегідь, радимо встановити «ні».',

	// Conversion
	'STAGE_IN_PROGRESS'			=> 'Конвертація триває',

	'AUTHOR_NOTES'				=> 'Примітки автора<br />» %s',
	'STARTING_CONVERT'			=> 'Початок процесу конвертації',
	'CONFIG_CONVERT'			=> 'Конвертація конфігурації',
	'DONE'						=> 'Готово',
	'PREPROCESS_STEP'			=> 'Виконання функцій/запитів попередньої обробки',
	'FILLING_TABLE'				=> 'Заповнення таблиці <strong>%s</strong>',
	'FILLING_TABLES'			=> 'Заповнення таблиць',
	'DB_ERR_INSERT'				=> 'Помилка під час обробки запиту <code>INSERT</code>.',
	'DB_ERR_LAST'				=> 'Помилка під час обробки <var>query_last</var>.',
	'DB_ERR_QUERY_FIRST'		=> 'Помилка під час виконання <var>query_first</var>.',
	'DB_ERR_QUERY_FIRST_TABLE'	=> 'Помилка під час виконання <var>query_first</var>, %s («%s»).',
	'DB_ERR_SELECT'				=> 'Помилка під час виконання запиту <code>SELECT</code>.',
	'STEP_PERCENT_COMPLETED'	=> 'Крок <strong>%d</strong> з <strong>%d</strong>',
	'FINAL_STEP'				=> 'Обробка останнього кроку',
	'SYNC_FORUMS'				=> 'Початок синхронізації форумів',
	'SYNC_POST_COUNT'			=> 'Синхронізація post_counts',
	'SYNC_POST_COUNT_ID'		=> 'Синхронізація post_counts від <var>entry</var> %1$s до %2$s.',
	'SYNC_TOPICS'				=> 'Початок синхронізації тем',
	'SYNC_TOPIC_ID'				=> 'Синхронізація тем від <var>topic_id</var> %1$s до %2$s.',
	'PROCESS_LAST'					=> 'Обробка останніх операторів',
	'UPDATE_TOPICS_POSTED'		=> 'Генерація інформації про опубліковані теми',
	'UPDATE_TOPICS_POSTED_ERR'	=> 'Під час генерації інформації про опубліковані теми сталася помилка. Ви можете повторити цей крок у ПА після завершення процесу конвертації.',
	'CONTINUE_LAST'				=> 'Продовжити останні оператори',
	'CLEAN_VERIFY'				=> 'Очищення та перевірка кінцевої структури',
	'NOT_UNDERSTAND'			=> 'Не вдалося розпізнати %s №%d, таблиця %s («%s»)',
	'NAMING_CONFLICT'			=> 'Конфлікт назв: %s і %s є псевдонімами одне одного<br /><br />%s',

	// Finish conversion
	'CONVERT_COMPLETE'			=> 'Конвертацію завершено',
	'CONVERT_COMPLETE_EXPLAIN'	=> 'Ви успішно конвертували свій форум до phpBB 3.3. Тепер ви можете увійти та <a href="../">отримати доступ до свого форуму</a>. Будь ласка, переконайтеся, що налаштування перенесено правильно, перш ніж вмикати форум, видаливши теку install. Пам’ятайте, що допомога з використання phpBB доступна онлайн через <a href="https://www.phpbb.com/support/docs/en/3.3/ug/">документацію</a> та <a href="https://www.phpbb.com/community/viewforum.php?f=661">форуми підтримки</a>.',

	'COLLIDING_CLEAN_USERNAME'			=> '<strong>%s</strong> — це «чисте» ім’я користувача для:',
	'COLLIDING_USER'					=> '» id користувача: <strong>%d</strong> ім’я користувача: <strong>%s</strong> (%d повідомлень)',
	'COLLIDING_USERNAMES_FOUND'			=> 'На вашому старому форумі знайдено конфліктні імена користувачів. Щоб завершити конвертацію, будь ласка, видаліть або перейменуйте цих користувачів так, щоб на вашому старому форумі був лише один користувач для кожного «чистого» імені користувача.',
	'CONV_ERR_FATAL'					=> 'Критична помилка конвертації',
	'CONV_ERROR_ATTACH_FTP_DIR'			=> 'На старому форумі увімкнено завантаження вкладень через FTP. Будь ласка, вимкніть опцію завантаження через FTP та переконайтеся, що вказано дійсну теку для завантаження, потім скопіюйте всі файли вкладень до цієї нової доступної через веб теки. Після цього перезапустіть конвертер.',
	'CONV_ERROR_CONFIG_EMPTY'			=> 'Інформація про конфігурацію для конвертації відсутня.',
	'CONV_ERROR_FORUM_ACCESS'			=> 'Не вдалося отримати інформацію про доступ до форуму.',
	'CONV_ERROR_GET_CATEGORIES'			=> 'Не вдалося отримати категорії.',
	'CONV_ERROR_GET_CONFIG'				=> 'Не вдалося отримати конфігурацію вашого форуму.',
	'CONV_ERROR_COULD_NOT_READ'			=> 'Не вдалося отримати доступ/прочитати «%s».',
	'CONV_ERROR_GROUP_ACCESS'			=> 'Не вдалося отримати інформацію про автентифікацію групи.',
	'CONV_ERROR_INCONSISTENT_GROUPS'	=> 'Виявлено невідповідність у таблиці груп у add_bots() — вам потрібно додати всі спеціальні групи, якщо ви робите це вручну.',
	'CONV_ERROR_INSERT_BOT'				=> 'Не вдалося додати бота до таблиці користувачів.',
	'CONV_ERROR_INSERT_BOTGROUP'		=> 'Не вдалося додати бота до таблиці ботів.',
	'CONV_ERROR_INSERT_USER_GROUP'		=> 'Не вдалося додати користувача до таблиці user_group.',
	'CONV_ERROR_MESSAGE_PARSER'			=> 'Помилка обробника повідомлень',
	'CONV_ERROR_NO_AVATAR_PATH'			=> 'Примітка для розробника: вам потрібно вказати $convertor[\'avatar_path\'] для використання %s.',
	'CONV_ERROR_NO_FORUM_PATH'			=> 'Відносний шлях до вихідного форуму не вказано.',
	'CONV_ERROR_NO_GALLERY_PATH'		=> 'Примітка для розробника: вам потрібно вказати $convertor[\'avatar_gallery_path\'] для використання %s.',
	'CONV_ERROR_NO_GROUP'				=> 'Групу «%1$s» не знайдено в %2$s.',
	'CONV_ERROR_NO_RANKS_PATH'			=> 'Примітка для розробника: вам потрібно вказати $convertor[\'ranks_path\'] для використання %s.',
	'CONV_ERROR_NO_SMILIES_PATH'		=> 'Примітка для розробника: вам потрібно вказати $convertor[\'smilies_path\'] для використання %s.',
	'CONV_ERROR_NO_UPLOAD_DIR'			=> 'Примітка для розробника: вам потрібно вказати $convertor[\'upload_path\'] для використання %s.',
	'CONV_ERROR_PERM_SETTING'			=> 'Не вдалося додати/оновити налаштування прав.',
	'CONV_ERROR_PM_COUNT'				=> 'Не вдалося вибрати кількість ОП у теці.',
	'CONV_ERROR_REPLACE_CATEGORY'		=> 'Не вдалося додати новий форум замість старої категорії.',
	'CONV_ERROR_REPLACE_FORUM'			=> 'Не вдалося додати новий форум замість старого форуму.',
	'CONV_ERROR_USER_ACCESS'			=> 'Не вдалося отримати інформацію про автентифікацію користувача.',
	'CONV_ERROR_WRONG_GROUP'			=> 'У %2$s визначено неправильну групу «%1$s».',
	'CONV_OPTIONS_BODY'					=> 'Ця сторінка збирає дані, необхідні для доступу до вихідного форуму. Введіть дані бази даних вашого попереднього форуму; конвертер не змінюватиме нічого у вказаній нижче базі даних. Вихідний форум слід вимкнути, щоб забезпечити узгоджену конвертацію.',
	'CONV_SAVED_MESSAGES'				=> 'Збережені повідомлення',

	'PRE_CONVERT_COMPLETE'			=> 'Всі кроки попередньої конвертації успішно завершено. Тепер ви можете розпочати сам процес конвертації. Зверніть увагу, вам може знадобитися вручну виконати та скоригувати кілька речей. Після конвертації особливо перевірте призначені права, перебудуйте пошуковий індекс, який не конвертується, а також переконайтеся, що файли скопійовано коректно, наприклад аватари та смайли.',
));
