<?php
/**
*
* This file is part of the Ukrainian Language Pack
* for the phpBB Forum Software.
*
* @copyright (c) 2026 Magnum <https://magnumblog.space>
* @license GNU General Public License, version 2 (GPL-2.0)
*
* Ukrainian translation by Magnum (magnumblog.space)
*
*/

/**
* DO NOT CHANGE
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine

$lang = array_merge($lang, array(
	'ADD_ATTACHMENT'			=> 'Завантажити вкладення',
	'ADD_ATTACHMENT_EXPLAIN'	=> 'Якщо ви бажаєте додати один або кілька файлів, введіть дані нижче.',
	'ADD_FILE'					=> 'Додати файл',
	'ADD_POLL'					=> 'Створення опитування',
	'ADD_POLL_EXPLAIN'			=> 'Якщо ви не бажаєте додавати опитування до вашої теми, залиште поля порожніми.',
	'ALREADY_DELETED'			=> 'На жаль, це повідомлення вже видалено.',
	'ATTACH_COMMENT_NO_EMOJIS'	=> 'Коментар до вкладення містить заборонені символи (емодзі).',
	'ATTACH_DISK_FULL'			=> 'Недостатньо вільного місця на диску для розміщення цього вкладення.',
	'ATTACH_QUOTA_REACHED'		=> 'На жаль, досягнуто квоту вкладень форуму.',
	'ATTACH_SIG'				=> 'Додати підпис (підписи можна змінити через ПКК)',

	'BBCODE_A_HELP'				=> 'Вбудоване завантажене вкладення: [attachment=]filename.ext[/attachment]',
	'BBCODE_B_HELP'				=> 'Жирний текст: [b]текст[/b]',
	'BBCODE_C_HELP'				=> 'Показ коду: [code]код[/code]',
	'BBCODE_D_HELP'				=> 'Flash: [flash=ширина,висота]http://url[/flash]',
	'BBCODE_F_HELP'				=> 'Розмір шрифту: [size=85]малий текст[/size]',
	'BBCODE_IS_OFF'				=> '%sBBCode%s <em>ВИМКНЕНО</em>',
	'BBCODE_IS_ON'				=> '%sBBCode%s <em>УВІМКНЕНО</em>',
	'BBCODE_I_HELP'				=> 'Курсив: [i]текст[/i]',
	'BBCODE_L_HELP'				=> 'Список: [list][*]текст[/list]',
	'BBCODE_LISTITEM_HELP'		=> 'Елемент списку: [*]текст',
	'BBCODE_O_HELP'				=> 'Впорядкований список: напр. [list=1][*]Перший пункт[/list] або [list=a][*]Пункт a[/list]',
	'BBCODE_P_HELP'				=> 'Вставити зображення: [img]http://адреса_зображення[/img]',
	'BBCODE_Q_HELP'				=> 'Цитата тексту: [quote]текст[/quote]',
	'BBCODE_S_HELP'				=> 'Колір шрифту: [color=red]текст[/color] або [color=#FF0000]текст[/color]',
	'BBCODE_U_HELP'				=> 'Підкреслений текст: [u]текст[/u]',
	'BBCODE_W_HELP'				=> 'Вставити URL: [url]http://url[/url] або [url=http://url]текст посилання[/url]',
	'BBCODE_Y_HELP'				=> 'Список: Додати елемент списку',
	'BUMP_ERROR'				=> 'Ви не можете підняти цю тему так скоро після останнього повідомлення.',

	'CANNOT_DELETE_REPLIED'		=> 'На жаль, ви можете видаляти лише повідомлення, на які ще не було відповідей.',
	'CANNOT_EDIT_POST_LOCKED'	=> 'Це повідомлення заблоковано. Ви більше не можете його редагувати.',
	'CANNOT_EDIT_TIME'			=> 'Ви більше не можете редагувати чи видаляти це повідомлення.',
	'CANNOT_POST_ANNOUNCE'		=> 'На жаль, ви не можете створювати оголошення.',
	'CANNOT_POST_STICKY'		=> 'На жаль, ви не можете створювати закріплені теми.',
	'CHANGE_TOPIC_TO'			=> 'Змінити тип теми на',
	'CHARS_POST_CONTAINS'		=> array(
		1	=> 'Ваше повідомлення містить %1$d символ.',
		2	=> 'Ваше повідомлення містить %1$d символи.',
		3	=> 'Ваше повідомлення містить %1$d символів.',
	),
	'CHARS_SIG_CONTAINS'		=> array(
		1	=> 'Ваш підпис містить %1$d символ.',
		2	=> 'Ваш підпис містить %1$d символи.',
		3	=> 'Ваш підпис містить %1$d символів.',
	),
	'CLOSE_TAGS'				=> 'Закрити теги',
	'CURRENT_TOPIC'				=> 'Поточна тема',

	'DELETE_FILE'				=> 'Видалити файл',
	'DELETE_MESSAGE'			=> 'Видалити повідомлення',
	'DELETE_MESSAGE_CONFIRM'	=> 'Ви впевнені, що бажаєте видалити це повідомлення?',
	'DELETE_OWN_POSTS'			=> 'На жаль, ви можете видаляти лише власні повідомлення.',
	'DELETE_PERMANENTLY'		=> 'Видалити назавжди',
	'DELETE_POST_CONFIRM'		=> 'Ви впевнені, що бажаєте видалити це повідомлення?',
	'DELETE_POST_PERMANENTLY_CONFIRM'	=> 'Ви впевнені, що бажаєте <strong>назавжди</strong> видалити це повідомлення?',
	'DELETE_POST_PERMANENTLY'	=> array(
		1	=> 'Видалити це повідомлення назавжди без можливості відновлення',
		2	=> 'Видалити %1$d повідомлень назавжди без можливості відновлення',
	),
	'DELETE_POSTS_CONFIRM'		=> 'Ви впевнені, що бажаєте видалити ці повідомлення?',
	'DELETE_POSTS_PERMANENTLY_CONFIRM'	=> 'Ви впевнені, що бажаєте <strong>назавжди</strong> видалити ці повідомлення?',
	'DELETE_REASON'				=> 'Причина видалення',
	'DELETE_REASON_EXPLAIN'		=> 'Вказана причина видалення буде видима модераторам.',
	'DELETE_POST_WARN'			=> 'Видалити це повідомлення',
	'DELETE_TOPIC_CONFIRM'		=> 'Ви впевнені, що бажаєте видалити цю тему?',
	'DELETE_TOPIC_PERMANENTLY'	=> array(
		1	=> 'Видалити цю тему назавжди без можливості відновлення',
		2	=> 'Видалити %1$d тем назавжди без можливості відновлення',
	),
	'DELETE_TOPIC_PERMANENTLY_CONFIRM'	=> 'Ви впевнені, що бажаєте <strong>назавжди</strong> видалити цю тему?',
	'DELETE_TOPICS_CONFIRM'		=> 'Ви впевнені, що бажаєте видалити ці теми?',
	'DELETE_TOPICS_PERMANENTLY_CONFIRM'	=> 'Ви впевнені, що бажаєте <strong>назавжди</strong> видалити ці теми?',
	'DISABLE_BBCODE'			=> 'Вимкнути BBCode',
	'DISABLE_MAGIC_URL'			=> 'Не перетворювати URL-адреси автоматично',
	'DISABLE_SMILIES'			=> 'Вимкнути смайли',
	'DISALLOWED_CONTENT'		=> 'Завантаження відхилено, оскільки завантажений файл визначено як можливий вектор атаки.',
	'DISALLOWED_EXTENSION'		=> 'Розширення %s не дозволено.',
	'DRAFT_LOADED'				=> 'Чернетку завантажено в область повідомлення, можливо, ви захочете завершити своє повідомлення зараз.<br />Вашу чернетку буде видалено після надсилання цього повідомлення.',
	'DRAFT_LOADED_PM'			=> 'Чернетку завантажено в область повідомлення, можливо, ви захочете завершити своє особисте повідомлення зараз.<br />Вашу чернетку буде видалено після надсилання цього особистого повідомлення.',
	'DRAFT_SAVED'				=> 'Чернетку успішно збережено.',
	'DRAFT_TITLE'				=> 'Назва чернетки',

	'EDIT_REASON'				=> 'Причина редагування цього повідомлення',
	'EMPTY_FILEUPLOAD'			=> 'Завантажений файл порожній.',
	'EMPTY_MESSAGE'				=> 'Вам потрібно ввести текст повідомлення.',
	'EMPTY_REMOTE_DATA'			=> 'Не вдалося завантажити файл, будь ласка, спробуйте завантажити файл вручну.',

	'FLASH_IS_OFF'				=> '[flash] <em>ВИМКНЕНО</em>',
	'FLASH_IS_ON'				=> '[flash] <em>УВІМКНЕНО</em>',
	'FLOOD_ERROR'				=> 'Ви не можете надіслати ще одне повідомлення так скоро після попереднього.',
	'FONT_COLOR'				=> 'Колір шрифту',
	'FONT_COLOR_HIDE'			=> 'Сховати колір шрифту',
	'FONT_HUGE'					=> 'Величезний',
	'FONT_LARGE'				=> 'Великий',
	'FONT_NORMAL'				=> 'Звичайний',
	'FONT_SIZE'					=> 'Розмір шрифту',
	'FONT_SMALL'				=> 'Малий',
	'FONT_TINY'					=> 'Крихітний',

	'GENERAL_UPLOAD_ERROR'		=> 'Не вдалося завантажити вкладення до %s.',

	'IMAGES_ARE_OFF'			=> '[img] <em>ВИМКНЕНО</em>',
	'IMAGES_ARE_ON'				=> '[img] <em>УВІМКНЕНО</em>',
	'INVALID_FILENAME'			=> '%s є неприпустимою назвою файлу.',

	'LOAD'						=> 'Завантажити',
	'LOAD_DRAFT'				=> 'Завантажити чернетку',
	'LOAD_DRAFT_EXPLAIN'		=> 'Тут ви можете обрати чернетку, написання якої бажаєте продовжити. Ваше поточне повідомлення буде скасовано, весь поточний вміст повідомлення буде видалено. Переглядайте, редагуйте та видаляйте чернетки в панелі керування користувача.',
	'LOGIN_EXPLAIN_BUMP'		=> 'Вам потрібно увійти, щоб піднімати теми в цьому форумі.',
	'LOGIN_EXPLAIN_DELETE'		=> 'Вам потрібно увійти, щоб видаляти повідомлення в цьому форумі.',
	'LOGIN_EXPLAIN_SOFT_DELETE'	=> 'Вам потрібно увійти, щоб позначати повідомлення видаленими у цьому форумі.',
	'LOGIN_EXPLAIN_POST'		=> 'Вам потрібно увійти, щоб публікувати повідомлення в цьому форумі.',
	'LOGIN_EXPLAIN_QUOTE'		=> 'Вам потрібно увійти, щоб цитувати повідомлення в цьому форумі.',
	'LOGIN_EXPLAIN_REPLY'		=> 'Вам потрібно увійти, щоб відповідати на теми в цьому форумі.',

	'MAX_ATTACHMENT_FILESIZE'	=> 'Максимальний розмір файлу на вкладення: %s.',
	'MAX_FONT_SIZE_EXCEEDED'	=> 'Ви можете використовувати шрифт розміром не більше %d.',
	'MAX_FLASH_HEIGHT_EXCEEDED'	=> array(
		1	=> 'Ваші flash-файли можуть мати висоту не більше %d пікселя.',
		2	=> 'Ваші flash-файли можуть мати висоту не більше %d пікселів.',
		3	=> 'Ваші flash-файли можуть мати висоту не більше %d пікселів.',
	),
	'MAX_FLASH_WIDTH_EXCEEDED'	=> array(
		1	=> 'Ваші flash-файли можуть мати ширину не більше %d пікселя.',
		2	=> 'Ваші flash-файли можуть мати ширину не більше %d пікселів.',
		3	=> 'Ваші flash-файли можуть мати ширину не більше %d пікселів.',
	),
	'MAX_IMG_HEIGHT_EXCEEDED'	=> array(
		1	=> 'Ваші зображення можуть мати висоту не більше %1$d пікселя.',
		2	=> 'Ваші зображення можуть мати висоту не більше %1$d пікселів.',
		3	=> 'Ваші зображення можуть мати висоту не більше %1$d пікселів.',
	),
	'MAX_IMG_WIDTH_EXCEEDED'	=> array(
		1	=> 'Ваші зображення можуть мати ширину не більше %d пікселя.',
		2	=> 'Ваші зображення можуть мати ширину не більше %d пікселів.',
		3	=> 'Ваші зображення можуть мати ширину не більше %d пікселів.',
	),

	'MESSAGE_BODY_EXPLAIN'		=> array(
		0	=> '', // zero means no limit, so we don't view a message here.
		1	=> 'Введіть ваше повідомлення тут, воно може містити не більше <strong>%d</strong> символу.',
		2	=> 'Введіть ваше повідомлення тут, воно може містити не більше <strong>%d</strong> символів.',
	),
	'MESSAGE_DELETED'			=> 'Це повідомлення успішно видалено.',
	'MORE_SMILIES'				=> 'Переглянути більше смайлів',

	'NOTIFY_REPLY'				=> 'Сповіщати мене про нові відповіді',
	'NOT_UPLOADED'				=> 'Не вдалося завантажити файл.',
	'NO_DELETE_POLL_OPTIONS'	=> 'Ви не можете видаляти наявні варіанти опитування.',
	'NO_PM_ICON'				=> 'Без значка ОП',
	'NO_POLL_TITLE'				=> 'Вам потрібно ввести назву опитування.',
	'NO_POST'					=> 'Запитуване повідомлення не існує.',
	'NO_POST_MODE'				=> 'Режим публікації не вказано.',
	'NO_TEMP_DIR'				=> 'Тимчасову теку не знайдено, або вона недоступна для запису.',

	'PARTIAL_UPLOAD'			=> 'Завантажений файл було передано лише частково.',
	'PHP_UPLOAD_STOPPED'		=> 'Розширення PHP зупинило завантаження файлу.',
	'PHP_SIZE_NA'				=> 'Розмір файлу вкладення завеликий.<br />Не вдалося визначити максимальний розмір, заданий PHP у php.ini.',
	'PHP_SIZE_OVERRUN'			=> 'Розмір файлу вкладення завеликий, максимальний розмір завантаження — %1$d %2$s.<br />Зверніть увагу, це налаштовано в php.ini і не може бути перевизначено.',
	'PLACE_INLINE'				=> 'Вставити в текст',
	'POLL_DELETE'				=> 'Видалити опитування',
	'POLL_FOR'					=> 'Тривалість опитування',
	'POLL_FOR_EXPLAIN'			=> 'Введіть 0 для опитування без обмеження в часі.',
	'POLL_MAX_OPTIONS'			=> 'Варіантів на користувача',
	'POLL_MAX_OPTIONS_EXPLAIN'	=> 'Це кількість варіантів, які кожен користувач може обрати під час голосування.',
	'POLL_OPTIONS'				=> 'Варіанти опитування',
	'POLL_OPTIONS_EXPLAIN'		=> array(
		1	=> 'Розмістіть кожен варіант з нового рядка. Ви можете ввести <strong>%d</strong> варіант.',
		2	=> 'Розмістіть кожен варіант з нового рядка. Ви можете ввести до <strong>%d</strong> варіантів.',
	),
	'POLL_OPTIONS_EDIT_EXPLAIN'		=> array(
		1	=> 'Розмістіть кожен варіант з нового рядка. Ви можете ввести <strong>%d</strong> варіант. Якщо ви видалите чи додасте варіанти, усі попередні голоси буде скинуто.',
		2	=> 'Розмістіть кожен варіант з нового рядка. Ви можете ввести до <strong>%d</strong> варіантів. Якщо ви видалите чи додасте варіанти, усі попередні голоси буде скинуто.',
	),
	'POLL_QUESTION'				=> 'Питання опитування',
	'POLL_TITLE_TOO_LONG'		=> 'Назва опитування має містити менше 100 символів.',
	'POLL_TITLE_COMP_TOO_LONG'	=> 'Оброблений розмір назви вашого опитування завеликий, спробуйте прибрати BBCode чи смайли.',
	'POLL_VOTE_CHANGE'			=> 'Дозволити повторне голосування',
	'POLL_VOTE_CHANGE_EXPLAIN'	=> 'Якщо увімкнено, користувачі можуть змінювати свій голос.',
	'POSTED_ATTACHMENTS'		=> 'Надіслані вкладення',
	'POST_APPROVAL_NOTIFY'		=> 'Вас буде сповіщено, коли ваше повідомлення схвалять.',
	'POST_CONFIRMATION'			=> 'Підтвердження публікації',
	'POST_CONFIRM_EXPLAIN'		=> 'Щоб запобігти автоматичним публікаціям, форум вимагає ввести код підтвердження. Код показано на зображенні нижче. Якщо у вас порушений зір або ви не можете прочитати цей код з інших причин, будь ласка, зверніться до %sадміністратора форуму%s.',
	'POST_DELETED'				=> 'Це повідомлення успішно видалено.',
	'POST_EDITED'				=> 'Це повідомлення успішно відредаговано.',
	'POST_EDITED_MOD'			=> 'Це повідомлення успішно відредаговано, але його потрібно буде схвалити модератору, перш ніж воно стане загальнодоступним.',
	'POST_GLOBAL'				=> 'Загальне',
	'POST_ICON'					=> 'Значок повідомлення',
	'POST_NORMAL'				=> 'Звичайне',
	'POST_REVIEW'				=> 'Огляд повідомлень',
	'POST_REVIEW_EDIT'			=> 'Огляд повідомлень',
	'POST_REVIEW_EDIT_EXPLAIN'	=> 'Це повідомлення було змінено іншим користувачем, поки ви його редагували. Можливо, вам варто переглянути поточну версію цього повідомлення та скоригувати свої правки.',
	'POST_REVIEW_EXPLAIN'		=> 'До цієї теми було додано принаймні одне нове повідомлення. Можливо, вам варто переглянути своє повідомлення з урахуванням цього.',
	'POST_STORED'				=> 'Це повідомлення успішно опубліковано.',
	'POST_STORED_MOD'			=> 'Це повідомлення успішно надіслано, але його потрібно буде схвалити модератору, перш ніж воно стане загальнодоступним.',
	'POST_TOPIC_AS'				=> 'Опублікувати тему як',
	'PROGRESS_BAR'				=> 'Індикатор прогресу',

	'QUOTE_DEPTH_EXCEEDED'		=> array(
		1	=> 'Ви можете вкласти лише %d цитату одна в одну.',
		2	=> 'Ви можете вкласти лише %d цитати одна в одну.',
		3	=> 'Ви можете вкласти лише %d цитат одна в одну.',
	),
	'QUOTE_NO_NESTING'			=> 'Ви не можете вкладати цитати одна в одну.',

	'REMOTE_UPLOAD_TIMEOUT'		=> 'Не вдалося завантажити вказаний файл, оскільки минув час очікування запиту.',
	'SAVE'						=> 'Зберегти',
	'SAVE_DATE'					=> 'Збережено',
	'SAVE_DRAFT'				=> 'Зберегти чернетку',
	'SAVE_DRAFT_CONFIRM'		=> 'Зверніть увагу, що збережені чернетки включають лише тему та повідомлення, будь-які інші елементи буде видалено. Бажаєте зберегти чернетку зараз?',
	'SMILIES'					=> 'Смайли',
	'SMILIES_ARE_OFF'			=> 'Смайли <em>ВИМКНЕНО</em>',
	'SMILIES_ARE_ON'			=> 'Смайли <em>УВІМКНЕНО</em>',
	'STICKY_ANNOUNCE_TIME_LIMIT'=> 'Термін закріплення/оголошення/глобального повідомлення',
	'STICK_TOPIC_FOR'			=> 'Закріпити тему на',
	'STICK_TOPIC_FOR_EXPLAIN'	=> 'Введіть 0 для закріплення/оголошення/глобального повідомлення без обмеження в часі. Зверніть увагу, це число відраховується від дати повідомлення.',
	'STYLES_TIP'				=> 'Порада: стилі можна швидко застосувати до обраного тексту.',

	'TOO_FEW_CHARS'				=> 'Ваше повідомлення містить занадто мало символів.',
	'TOO_FEW_CHARS_LIMIT'		=> array(
		1	=> 'Вам потрібно ввести щонайменше %1$d символ.',
		2	=> 'Вам потрібно ввести щонайменше %1$d символи.',
		3	=> 'Вам потрібно ввести щонайменше %1$d символів.',
	),
	'TOO_FEW_POLL_OPTIONS'		=> 'Вам потрібно ввести щонайменше два варіанти опитування.',
	'TOO_MANY_ATTACHMENTS'		=> 'Неможливо додати ще одне вкладення, максимум становить %d.',
	'TOO_MANY_CHARS'			=> 'Ваше повідомлення містить забагато символів.',
	'TOO_MANY_CHARS_LIMIT'		=> array(
		2	=> 'Максимально дозволена кількість символів — %1$d.',
	),
	'TOO_MANY_POLL_OPTIONS'		=> 'Ви спробували ввести забагато варіантів опитування.',
	'TOO_MANY_SMILIES'			=> 'Ваше повідомлення містить забагато смайлів. Максимально дозволена кількість смайлів — %d.',
	'TOO_MANY_URLS'				=> 'Ваше повідомлення містить забагато URL-адрес. Максимально дозволена кількість URL-адрес — %d.',
	'TOO_MANY_USER_OPTIONS'		=> 'Ви не можете вказати більше варіантів на користувача, ніж наявних варіантів опитування.',
	'TOPIC_BUMPED'				=> 'Тему успішно піднято.',

	'UNAUTHORISED_BBCODE'		=> 'Ви не можете використовувати певні BBCode: %s.',
	'UNSUPPORTED_CHARACTERS_MESSAGE'	=> 'Ваше повідомлення містить наступні непідтримувані символи:<br />%s',
	'UNSUPPORTED_CHARACTERS_SUBJECT'	=> 'Ваша тема містить наступні непідтримувані символи:<br />%s',
	'UPDATE_COMMENT'			=> 'Оновити коментар',
	'URL_INVALID'				=> 'Вказана вами URL-адреса неприпустима.',
	'URL_NOT_FOUND'				=> 'Вказаний файл не знайдено.',
	'URL_IS_OFF'				=> '[url] <em>ВИМКНЕНО</em>',
	'URL_IS_ON'					=> '[url] <em>УВІМКНЕНО</em>',
	'USER_CANNOT_BUMP'			=> 'Ви не можете піднімати теми в цьому форумі.',
	'USER_CANNOT_DELETE'		=> 'Ви не можете видаляти повідомлення в цьому форумі.',
	'USER_CANNOT_EDIT'			=> 'Ви не можете редагувати повідомлення в цьому форумі.',
	'USER_CANNOT_REPLY'			=> 'Ви не можете відповідати в цьому форумі.',
	'USER_CANNOT_FORUM_POST'	=> 'Ви не можете виконувати дії публікації в цьому форумі, оскільки тип форуму цього не підтримує.',

	'VIEW_MESSAGE'				=> '%sПереглянути надіслане повідомлення%s',
	'VIEW_PRIVATE_MESSAGE'		=> '%sПереглянути надіслане особисте повідомлення%s',

	'WRONG_FILESIZE'			=> 'Файл завеликий, максимально дозволений розмір — %1$d %2$s.',
	'WRONG_SIZE'				=> 'Зображення має бути щонайменше %1$s завширшки, %2$s заввишки та щонайбільше %3$s завширшки і %4$s заввишки. Надіслане зображення має розмір %5$s завширшки і %6$s заввишки.',
));
