<?php
/**
 *
 * This file is part of the Ukrainian Language Pack
 * for the phpBB Forum Software.
 *
 * @copyright (c) 2026 Magnum <https://magnumblog.space>
 * @license GNU General Public License, version 2 (GPL-2.0)
 *
 * Ukrainian translation by Magnum (magnumblog.space)
 *
 */

/**
 * DO NOT CHANGE
 */
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

$lang = array_merge($lang, array(
	'HELP_FAQ_ATTACHMENTS_ALLOWED_ANSWER'	=> 'Кожен адміністратор форуму може дозволяти чи забороняти певні типи вкладень. Якщо ви не впевнені, що дозволено завантажувати, зверніться по допомогу до адміністратора форуму.',
	'HELP_FAQ_ATTACHMENTS_ALLOWED_QUESTION'	=> 'Які вкладення дозволені на цьому форумі?',
	'HELP_FAQ_ATTACHMENTS_OWN_ANSWER'	=> 'Щоб знайти список завантажених вами вкладень, перейдіть до панелі керування користувача та дотримуйтесь посилань до розділу вкладень.',
	'HELP_FAQ_ATTACHMENTS_OWN_QUESTION'	=> 'Як знайти всі мої вкладення?',

	'HELP_FAQ_BLOCK_ATTACHMENTS'	=> 'Вкладення',
	'HELP_FAQ_BLOCK_BOOKMARKS'	=> 'Підписки та закладки',
	'HELP_FAQ_BLOCK_FORMATTING'	=> 'Форматування та типи тем',
	'HELP_FAQ_BLOCK_FRIENDS'	=> 'Друзі та недруги',
	'HELP_FAQ_BLOCK_GROUPS'	=> 'Рівні користувачів і групи',
	'HELP_FAQ_BLOCK_ISSUES'	=> 'Питання щодо phpBB',
	'HELP_FAQ_BLOCK_LOGIN'	=> 'Питання щодо входу та реєстрації',
	'HELP_FAQ_BLOCK_PMS'	=> 'Особисті повідомлення',
	'HELP_FAQ_BLOCK_POSTING'	=> 'Питання щодо публікацій',
	'HELP_FAQ_BLOCK_SEARCH'	=> 'Пошук на форумах',
	'HELP_FAQ_BLOCK_USERSETTINGS'	=> 'Налаштування та параметри користувача',

	'HELP_FAQ_BOOKMARKS_DIFFERENCE_ANSWER'	=> 'У phpBB 3.0 додавання тем до закладок працювало подібно до закладок у веб-браузері. Ви не отримували сповіщень про оновлення. Починаючи з phpBB 3.1, закладки стали більше схожими на підписку на тему. Ви можете отримувати сповіщення, коли тема з закладок оновлюється. Підписка ж сповіщатиме вас про оновлення теми чи форуму на сайті. Параметри сповіщень для закладок і підписок можна налаштувати в панелі керування користувача, у розділі «Налаштування форуму».',
	'HELP_FAQ_BOOKMARKS_DIFFERENCE_QUESTION'	=> 'У чому різниця між закладками та підпискою?',
	'HELP_FAQ_BOOKMARKS_FORUM_ANSWER'	=> 'Щоб підписатися на конкретний форум, натисніть посилання «Підписатися на форум» внизу сторінки при вході до форуму.',
	'HELP_FAQ_BOOKMARKS_FORUM_QUESTION'	=> 'Як підписатися на конкретні форуми?',
	'HELP_FAQ_BOOKMARKS_REMOVE_ANSWER'	=> 'Щоб видалити свої підписки, перейдіть до панелі керування користувача та дотримуйтесь посилань до ваших підписок.',
	'HELP_FAQ_BOOKMARKS_REMOVE_QUESTION'	=> 'Як видалити мої підписки?',
	'HELP_FAQ_BOOKMARKS_TOPIC_ANSWER'	=> 'Ви можете додати тему до закладок або підписатися на неї, натиснувши відповідне посилання в меню «Інструменти теми», зручно розташованому вгорі та внизу обговорення теми.<br />Відповідь на тему з увімкненим параметром «Сповіщати мене про нові відповіді» також підпише вас на цю тему.',
	'HELP_FAQ_BOOKMARKS_TOPIC_QUESTION'	=> 'Як додати тему до закладок або підписатися на неї?',

	'HELP_FAQ_FORMATTING_ANNOUNCEMENT_ANSWER'	=> 'Оголошення часто містять важливу інформацію для форуму, який ви наразі читаєте, тому вам варто читати їх, коли це можливо. Оголошення з’являються вгорі кожної сторінки форуму, в якому їх опубліковано. Як і з загальними оголошеннями, права на оголошення надає адміністратор форуму.',
	'HELP_FAQ_FORMATTING_ANNOUNCEMENT_QUESTION'	=> 'Що таке оголошення?',
	'HELP_FAQ_FORMATTING_BBOCDE_ANSWER'	=> 'BBCode — це особлива реалізація HTML, що надає широкий контроль над форматуванням окремих об’єктів у повідомленні. Використання BBCode дозволяє адміністратор, але його також можна вимкнути для окремого повідомлення через форму публікації. Сам BBCode подібний за стилем до HTML, але теги обгорнуто квадратними дужками [ і ], а не &lt; і &gt;. Для отримання додаткової інформації про BBCode див. довідник, доступний зі сторінки публікації.',
	'HELP_FAQ_FORMATTING_BBOCDE_QUESTION'	=> 'Що таке BBCode?',
	'HELP_FAQ_FORMATTING_GLOBAL_ANNOUNCE_ANSWER'	=> 'Загальні оголошення містять важливу інформацію, і вам варто читати їх, коли це можливо. Вони з’являтимуться вгорі кожного форуму та в панелі керування користувача. Права на загальні оголошення надає адміністратор форуму.',
	'HELP_FAQ_FORMATTING_GLOBAL_ANNOUNCE_QUESTION'	=> 'Що таке загальні оголошення?',
	'HELP_FAQ_FORMATTING_HTML_ANSWER'	=> 'Ні. На цьому форумі неможливо публікувати HTML так, щоб він відображався як HTML. Більшість форматування, яке можна виконати за допомогою HTML, можна натомість застосувати за допомогою BBCode.',
	'HELP_FAQ_FORMATTING_HTML_QUESTION'	=> 'Чи можу я використовувати HTML?',
	'HELP_FAQ_FORMATTING_ICONS_ANSWER'	=> 'Значки теми — це обрані автором зображення, пов’язані з повідомленнями, щоб позначити їхній вміст. Можливість використовувати значки теми залежить від прав, встановлених адміністратором форуму.',
	'HELP_FAQ_FORMATTING_ICONS_QUESTION'	=> 'Що таке значки теми?',
	'HELP_FAQ_FORMATTING_IMAGES_ANSWER'	=> 'Так, зображення можна показувати у ваших повідомленнях. Якщо адміністратор дозволив вкладення, ви можете завантажити зображення на форум. Інакше вам потрібно посилатися на зображення, збережене на загальнодоступному веб-сервері, напр. http://www.example.com/my-picture.gif. Ви не можете посилатися на зображення, збережені на вашому власному комп’ютері (якщо це не загальнодоступний сервер), а також на зображення, збережені за механізмами автентифікації, напр. поштові скриньки hotmail чи yahoo, сайти, захищені паролем тощо. Щоб показати зображення, використовуйте тег BBCode [img].',
	'HELP_FAQ_FORMATTING_IMAGES_QUESTION'	=> 'Чи можу я публікувати зображення?',
	'HELP_FAQ_FORMATTING_LOCKED_ANSWER'	=> 'Закриті теми — це теми, у яких користувачі більше не можуть відповідати, а будь-яке опитування в них автоматично завершено. Теми можуть бути закриті з багатьох причин і встановлюються так модератором форуму або адміністратором форуму. Ви також можете мати можливість закривати власні теми, залежно від прав, наданих вам адміністратором форуму.',
	'HELP_FAQ_FORMATTING_LOCKED_QUESTION'	=> 'Що таке закриті теми?',
	'HELP_FAQ_FORMATTING_SMILIES_ANSWER'	=> 'Смайли, або емотикони, — це маленькі зображення, які можна використовувати для вираження почуттів коротким кодом, напр. :) означає радість, а :( означає сум. Повний список емотиконів можна побачити у формі публікації. Втім, намагайтеся не зловживати смайлами, оскільки вони можуть швидко зробити повідомлення нечитабельним, і модератор може видалити їх або видалити повідомлення повністю. Адміністратор форуму також міг встановити обмеження на кількість смайлів, які ви можете використовувати в одному повідомленні.',
	'HELP_FAQ_FORMATTING_SMILIES_QUESTION'	=> 'Що таке смайли?',
	'HELP_FAQ_FORMATTING_STICKIES_ANSWER'	=> 'Закріплені теми в форумі з’являються під оголошеннями і лише на першій сторінці. Вони часто досить важливі, тому вам варто читати їх, коли це можливо. Як і з оголошеннями та загальними оголошеннями, права на закріплення тем надає адміністратор форуму.',
	'HELP_FAQ_FORMATTING_STICKIES_QUESTION'	=> 'Що таке закріплені теми?',

	'HELP_FAQ_FRIENDS_BASIC_ANSWER'	=> 'Ви можете використовувати ці списки для впорядкування інших учасників форуму. Учасники, додані до вашого списку друзів, будуть показані у вашій панелі керування користувача для швидкого доступу, щоб бачити їхній статус онлайн і надсилати їм особисті повідомлення. Залежно від підтримки шаблону, повідомлення цих користувачів також можуть виділятися. Якщо ви додасте користувача до списку недругів, будь-які його повідомлення будуть приховані за замовчуванням.',
	'HELP_FAQ_FRIENDS_BASIC_QUESTION'	=> 'Що таке списки моїх друзів і недругів?',
	'HELP_FAQ_FRIENDS_MANAGE_ANSWER'	=> 'Ви можете додавати користувачів до свого списку двома способами. У профілі кожного користувача є посилання, щоб додати його до списку друзів або недругів. Крім того, з панелі керування користувача ви можете напряму додавати користувачів, вводячи їхнє ім’я учасника. Ви також можете видаляти користувачів зі свого списку на тій самій сторінці.',
	'HELP_FAQ_FRIENDS_MANAGE_QUESTION'	=> 'Як додати/видалити користувачів зі списку друзів або недругів?',

	'HELP_FAQ_GROUPS_ADMINISTRATORS_ANSWER'	=> 'Адміністратори — це учасники, яким надано найвищий рівень контролю над усім форумом. Ці учасники можуть контролювати всі аспекти роботи форуму, включно з встановленням прав, блокуванням користувачів, створенням груп користувачів або модераторів тощо, залежно від того, що дозволив засновник форуму та які права він надав іншим адміністраторам. Вони також можуть мати повні можливості модератора в усіх форумах, залежно від налаштувань, встановлених засновником форуму.',
	'HELP_FAQ_GROUPS_ADMINISTRATORS_QUESTION'	=> 'Хто такі адміністратори?',
	'HELP_FAQ_GROUPS_COLORS_ANSWER'	=> 'Адміністратор форуму може призначити колір учасникам групи користувачів, щоб полегшити ідентифікацію учасників цієї групи.',
	'HELP_FAQ_GROUPS_COLORS_QUESTION'	=> 'Чому деякі групи користувачів показано іншим кольором?',
	'HELP_FAQ_GROUPS_DEFAULT_ANSWER'	=> 'Якщо ви є учасником більше ніж однієї групи користувачів, ваша основна група використовується для визначення того, який колір групи та звання групи буде показано для вас за замовчуванням. Адміністратор форуму може надати вам право змінювати свою основну групу користувачів через панель керування користувача.',
	'HELP_FAQ_GROUPS_DEFAULT_QUESTION'	=> 'Що таке «Основна група користувачів»?',
	'HELP_FAQ_GROUPS_MODERATORS_ANSWER'	=> 'Модератори — це особи (або групи осіб), які щодня стежать за форумами. Вони мають повноваження редагувати чи видаляти повідомлення, а також закривати, відкривати, переміщувати, видаляти та розділяти теми у форумі, який вони модерують. Загалом модератори присутні, щоб запобігти відхиленню користувачів від теми або публікації образливих чи неприйнятних матеріалів.',
	'HELP_FAQ_GROUPS_MODERATORS_QUESTION'	=> 'Хто такі модератори?',
	'HELP_FAQ_GROUPS_TEAM_ANSWER'	=> 'Ця сторінка надає вам список персоналу форуму, включно з адміністраторами та модераторами форуму, а також інші деталі, наприклад, форуми, які вони модерують.',
	'HELP_FAQ_GROUPS_TEAM_QUESTION'	=> 'Що таке посилання «Команда»?',
	'HELP_FAQ_GROUPS_USERGROUPS_ANSWER'	=> 'Групи користувачів — це групи користувачів, які поділяють спільноту на керовані розділи, з якими можуть працювати адміністратори форуму. Кожен користувач може належати до кількох груп, а кожній групі можна призначити окремі права. Це надає адміністраторам простий спосіб змінювати права для багатьох користувачів одночасно, наприклад, змінювати права модератора або надавати користувачам доступ до приватного форуму.',
	'HELP_FAQ_GROUPS_USERGROUPS_JOIN_ANSWER'	=> 'Ви можете переглянути всі групи користувачів через посилання «Групи користувачів» у панелі керування користувача. Якщо ви бажаєте приєднатися до однієї з них, натисніть відповідну кнопку. Втім, не всі групи мають відкритий доступ. Для приєднання до деяких може знадобитися схвалення, деякі можуть бути закритими, а деякі можуть навіть мати приховане членство. Якщо група відкрита, ви можете приєднатися до неї, натиснувши відповідну кнопку. Якщо для приєднання до групи потрібне схвалення, ви можете надіслати запит на приєднання, натиснувши відповідну кнопку. Лідеру групи користувачів потрібно буде схвалити ваш запит, і він може запитати, чому ви бажаєте приєднатися до групи. Будь ласка, не турбуйте лідера групи, якщо він відхилить ваш запит — на це є свої причини.',
	'HELP_FAQ_GROUPS_USERGROUPS_JOIN_QUESTION'	=> 'Де знаходяться групи користувачів і як приєднатися до однієї з них?',
	'HELP_FAQ_GROUPS_USERGROUPS_LEAD_ANSWER'	=> 'Лідера групи користувачів зазвичай призначають, коли групу користувачів спочатку створює адміністратор форуму. Якщо ви зацікавлені у створенні групи користувачів, вашою першою точкою контакту має бути адміністратор; спробуйте надіслати особисте повідомлення.',
	'HELP_FAQ_GROUPS_USERGROUPS_LEAD_QUESTION'	=> 'Як стати лідером групи користувачів?',
	'HELP_FAQ_GROUPS_USERGROUPS_QUESTION'	=> 'Що таке групи користувачів?',

	'HELP_FAQ_ISSUES_ADMIN_ANSWER'	=> 'Всі користувачі форуму можуть скористатися формою «Зв’яжіться з нами», якщо цей параметр увімкнено адміністратором форуму.<br />Учасники форуму також можуть скористатися посиланням «Команда».',
	'HELP_FAQ_ISSUES_ADMIN_QUESTION'	=> 'Як зв’язатися з адміністратором форуму?',
	'HELP_FAQ_ISSUES_FEATURE_ANSWER'	=> 'Це програмне забезпечення написано та ліцензовано компанією phpBB Limited. Якщо ви вважаєте, що потрібно додати якусь функцію, будь ласка, відвідайте <a href="https://www.phpbb.com/ideas/">Центр ідей phpBB</a>, де ви можете підтримати наявні ідеї або запропонувати нові функції.',
	'HELP_FAQ_ISSUES_FEATURE_QUESTION'	=> 'Чому недоступна функція X?',
	'HELP_FAQ_ISSUES_LEGAL_ANSWER'	=> 'Будь-хто з адміністраторів, перелічених на сторінці «Команда», має бути відповідною точкою контакту для ваших скарг. Якщо це все ще не дає відповіді, вам слід зв’язатися з власником домену (виконайте <a href="http://www.google.com/search?q=whois">пошук whois</a>) або, якщо це працює на безкоштовному сервісі (напр. Yahoo!, free.fr, f2s.com тощо), з керівництвом або відділом боротьби зі зловживаннями цього сервісу. Зверніть увагу, phpBB Limited не має <strong>абсолютно жодної юрисдикції</strong> і жодним чином не може нести відповідальності за те, як, де чи ким використовується цей форум. Не звертайтеся до phpBB Limited з будь-яких юридичних питань (припинення діяльності, наклеп, дифамаційні коментарі тощо), <strong>не пов’язаних напряму</strong> з вебсайтом phpBB.com чи самим програмним забезпеченням phpBB. Якщо ви надішлете лист до phpBB Limited <strong>щодо використання цього програмного забезпечення третьою стороною</strong>, очікуйте лаконічну відповідь або її відсутність.',
	'HELP_FAQ_ISSUES_LEGAL_QUESTION'	=> 'До кого звертатися з приводу зловживань та/або юридичних питань, пов’язаних з цим форумом?',
	'HELP_FAQ_ISSUES_WHOIS_PHPBB_ANSWER'	=> 'Це програмне забезпечення (у своєму немодифікованому вигляді) вироблено, випущено та захищено авторським правом <a href="https://www.phpbb.com/">phpBB Limited</a>. Воно поширюється за ліцензією GNU General Public License, версія 2 (GPL-2.0) і може вільно розповсюджуватися. Див. <a href="https://www.phpbb.com/about/">Про phpBB</a> для отримання додаткової інформації.',
	'HELP_FAQ_ISSUES_WHOIS_PHPBB_QUESTION'	=> 'Хто написав цей форум?',

	'HELP_FAQ_LOGIN_AUTO_LOGOUT_ANSWER'	=> 'Якщо ви не позначите поле <em>Запам’ятати мене</em> під час входу, форум зберігатиме ваш вхід лише протягом наперед встановленого часу. Це запобігає зловживанню вашим обліковим записом кимось іншим. Щоб залишатися увійшовши, позначте поле <em>Запам’ятати мене</em> під час входу. Це не рекомендується, якщо ви заходите на форум зі спільного комп’ютера, напр. бібліотека, інтернет-кафе, комп’ютерний клас університету тощо. Якщо ви не бачите цього прапорця, це означає, що адміністратор форуму вимкнув цю функцію.',
	'HELP_FAQ_LOGIN_AUTO_LOGOUT_QUESTION'	=> 'Чому мене автоматично виводить з системи?',
	'HELP_FAQ_LOGIN_CANNOT_LOGIN_ANSWER'	=> 'Це може статися з кількох причин. Спочатку переконайтеся, що ваше ім’я користувача та пароль правильні. Якщо це так, зверніться до адміністратора форуму, щоб переконатися, що вас не заблоковано. Також можливо, що на боці власника сайту сталася помилка конфігурації, яку йому потрібно виправити.',
	'HELP_FAQ_LOGIN_CANNOT_LOGIN_ANYMORE_ANSWER'	=> 'Можливо, адміністратор деактивував або видалив ваш обліковий запис з якоїсь причини. Крім того, багато форумів періодично видаляють користувачів, які довго не публікували повідомлень, щоб зменшити розмір бази даних. Якщо це сталося, спробуйте зареєструватися знову та брати активнішу участь в обговореннях.',
	'HELP_FAQ_LOGIN_CANNOT_LOGIN_ANYMORE_QUESTION'	=> 'Я реєструвався раніше, але більше не можу увійти?!',
	'HELP_FAQ_LOGIN_CANNOT_LOGIN_QUESTION'	=> 'Чому я не можу увійти?',
	'HELP_FAQ_LOGIN_CANNOT_REGISTER_ANSWER'	=> 'Можливо, адміністратор форуму вимкнув реєстрацію, щоб запобігти реєстрації нових відвідувачів. Адміністратор форуму також міг заблокувати вашу IP-адресу або заборонити ім’я користувача, яке ви намагаєтеся зареєструвати. Зверніться по допомогу до адміністратора форуму.',
	'HELP_FAQ_LOGIN_CANNOT_REGISTER_QUESTION'	=> 'Чому я не можу зареєструватися?',
	'HELP_FAQ_LOGIN_COPPA_ANSWER'	=> 'COPPA, або Закон про захист конфіденційності дітей в інтернеті 1998 року, — це закон у США, що вимагає від вебсайтів, які потенційно можуть збирати інформацію від неповнолітніх віком до 13 років, мати письмову згоду батьків чи інший метод підтвердження законного опікуна, що дозволяє збирати особисту інформацію про неповнолітнього віком до 13 років. Якщо ви не впевнені, чи стосується це вас як особи, що намагається зареєструватися, або вебсайту, на якому ви намагаєтеся зареєструватися, зверніться по допомогу до юридичного консультанта. Зверніть увагу, phpBB Limited та власники цього форуму не можуть надавати юридичні консультації і не є точкою контакту для будь-яких юридичних питань, окрім описаних у питанні «До кого звертатися з приводу зловживань та/або юридичних питань, пов’язаних з цим форумом?».',
	'HELP_FAQ_LOGIN_COPPA_QUESTION'	=> 'Що таке COPPA?',
	'HELP_FAQ_LOGIN_DELETE_COOKIES_ANSWER'	=> '«Видалити файли cookie» видаляє файли cookie, створені phpBB, які підтримують вашу автентифікацію та вхід на форум. Файли cookie також забезпечують такі функції, як відстеження прочитаного, якщо їх увімкнено адміністратором форуму. Якщо у вас проблеми зі входом чи виходом, видалення файлів cookie форуму може допомогти.',
	'HELP_FAQ_LOGIN_DELETE_COOKIES_QUESTION'	=> 'Що робить «Видалити файли cookie»?',
	'HELP_FAQ_LOGIN_LOST_PASSWORD_ANSWER'	=> 'Не панікуйте! Хоча ваш пароль неможливо відновити, його легко скинути. Відвідайте сторінку входу та натисніть <em>Я забув свій пароль</em>. Дотримуйтесь інструкцій, і незабаром ви зможете знову увійти.<br />Однак якщо вам не вдається скинути пароль, зверніться до адміністратора форуму.',
	'HELP_FAQ_LOGIN_LOST_PASSWORD_QUESTION'	=> 'Я загубив свій пароль!',
	'HELP_FAQ_LOGIN_REGISTER_ANSWER'	=> 'Можливо, це не обов’язково — це залежить від адміністратора форуму, чи потрібна вам реєстрація для публікації повідомлень. Однак реєстрація надасть вам доступ до додаткових функцій, недоступних гостям, таких як зображення аватарів, що визначаються користувачем, особисті повідомлення, надсилання листів іншим користувачам, підписка на групи користувачів тощо. Реєстрація займає лише кілька хвилин, тож радимо зареєструватися.',
	'HELP_FAQ_LOGIN_REGISTER_CONFIRM_ANSWER'	=> 'Спочатку перевірте своє ім’я користувача та пароль. Якщо вони правильні, могло статися одне з двох. Якщо увімкнено підтримку COPPA і ви вказали, що вам менше 13 років під час реєстрації, вам потрібно буде дотримуватися отриманих інструкцій. Деякі форуми також вимагають активації нових реєстрацій, самостійно або адміністратором, перш ніж ви зможете увійти; ця інформація була показана під час реєстрації. Якщо вам надіслали листа, дотримуйтесь інструкцій. Якщо ви не отримали листа, можливо, ви вказали неправильну email-адресу, або лист потрапив до спам-фільтра. Якщо ви впевнені, що вказана вами email-адреса правильна, спробуйте зв’язатися з адміністратором.',
	'HELP_FAQ_LOGIN_REGISTER_CONFIRM_QUESTION'	=> 'Я зареєструвався, але не можу увійти!',
	'HELP_FAQ_LOGIN_REGISTER_QUESTION'	=> 'Навіщо мені реєструватися?',

	'HELP_FAQ_PMS_CANNOT_SEND_ANSWER'	=> 'Для цього є три причини: ви не зареєстровані та/або не увійшли, адміністратор форуму вимкнув особисті повідомлення для всього форуму, або адміністратор форуму заборонив вам надсилати повідомлення. Зверніться по додаткову інформацію до адміністратора форуму.',
	'HELP_FAQ_PMS_CANNOT_SEND_QUESTION'	=> 'Я не можу надсилати особисті повідомлення!',
	'HELP_FAQ_PMS_SPAM_ANSWER'	=> 'Нам прикро це чути. Функція email-форми цього форуму містить механізми захисту для відстеження користувачів, які надсилають такі повідомлення, тож напишіть адміністратору форуму з повною копією отриманого листа. Дуже важливо, щоб він включав заголовки з деталями про користувача, який надіслав лист. Тоді адміністратор форуму зможе вжити заходів.',
	'HELP_FAQ_PMS_SPAM_QUESTION'	=> 'Я отримав спам чи образливий лист від когось на цьому форумі!',
	'HELP_FAQ_PMS_UNWANTED_ANSWER'	=> 'Ви можете автоматично видаляти особисті повідомлення від користувача за допомогою правил повідомлень у панелі керування користувача. Якщо ви отримуєте образливі особисті повідомлення від конкретного користувача, повідомте про це модераторам; вони мають повноваження заборонити користувачу надсилати особисті повідомлення.',
	'HELP_FAQ_PMS_UNWANTED_QUESTION'	=> 'Я постійно отримую небажані особисті повідомлення!',

	'HELP_FAQ_POSTING_BUMP_ANSWER'	=> 'Натиснувши посилання «Підняти тему» під час її перегляду, ви можете «підняти» тему до верху форуму на першій сторінці. Однак якщо ви не бачите цього, підняття теми може бути вимкнено, або ще не минув дозволений час між підняттями. Також можна підняти тему, просто відповівши на неї, однак переконайтеся, що дотримуєтесь правил форуму, роблячи це.',
	'HELP_FAQ_POSTING_BUMP_QUESTION'	=> 'Як підняти свою тему?',
	'HELP_FAQ_POSTING_CREATE_ANSWER'	=> 'Щоб опублікувати нову тему у форумі, натисніть «Нова тема». Щоб опублікувати відповідь на тему, натисніть «Надіслати відповідь». Можливо, вам потрібно зареєструватися, перш ніж ви зможете публікувати повідомлення. Список ваших прав у кожному форумі доступний внизу екранів форуму та теми. Наприклад: Ви можете створювати нові теми, Ви можете додавати вкладення тощо.',
	'HELP_FAQ_POSTING_CREATE_QUESTION'	=> 'Як створити нову тему або опублікувати відповідь?',
	'HELP_FAQ_POSTING_DRAFT_ANSWER'	=> 'Це дозволяє зберігати чернетки, щоб завершити та надіслати їх пізніше. Щоб завантажити збережену чернетку, відвідайте панель керування користувача.',
	'HELP_FAQ_POSTING_DRAFT_QUESTION'	=> 'Для чого призначена кнопка «Зберегти» під час публікації теми?',
	'HELP_FAQ_POSTING_EDIT_DELETE_ANSWER'	=> 'Якщо ви не адміністратор чи модератор форуму, ви можете редагувати чи видаляти лише власні повідомлення. Ви можете відредагувати повідомлення, натиснувши кнопку редагування для відповідного повідомлення, іноді лише протягом обмеженого часу після публікації. Якщо хтось вже відповів на повідомлення, під ним ви побачите невеликий текст, коли повернетеся до теми, у якому вказано кількість разів, коли ви його редагували, разом з датою та часом. Це з’явиться, лише якщо хтось надіслав відповідь; це не з’явиться, якщо повідомлення редагував модератор чи адміністратор, хоча вони можуть за власним бажанням залишити примітку про причину редагування. Зверніть увагу, звичайні користувачі не можуть видалити повідомлення, якщо хтось на нього вже відповів.',
	'HELP_FAQ_POSTING_EDIT_DELETE_QUESTION'	=> 'Як редагувати чи видалити повідомлення?',
	'HELP_FAQ_POSTING_FORUM_RESTRICTED_ANSWER'	=> 'Деякі форуми можуть бути обмежені для певних користувачів або груп. Щоб переглядати, читати, публікувати або виконувати іншу дію, вам можуть знадобитися особливі права. Зверніться до модератора чи адміністратора форуму, щоб надати вам доступ.',
	'HELP_FAQ_POSTING_FORUM_RESTRICTED_QUESTION'	=> 'Чому я не можу отримати доступ до форуму?',
	'HELP_FAQ_POSTING_NO_ATTACHMENTS_ANSWER'	=> 'Права на вкладення надаються для кожного форуму, групи чи користувача окремо. Адміністратор форуму міг не дозволити додавати вкладення в конкретному форумі, де ви публікуєте повідомлення, або, можливо, лише певні групи можуть додавати вкладення. Зверніться до адміністратора форуму, якщо не впевнені, чому ви не можете додати вкладення.',
	'HELP_FAQ_POSTING_NO_ATTACHMENTS_QUESTION'	=> 'Чому я не можу додавати вкладення?',
	'HELP_FAQ_POSTING_POLL_ADD_ANSWER'	=> 'Обмеження на варіанти опитування встановлює адміністратор форуму. Якщо ви вважаєте, що вам потрібно додати більше варіантів до опитування, ніж дозволена кількість, зверніться до адміністратора форуму.',
	'HELP_FAQ_POSTING_POLL_ADD_QUESTION'	=> 'Чому я не можу додати більше варіантів опитування?',
	'HELP_FAQ_POSTING_POLL_CREATE_ANSWER'	=> 'Публікуючи нову тему або редагуючи перше повідомлення теми, натисніть вкладку «Створення опитування» під основною формою публікації; якщо ви її не бачите, у вас немає відповідних прав для створення опитувань. Введіть назву та щонайменше два варіанти у відповідних полях, переконуючись, що кожен варіант розташовано в окремому рядку текстового поля. Ви також можете встановити кількість варіантів, які користувачі можуть обрати під час голосування, у полі «Варіантів на користувача», обмеження часу в днях для опитування (0 для необмеженої тривалості) і, нарешті, параметр, що дозволяє користувачам змінювати свої голоси.',
	'HELP_FAQ_POSTING_POLL_CREATE_QUESTION'	=> 'Як створити опитування?',
	'HELP_FAQ_POSTING_POLL_EDIT_ANSWER'	=> 'Як і з повідомленнями, опитування можуть редагувати лише автор оригінального повідомлення, модератор чи адміністратор. Щоб редагувати опитування, натисніть для редагування перше повідомлення теми; воно завжди має пов’язане з ним опитування. Якщо ніхто ще не проголосував, користувачі можуть видалити опитування чи редагувати будь-який варіант опитування. Однак якщо учасники вже проголосували, лише модератори чи адміністратори можуть редагувати чи видаляти його. Це запобігає зміні варіантів опитування посеред голосування.',
	'HELP_FAQ_POSTING_POLL_EDIT_QUESTION'	=> 'Як редагувати чи видалити опитування?',
	'HELP_FAQ_POSTING_QUEUE_ANSWER'	=> 'Адміністратор форуму міг вирішити, що повідомлення у форумі, куди ви публікуєте, вимагають перегляду перед публікацією. Також можливо, що адміністратор помістив вас до групи користувачів, чиї повідомлення вимагають перегляду перед публікацією. Будь ласка, зверніться до адміністратора форуму за додатковими деталями.',
	'HELP_FAQ_POSTING_QUEUE_QUESTION'	=> 'Чому моє повідомлення потрібно схвалювати?',
	'HELP_FAQ_POSTING_REPORT_ANSWER'	=> 'Якщо адміністратор форуму дозволив це, ви побачите кнопку для скарги на повідомлення поруч з тим, на яке ви бажаєте поскаржитися. Натиснувши її, ви пройдете кроки, необхідні для подання скарги на повідомлення.',
	'HELP_FAQ_POSTING_REPORT_QUESTION'	=> 'Як мені поскаржитися модератору на повідомлення?',
	'HELP_FAQ_POSTING_SIGNATURE_ANSWER'	=> 'Щоб додати підпис до повідомлення, вам спочатку потрібно створити його через панель керування користувача. Після створення ви можете позначити поле <em>Додати підпис</em> у формі публікації, щоб додати свій підпис. Ви також можете додавати підпис за замовчуванням до всіх ваших повідомлень, позначивши відповідну радіокнопку в панелі керування користувача. Якщо ви це зробите, ви все ще можете запобігти додаванню підпису до окремих повідомлень, знявши позначку з поля додавання підпису у формі публікації.',
	'HELP_FAQ_POSTING_SIGNATURE_QUESTION'	=> 'Як додати підпис до мого повідомлення?',
	'HELP_FAQ_POSTING_WARNING_ANSWER'	=> 'Кожен адміністратор форуму має власний набір правил для свого сайту. Якщо ви порушили правило, вам може бути видано попередження. Зверніть увагу, це рішення адміністратора форуму, і phpBB Limited не має жодного стосунку до попереджень на конкретному сайті. Зверніться до адміністратора форуму, якщо не впевнені, чому вам видано попередження.',
	'HELP_FAQ_POSTING_WARNING_QUESTION'	=> 'Чому я отримав попередження?',

	'HELP_FAQ_SEARCH_BLANK_ANSWER'	=> 'Ваш пошук повернув забагато результатів для обробки веб-сервером. Скористайтеся «Розширеним пошуком» і будьте більш конкретними у використаних термінах та форумах для пошуку.',
	'HELP_FAQ_SEARCH_BLANK_QUESTION'	=> 'Чому мій пошук повертає порожню сторінку!?',
	'HELP_FAQ_SEARCH_FORUM_ANSWER'	=> 'Введіть пошуковий термін у полі пошуку, розташованому на головній сторінці, сторінці форуму чи теми. Розширений пошук доступний за посиланням «Розширений пошук», яке є на всіх сторінках форуму. Спосіб доступу до пошуку може залежати від використовуваного стилю.',
	'HELP_FAQ_SEARCH_FORUM_QUESTION'	=> 'Як шукати у форумі чи форумах?',
	'HELP_FAQ_SEARCH_MEMBERS_ANSWER'	=> 'Відвідайте список учасників і натисніть посилання «Знайти учасника».',
	'HELP_FAQ_SEARCH_MEMBERS_QUESTION'	=> 'Як шукати учасників?',
	'HELP_FAQ_SEARCH_NO_RESULT_ANSWER'	=> 'Ваш пошук, ймовірно, був занадто розпливчастим і включав багато поширених термінів, які не індексуються phpBB. Будьте більш конкретними та використовуйте параметри, доступні в розширеному пошуку.',
	'HELP_FAQ_SEARCH_NO_RESULT_QUESTION'	=> 'Чому мій пошук не повертає результатів?',
	'HELP_FAQ_SEARCH_OWN_ANSWER'	=> 'Власні повідомлення можна знайти, натиснувши посилання «Показати ваші повідомлення» в панелі керування користувача, або натиснувши посилання «Шукати повідомлення користувача» на власній сторінці профілю, або натиснувши меню «Швидкі посилання» вгорі форуму. Щоб знайти власні теми, скористайтеся сторінкою розширеного пошуку та заповніть відповідні параметри.',
	'HELP_FAQ_SEARCH_OWN_QUESTION'	=> 'Як знайти власні повідомлення й теми?',

	'HELP_FAQ_USERSETTINGS_AVATAR_ANSWER'	=> 'Є два зображення, які можуть з’являтися поруч з іменем користувача під час перегляду повідомлень. Одне з них може бути зображенням, пов’язаним з вашим званням, зазвичай у вигляді зірок, блоків чи крапок, що вказує на кількість опублікованих вами повідомлень або ваш статус на форумі. Інше, зазвичай більше, зображення відоме як аватар і, як правило, є унікальним чи особистим для кожного користувача.',
	'HELP_FAQ_USERSETTINGS_AVATAR_DISPLAY_ANSWER'	=> 'У вашій панелі керування користувача, в розділі «Профіль», ви можете додати аватар одним з чотирьох наступних способів: Gravatar, Галерея, Віддалений або Завантаження. Саме адміністратор форуму вирішує, чи вмикати аватари та яким чином робити їх доступними. Якщо ви не можете використовувати аватари, зверніться до адміністратора форуму.',
	'HELP_FAQ_USERSETTINGS_AVATAR_DISPLAY_QUESTION'	=> 'Як показати аватар?',
	'HELP_FAQ_USERSETTINGS_AVATAR_QUESTION'	=> 'Що це за зображення поруч з моїм іменем користувача?',
	'HELP_FAQ_USERSETTINGS_CHANGE_SETTINGS_ANSWER'	=> 'Якщо ви зареєстрований користувач, усі ваші налаштування зберігаються в базі даних форуму. Щоб змінити їх, відвідайте панель керування користувача; посилання зазвичай можна знайти, натиснувши на своє ім’я користувача вгорі сторінок форуму. Ця система дозволить вам змінити всі свої налаштування та параметри.',
	'HELP_FAQ_USERSETTINGS_CHANGE_SETTINGS_QUESTION'	=> 'Як змінити свої налаштування?',
	'HELP_FAQ_USERSETTINGS_EMAIL_LOGIN_ANSWER'	=> 'Лише зареєстровані користувачі можуть надсилати листи іншим користувачам через вбудовану форму email, і лише якщо адміністратор увімкнув цю функцію. Це запобігає зловмисному використанню системи email анонімними користувачами.',
	'HELP_FAQ_USERSETTINGS_EMAIL_LOGIN_QUESTION'	=> 'Коли я натискаю посилання email для користувача, воно просить мене увійти?',
	'HELP_FAQ_USERSETTINGS_HIDE_ONLINE_ANSWER'	=> 'У вашій панелі керування користувача, в розділі «Налаштування форуму», ви знайдете параметр <em>Сховати мій статус онлайн</em>. Увімкніть цей параметр, і ви будете видимі лише адміністраторам, модераторам і собі. Вас буде враховано як прихованого користувача.',
	'HELP_FAQ_USERSETTINGS_HIDE_ONLINE_QUESTION'	=> 'Як запобігти появі мого імені користувача в списках користувачів онлайн?',
	'HELP_FAQ_USERSETTINGS_LANGUAGE_ANSWER'	=> 'Або адміністратор не встановив вашу мову, або ніхто не переклав цей форум вашою мовою. Спробуйте запитати адміністратора форуму, чи може він встановити потрібний вам мовний пакет. Якщо мовного пакета не існує, не соромтеся створити новий переклад. Додаткову інформацію можна знайти на сайті <a href="https://www.phpbb.com/">phpBB</a>&reg;.',
	'HELP_FAQ_USERSETTINGS_LANGUAGE_QUESTION'	=> 'Моєї мови немає в списку!',
	'HELP_FAQ_USERSETTINGS_RANK_ANSWER'	=> 'Звання, що з’являються під вашим іменем користувача, вказують на кількість опублікованих вами повідомлень або визначають певних користувачів, напр. модераторів та адміністраторів. Загалом, ви не можете напряму змінити формулювання будь-яких звань форуму, оскільки їх встановлює адміністратор форуму. Будь ласка, не зловживайте форумом, публікуючи повідомлення без потреби лише для підвищення свого звання. Більшість форумів цього не толерують, і модератор чи адміністратор просто зменшить кількість ваших повідомлень.',
	'HELP_FAQ_USERSETTINGS_RANK_QUESTION'	=> 'Яке моє звання і як його змінити?',
	'HELP_FAQ_USERSETTINGS_SERVERTIME_ANSWER'	=> 'Якщо ви впевнені, що правильно встановили часовий пояс, а час все ще неправильний, тоді час, збережений на годиннику сервера, неправильний. Будь ласка, повідомте адміністратора, щоб виправити цю проблему.',
	'HELP_FAQ_USERSETTINGS_SERVERTIME_QUESTION'	=> 'Я змінив часовий пояс, а час все ще неправильний!',
	'HELP_FAQ_USERSETTINGS_TIMEZONE_ANSWER'	=> 'Можливо, показаний час належить до іншого часового поясу, ніж той, де перебуваєте ви. Якщо це так, відвідайте панель керування користувача та змініть свій часовий пояс відповідно до вашого регіону, напр. Лондон, Париж, Нью-Йорк, Сідней тощо. Зверніть увагу, зміна часового поясу, як і більшість налаштувань, доступна лише зареєстрованим користувачам. Якщо ви не зареєстровані, зараз саме час це зробити.',
	'HELP_FAQ_USERSETTINGS_TIMEZONE_QUESTION'	=> 'Час показано неправильно!',
));
